{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title","getFn":null},{"path":["body"],"id":"body","weight":1,"src":"body","getFn":null}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Root","n":1},"1":{"v":"# <span style=\"background-color: #12ffd7; color: black;\">Landing page</span>\nNotes on James Glattfelder's thesis, *Decoding Complexity: Uncovering Patterns in Economic Networks*.","n":0.236}}},{"i":2,"$":{"0":{"v":"World Trade Network","n":0.577},"1":{"v":"Notes on the topic of the International Trade Network, in preparation for Le Grande Thesis de la Turbo Huang, esq.","n":0.224}}},{"i":3,"$":{"0":{"v":"Network Analysis and Topology","n":0.5},"1":{"v":"Papers related to analysis of the International Trade Network from the perspective of complex network theory.","n":0.25}}},{"i":4,"$":{"0":{"v":"World Trade Network","n":0.577},"1":{"v":"### De Benedictis and Tajoli \n\nA complex-network analysis of three issues in the World Trade Network: the effects of the WTO on trade integration, the value of network indices vs. the gravity model of trade, and the structural difference between intensive and extensive margins of trade.\n\n****\n\n## Methods\n\n### Definition of the WTN\n\n- Paper considers simple binary directed WTN for the most part; some models consider the weight matrix $W$\n\n### Summary network statistics\n\n- In-degree; out-degree\n- Clustering coefficient\n- **Density** $\\gamma = \\frac{2\\ * \\text{ no. of links in graph}}{n(n-1)}$ where $n\\choose{2}$ $= \\frac{n(n-1)}{2}$ is the maximum possible number of links in a graph with $n$ nodes.\n- **Ego-density** is density for a specific sub-graph of the graph.\n- Centrality:\n    - Degree centrality (in-degree or out-degree divided by $n-1$ for $n$ total nodes)\n    - Closeness centrality (geodesic distance) = reciprocal of average distance between node and other nodes\n    - Betweenness centrality\n- Centralization:\n\n> <span style=\"background-color: #03cafc; color: black;\">Definition</span>. **Centralization metrics** extend centrality metrics to the entire network: in-degree, out-degree, closeness, and betweenness centralization.\n\n- Degree centralization: $C^d = \\frac{\\sum_{i=1}^n |C^d_i - C^*|}{(n-2)(n-1)}$ for a graph with $n$ nodes, where $C^d_i$ is the degree centrality (either in- or out-degree) of node $i$ and $C^*$ is the maximum degree centrality of a nodee in the graph.\n\n> <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. For a graph with $n$ nodes, degree centralization is the cumulative difference of the degree centrality of the nodes to the maximum centrality of the graph, divided by the maximum possible centralization score $(n-2)(n-1)$. Essentially, it is the variance of the centrality.\n- The minimum degree centralization is zero; this is if all nodes have the same degree. The maximum degree centralization is one; this is if one node has the highest degree and all other nodes have zero degree (e.g. a star).\n\n- Closeness centralization: $C^c = \\frac{\\sum_{i=1}^n |C^c_i - C^*|}{(n-1)(n-2)/(2n-3)}$ where $C^c_i$ denotes the closeness centrality of node $i$ and the denominator is again the maximum possible value of the numerator.\n\n- Betweenness centralization: $C^b = \\sum_{i}^n |C^b_i - C^*|$ as above.\n\n> <span style=\"background-color: #03cafc; color: black;\">Definition</span>. The **intensive margin of trade** refers to changes in a trade link that has already been established; the **extensive margin of trade** refers to the creation of nonexistent trade links.\n\n### Literature review\n- Complex network properties of WTN ([[International Trade Network.Network Analysis.Topology of the World Trade Web]])\n    - Scale-free degree distribution (inverse power law)\n    - Small-world property (distance grows logarithmically with graph size)\n    - High clustering coefficient\n    - Degree-degree \n- Complex network finding implied that WTN linkages reflect some underlying distribution and are not created randomly\n\n- Kali and Reyes (Trade Structures and Economic Growth) - WTN strongly **hierarchical** (community structures), scale-free, dissortative\n- Fagolio et al. ([[International Trade Network.Network Analysis.Topology of the World Trade Web.Fagiolo et al]]) - links weighted by average of exports and imports; disassortative network; large hubs vs. majority of weakly connected countries\n\n## Results\n\n### Extent of changes in the WTN from 1950-2000\n\n- **Dataset**: IMF direction of trade statistics; 1950-2000, bilateral imports (aggregated), deflated by US CPI\n\n    - World trade concentrated in sub-group of countries:\n        - In 1950, 20.6% of trade flows made up 90% of trade; in 2000, 7% made up 90% of trade\n            - Small trade flows have increased\n        - In 1950, the top 1% of trade flows made up 29.25% of trade; in 2000, it made up for 58% of trade\n        - Trade more and more top-concentrated over time\n    - Correlation between GDP and number of trade partners positive but not strong ($R = 0.55$)\n    - Dataset adjustments: kept number of countries constant from 1950-1990 (157). 1990-2000 had 176 countries (new countries created from dissolution of USSR). Missing observations counted as zero.\n\n- Properties of the WTN and changes over time:\n    - Rising density: 0.0673 in 1950 to 0.3876 in 2000\n        - Still much lower than a complete network (density 1)\n    - Reduction in average distance between nodes\n    - In-degree closeness centralization rises over time until 1980s then falls\n        - Indicates the existence of a core, concentrated group of markets (1980s), then a more diversified import group\n    - In-degree centralization larger than out-degree centralization; imports different from exports\n    - Decline in betweenness centralization from 1960 to 2000 indicating reduction of hubs\n    - Shape of WTN degree distribution changes over time\n        - Out-degree: initially left-skewed, bimodal w/ one large peak at the left (small exporters) and one smaller peak at the right (large hubs). Then left peak tends more and more towards center -> large number of average-sized exporters with small number of hubs\n        - This indicates that the WTN is divided into a group of small exporters, a group of large hubs, and a continuum of countries in between -> not simply a core-periphery structure\n    - WTN is statistically significantly not a complete network, but increases in WTN density are statistically dismissable (level of confidence $p = 0.173$)\n\n### Countries' positions in the WTN\n\n- 1960: US highest out-degree; UK highest in-degree (colonialism)\n- 1980: EU rises; UK highest both out- and in-degree; first places all taken by EU countries\n- 2000: US first in both degrees; developing countries now rapidly increasing in degrees; SEA rises\n- Centrality:\n    - EU highest for all centralities in 1960s\n    - In-degree and out-degree correlation positive, 0.95 in 2000; increases over time, world no longer divided into \"importers\" and \"exporters\", biggest exporters are biggest importers\n    - Closeness centrality and betweenness centrality correlated at 0.62 in 2000\n    - HK, France, India, Morocco, Switzerland \"regional hubs\" - i.e. highest beetwenness centrality in region\n    \n![alt text](image.png)\n\n### Gravity model corroboration\n\n> <span style=\"background-color: #12ffd7; color: black;\">Model</span>. The **gravity model of trade** predicts the following relationship between two countries' GDP, their distance, and the magnitude of their bilateral trade:\n$$\nL_{ij} = A\\frac{GDP_i * GDP_j}{D_{ij}}\n$$\n> where $A$ is a constant, $L_{ij}$ denotes bilateral trade between $i$ and $j$, and $D_{ij}$ denotes distance between $i$ and $j$.\n\n- Gravity model predicts a complete network (density 1) because distances are not infinite; however, density in 2000 is only 0.5. Why do some pairs of countries not have existing trade links?\n\n> <span style=\"background-color: #12ffd7; color: black;\">Model</span>. **Heckscher-Ohlin model**. According to this model, two countries will have no trade if their products are perfect substitutes: they do not need the products of the other country. Thus we have\n\n$$\nL_{ij} = \\frac{GDP_i * GDP_j}{GDP_W} (1+\\sum_{k} \\lambda_k \\alpha_{ik}\\beta_{jk})\n$$\n\n> where $GDP_W$ is world GDP, $k$ are products produced by $i$ and $j$, $\\lambda_k$ are weights assigned to the products, and $\\alpha_{ik}$ and $\\beta_{jk}$ are how much the production of product $k$ by country $i$ (the exporter) deviates from the world average and how much the consumption of product $k$ by country $i$ (the importer) deviates from the world average, reflecting how much $k$ matters to the countries.\n\nE.g. if $\\alpha_{ik} = 1$ (100% deviation) and $\\beta_{ik} = -1$ (-100% deviation), reflecting a scenario where $i$ is a great producer of $k$ but $j$ is not a consumer of $k$ at all, the summed term is $-1$ and $L_{ij} = 0$.\n\nEssentially, the model states that if $i$ and $j$ have heterogeneous (different) tastes in production and consumption, they will not trade; thus they will have no trade link on the WTN. The increase in links in the WTN reflects a greater homogenization in country preferences.\n\nAnother explanation is given by Helpman et al. (2008):\n- Some costs are specific to a certain country-country pair\n- Fixed costs of exporting; difference in productivity/efficiency between countries\n- Some firms are not productive enough to serve every single country in the world\n- This theory posits that reductions in trade costs over time (globalization) explains increase in trade links/creation of new trade links\n\nA reduction in global trade costs have different (heterogeneous) effects on countries, according to all above models: \n- Creates new connections via lessening fixed costs of exporting (**extensive margin of trade**)\n- Reduces friction between products\n\n### Network analysis contributions to the gravity model\n\n- **Multilateral resistance terms** in the gravity model are terms that represent the transaction costs from country $i$ to $j$, as well as supply costs in $i$ and demand costs in $j$\n- Analysis via gravity model doesn't usually include these terms; instead, they are analyzed on a country-to-country basis\n- Network analysis of the WTN can replace such terms:\n    - In-degree reflects demand costs of $j$, the importer (higher in-degree = $j$ handles imports from more countries = less importing costs)\n    - Out-degree reflects supply costs, as above\n    - Centralities (e.g. closeness) reflect transaction costs\n- Results of regression w/ gravity model and network metrics:\n    - Pos. correlation between both in-degree and out-degree centrality and trade flows\n    - Distance term in gravity model less important (centrality reflects distance but only partially)\n    - Importer GDP reduced significantly in importance -> position of country in WTN reflects trade more than GDP\n    - WTO membership parameter becomes statistically indistinguishable from 0 -> position in WTN reflects WTO membership\n        - WTO contributes to trade, but not directly; it affects country's position in WTN\n    - WTO membership becomes significant when network metrics are removed\n\n### Role of WTO in world trade network\n- Subramanian and Wei (2007): WTO promotes trade, strongly but unevenly\n- Network analysis can show WTO impact on entire system\n- Network constructed from WTO members:\n    - Denser than regular WTN\n    - Increases in size over time (more countries join WTN)\n    - More closely interconnected\n    - Higher number of linkages than regular network - lower entry costs to markets? Creates new trade links, e.g. by increasing cost transparency\n    - Less centralized (more even in centrality) than WTN\n    - Center of WTN are all WTO members by 2000 (with China joining in 2001)\n\n### Regionalization of international trade\n\n- Are there more trade flows between geographically close countries (e.g. in the same continent)?\n- Continental subnetworks of trade:\n    - Density higher than world density (except Africa)\n    - Intra-continent trade flows only 27% of total\n    - Density index in continents decline while world increases (e.g. Europe - density decreases from 1980 to 2000), perhaps due to dissolution of USSR\n    - The EU has density 1; non-EU countries in Europe are not well-connected\n    - Most continents have \"central hubs\" (e.g. Mexico, the US and Canada for the Americas)\n\n### Extensive and intensive margins of trade\n- Felbermayr and Kohler (2005): 60% of world trade growth from 1950 to 1997 has been in the intensive margin (not newly created trade links)\n- Lawless (2008): for gravity models, country-country indices like language, geography, infrastructure etc. only affect the extensive margin (i.e. whether or not trade is created) and distance is a much larger barrier to the extensive than the intensive margin\n- Systemically, the two margins can be studied using a decomposition of the WTN into an intensive and extensive network:\n    - 1980 to 1990:\n        - Extensive network: if no trade between $i$ and $j$ in 1980 but trade created by 1990, link between $i$ and $j$; otherwise no link\n        - Intensive margin:\n            - Positive component = positive changes in trade in existing relationships from 1980 to 1990\n            - Negative component = negative changes in trade\n    - Transformed to binary directed networks via nonzero values = 1\n    - Intensive margin graph denser; higher average degrees; less centralized\n    - Extensive margin represents creation of trade. Less dense than intensive margin = not as much trade is being created as existing trade is being supplemented. More centralized than intensive margin = a small number of countries are creating trade (China, Mexico, Nigeria, Tunisia).\n\n## Connected research\n\n[[International Trade Network.Modeling + Predicting the WTN.World Trade Network.Modeling the ITN - A Gravity Approach]]","n":0.023}}},{"i":5,"$":{"0":{"v":"Weighted HITS","n":0.707},"1":{"v":"### Deguchi et al.\n\nThis paper presents an investigation of economic hubs and authorities of the WTN through the hyperlink-induced topic search (HITS) algorithm.\n\n****\n\n## Weighted HITS algorithm\n\n> <span style=\"background-color: #bc42f5; color: black;\">Method</span>. The **weighted HITS** (and unweighted HITS) algorithm, modeled after Google's PageRank, for assessing **hubs and authorities** in the WTN.\n\n> <span style=\"background-color: #03cafc; color: black;\">Definition</span>. A **hub** conventionally denotes a country which is a center of outgoing trade (lots of exports); an **authority** is a country which is a center of incoming trade (lots of imports).\n\n- Questions:\n    - What to make of the increasing trade between advanced economies (the EU, the US) and emerging economies (China)?\n    - Is the US losing its position as central hub of the WTN to China?\n-  Existing literature:\n    - Serrano and Boguna (Topology of WTN; *see above*) - WTN a complex network\n    - WTN characterized by mostly weak trade links, but a few very strongly interconnected nations\n- The basic idea of weighted HITS:\n    - Originally introduced by Wei and Liu in the WTN\n    - Countries have higher hub scores if they export to countries with high authority scores; countries have higher authority scores if they import from countries with high hub scores - ***note the similarity to economic complexity.***\n    - Wei and Liu conclude that the authority scores of the US are decreasing, and that of China and Japan are increasing up to 2000.\n\n> <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. A country is a strong exporter if it exports to strong importers and vice versa.\n\n\n- The algorithm used is based on Google's PageRank:\n\n> <span style=\"background-color: #12ffd7; color: black;\">Algorithm</span>. **PageRank**.\n\n- Basic assumption: importance of a webpage based on importance of webpages linked to it (similar to eigenvector centrality)\n- The **Random Surfer** model:\n    - Suppose that, in a World Wide Web with an astonishing 4 pages ($A, B, C$ and $D$) page $A$ is linked to two other pages: $B$ and $C$.\n    - If a \"random surfer\" begins on page $A$, they will next visit page $B$ or $C$ with equal probabilities; after arriving on that page, they will visit the pages linked to $B$ or $C$ again at random, with equal probability.\n    - Suppose that this information is modeled with a graph with adjacency matrix $A$, and suppose that the probability of the random surfer being on $A$, $B$, $C$ or $D$ at any time is denoted by a veector $x$.\n    - At any given time-unit, the surfer's next state is given by $x_{new} = Ax_{old}$ (this is a **Markov chain**).\n    - This will eventually converge to\n\n> <span style=\"background-color: #12ffd7; color: black;\">Theorem</span>. **PageRank eigenvector**: the solution to the equation $x = Ax$, i.e. the eigenvector corresponding to the eigenvalue $1$ of $A$, is the steady state of the PageRank vector.\n\nNotice the similarities to eigenvector centrality!\n\nBy the Perron-Frobenius system, this is not guaranteed to converge, so we introduce a **damping factor** $d = 0.85$:\n$$\nA' = dA + (1-d)S\n$$\nwhere $S$ is a matrix made up of entirely $\\frac{1}{n}$s (with $n$ being the total number of webpages).\n\nNow back in the context of the WTN: suppose that $A$ is now the **binary trade matrix** ($a_{ij}=1$ if trade exists between $i$ and $j$, $0$ if not). Then the PageRank algorithm can be simply applied as\n$$\nA'_{ij} = d\\frac{a_{ij}}{\\sum_{j} a_{ij}} + (1-d)S\n$$\nwhere $S$ is as above (matrix of $\\frac{1}{n}$s) and $\\sum_{j} a_{ij}$ is the out-degree of $i$. This naturally converges to the eigenvector of $A'$.\n\n> <span style=\"background-color: #12ffd7; color: black;\">Algorithm</span>. In the context of the WTN, define the **weighted PageRank** as the above PageRank matrix with $a_{ij}$ replaced with the weight $w_{ij}$.\n\nNow we can propose\n\n> <span style=\"background-color: #12ffd7; color: black;\">Algorithm</span>. The **weighted HITS** algorithm: denote the **authority** vector for the $N$ countries in the WTN at as\n$$\nx=[x_1\\ x_2\\ ...\\ x_N]^T\n$$\n> and likewise the **hub** vector as\n$$\ny=[y_1\\ y_2\\ ...\\ y_N]^T\n$$\n\n> Then, by iterating across timesteps, we define $x(t+1)$, the authority vector at the $t+1$th timestep, as\n$$\nx(t+1) = c(t)A^Ty(t)\n$$\n> where $y(t)$ is the hub vector for the $t$th timestep, and $c(t)$ a normalizing constant ensuring that the elements of $x$ sum to one. Analogously, define\n$$\ny(t+1) = d(t)Ax(t)\n$$\n> where $d(t)$ is also a normalizing constant.\n\nWe thus claim that \n\n> <span style=\"background-color: #12ffd7; color: black;\">Theorem</span>. The authority vector $x$ converges to the eigenvector of $A^T A$; the hub vector $y$ converges to the eigenvector of $AA^T$.\n\nReplacing $A$ with $W$ defines the values for the **weighted** HITS algorithm. \n\n## Results\n\n- Weighted HITS is more appropriate than unweighted HITS for the WTN\n    - Korea and US have similar **unweighted** HITS values; however, the magnitude of trade exports for the US is 2.87 times greater than for Korea\n    - Top 20 exporters in the WTN form an almost complete network; as such, not considering weights makes their HITS values nearly the same\n    - Weighted HITS represents the difference between top exporters better\n\n- 1992-2012: center of world trade shifts to Asia, China becomes top global exporter by 2012\n- Hubs and authorities during that period:\n    - China rises as a hub because of its exports to the US, which is the largest weighted HITS authority\n    - Korea rose from 12th to 7th as a hub by strengthening international competitiveness and replacing Japanese exports\n    - Japan's currency appreciated and its exports to authorities in the WTN decreased, becoming lower-ranked as a hub (\"Lost Decade\")\n- Weighted HITS hub value and share of country in world exports not strictly proportional; some countries have larger hub values than their share (e.g. China)\n\n- \"New Economy\" in 1990s led US to become largest authority in WTN, overwhelming dominance by 2001; hegemony weakened since then\n- Weighted HITS authority value also not strictly proportional to import shares\n\n- **Hub-authority correlation** is demonstrated\n    - Important hubs are usually big exporters to important authorities\n    - E.g. Canada, Mexico are large exporters to the US (~80% exports are to the US); HK large exporter to China\n- The rise of China as a global market\n    - China + HK + Macau (Greater China) has similar values with China because internal trade is large","n":0.032}}},{"i":6,"$":{"0":{"v":"Trichotomous Measure of World-System Position in the WTN","n":0.354},"1":{"v":"\n\n### Clark and Beckfield 2009","n":0.447}}},{"i":7,"$":{"0":{"v":"Topology of the World Trade Web","n":0.408},"1":{"v":"### Serrano and Boguna\n\nThe World Trade Network satisfies the properties of a complex network.\n\n****\n\n### Definition of a complex network\n\n> <span style=\"background-color: #03cafc; color: black;\">Definition</span>. A  **complex network** demonstrates the following properties:\n\n- A **scale-free** degree distribution, where the fraction of nodes with degree $k$, $P(k)$, follows an inverse power-law distribution $P(k) \\propto k^{-\\gamma}$, where $2<\\gamma\\leq 3$. \n    - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. This implies that there are far fewer nodes with a higher degree than a lower degree; the network will be centered around a few \"hubs\", i.e. nodes which are much more well-connected than others.\n- The **small-world** property, where the **average path length** between any pair of nodes grows logarithmically with the graph size.\n    - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. The size of the graph could be very large (say 1000 nodes), but any two randomly selected nodes will have a small distance on average (e.g. 3) due to the logarithmic relationship between graph size and distance.\n- A high **clustering coefficient**, defined for a node $i$ to be\n    $$\n    \\frac{2n_i}{k_i(k_i-1)} = \\frac{n_i}{(\\frac{k_i(k_i-1)}{2})} \n    $$\n    where $n_i$ is the number of pairs of nodes connected to $i$ that are themselves connected, and $k_i$ is the degree of $i$, i.e. the number of nodes connected to $i$\n    - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. $(\\frac{k_i(k_i-1)}{2})$ is the total number of possible pairs of nodes connected to $i$ (= $k_i\\choose 2$); thus, the **clustering coefficient** is the ratio between the pairs which are connected to the total number of pairs.\n- Recently, a **degree-degree correlation** has also been added to the list of properties: the network should be either **assortative**, i.e. high-degree vertices are connected to other high-degree vertices, or **disassortiative**, i.e. high-degree vertices are connected to low-degree vertices\n\n### The World Trade Web is a complex network\n\n> <span style=\"background-color: #bc42f5; color: black;\">Method</span>. The adjacency matrix for the World Trade Web in this paper is **unweighted** and is defined for countries $i$, $j$ to be\n\n$$\nA_{ij} = \\frac{1}{1+\\delta_{I_{ij},E_{ij}}}(I_{ij}+E_{ij})\n$$\n\n> where $I_{ij}$ is $1$ if there are **imports** to $i$ from $j$ beyond a certain threshold, and $E_{ij}$ is $1$ if there are **exports** from $i$ to $j$ beyond a certain threshold. $\\delta$ denotes the Kronecker delta function.\n\n> <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. $A_{ij}$ is zero if there are no imports or exports between $i$ and $j$ at all, but one otherwise (given the Kronecker delta). It thus represents whether there are trade relationships between $i$ and $j$.\n\nConsequently, the adjacency matrix addressed in this paper is **symmetrical**. \n\n- There are 179 vertices and 7510 directed links.\n- The average degree is 30.9.\n\n> <span style=\"background-color: #12ffd7; color: black;\">Takeaways</span>.\n\n- **Reciprocity**: the fraction of trade relationships which are reciprocal is 0.61; this is (apparently) enough to think of the global trade network as reciprocal enough to be undirected (?)\n- **In- and out-degree correlation.** If in-degree is defined as importing nations and out-degree is exporting nations, the in-out correlation is 0.91.\n- If the network is symmetrized based on the above definition, the average degree $\\langle k \\rangle$ is 43, which is very high; if the network is instead symmetrized based on bi-directionality, i.e. $A_{ij}=1$ only if both import and export links exist, then $\\langle k \\rangle$ is only 18.\n\n****\n\n- **Degree distribution**. The proportion of the degree $k$ peaks at $k \\approx 20$ and decays according to a power law distribution $P(k) \\propto k^{-2.6}$ after that; the network is thus **scale-free** for $k > 20$, but not below that.\n- Degree is positively correlated with country per capita GDP (0.65 correlation); some countries, like China, Brazil, and Russia, are relatively low in per-capita GDP but high in degree.\n- **Clustering distribution**. The clustering coefficient $c$ is positively correlated with $k$ by $c \\propto k^{-0.7}$. The average clustering coefficient is 0.65, which is 2.7 times greater than the random expectation.\n\n****\n\n- **Degree-degree correlation**. Defined formally as $P(k'|k)$, the probability of the degree of a node being $k'$ conditioned upon the degree of a connected node being $k$. This can be measured by **average nearest neighbor degree** (ANND), the average degree of a node's connected given that it has a certain degree. If there is no degree-degree correlation, then ANND is unaffected by degree; if there is a correlation, then ANND is dependent on degree. A power law decay $ANND \\propto k^{-0.5 \\pm 0.05}$ was found; this indicates **disassortativity** (ANND inversely propotional to degree; high-degree nodes connected to low-degree ones).\n\n****\n\n- **Overall topology**. \n    - Size 179, average degree 43, average path length 1.8.\n    - **Reciprocity**. In-degree and out-degree correlation (unsymmetrized) is 0.91; highly reciprocal.\n    - **Degree distribution**. Peaks at $k=20$; follows scale-free distribution $k^{-\\gamma}$ with $\\gamma = 2.6$ affterwards. A few large hubs with many small countries with little trade.\n    - **Clustering distribution**. $c\\propto k^{-\\omega}$ with $\\omega = 0.7$. 2.7 times as clustered as a random graph (clustering coefficient $0.65$.)\n    - **Average nearest neighbor degree.** Disassortative behavior with $ANND \\propto k^{-v_k}$ and $v_k = 0.5$. Leads to conclusion that the World Trade Network has a few large hubs connected to small countries.\n        - Could be that WTN is split into several clusters, with hub countries connecting these clusters. ","n":0.035}}},{"i":8,"$":{"0":{"v":"Fagiolo et al","n":0.577},"1":{"v":"Article on the topology of the World Trade Web; follow-up to previous paper.\n\n****\n\n### Literature review\n\n- WTN characterized by disassociativity: countries with many trade partners are connected with countries with few partners (negative degree-degree correlation)\n    - i.e. node degree negatively correlated with average nearest neighbor degree (ANND)\n- Well-connected nations are less interconnected than poorer ones\n    - i.e. node degree negatively correlated with clustering coefficient\n- These conclusions are predicated on a simple binary adjacency matrix view of the WTN; a weighted-network analysis may be performed instead\n\n### Methods and Statistics\n\n> <span style=\"background-color: #bc42f5; color: black;\">Methods</span>.\n\n- Node degree (and node strength), denoted ND/NS.\n- Average neighbor node degree.\n- Clustering coefficient\n\n> <span style=\"background-color: #12ffd7; color: black;\">Results</span>.\n\n-  Majority of existing connections are relatively weak. High average ND while low average NS. ND and NS only weakly correlated ($R^2 = 0.5$).\n- ND bimodal, weakly left-skewed; NS strongly left-skewed, many weak relationships coexist with few strong ones\n- ND and ANND display -0.95 correlation (strongly negative); however, NS and ANNS are only weakly negatively correlated (-0.4)\n- Clustering coefficient is actually **positively correlated** with NS; generally weakly clustered, unlike the binary WTN","n":0.074}}},{"i":9,"$":{"0":{"v":"Economic Integration in East Asia and Latin America","n":0.354},"1":{"v":"\n### Reyes et al., 2010","n":0.447}}},{"i":10,"$":{"0":{"v":"Synchronization of the WTN","n":0.5},"1":{"v":"\n\n### Li et al., 2003","n":0.447}}},{"i":11,"$":{"0":{"v":"Spanning Trees of the WTN","n":0.447},"1":{"v":"### Skowron et al., 2018","n":0.447}}},{"i":12,"$":{"0":{"v":"Dominant Flows in the WTN","n":0.447},"1":{"v":"\n### Serrano et al., 2007","n":0.447}}},{"i":13,"$":{"0":{"v":"Multiproduct Trade Networks","n":0.577},"1":{"v":"Papers on modeling the ITN on a product-wise basis.","n":0.333}}},{"i":14,"$":{"0":{"v":"The Product Space Conditions the Development of Nations","n":0.354},"1":{"v":"### Hidalgo et al.\n\nA network of products produced around the world is constructed based on the degree of interrelatedness between these products. The authors find that such a network exhibits a core-periphery structure, and that poor countries have empirical difficulties in moving towards more sophisticated regions of this network.\n\n****\n\n## Literature review\n\n- Does the type of product a country produces matter?\n    - *Industrial products* are suggested to be more economically beneficial than agriculture due to spillover effects (i.e. production of industrial products leads to industrialization, which leads to growth)\n- However, this notion has not been formalized; instead, the **level of development** of a country's specialization in products has been studied through\n    - **Factor proportions**: ratios between a country's capital, labor, land, etc. Poor countries are unskilled-labor and land heavy; rich countries are capital heavy.\n    - **Technological differences**: products are differentiated by the level of technology required to produce them. A country becomes more developed when it moves to a more technologically advanced product.\n- **Traditional growth theory** posits that countries develop by moving to more advanced products, and that such a redeployment of resources (land, labor, capital) is always possible\n    - However, if the **distance** between certain products are too large, then such a redeployment would be very difficult\n    \n## Methods\n\n- **Relatedness of products** can be measured in several ways:\n    - Proportion of land, labor, and capital needed to produce them\n    - Level of technological sophistication\n    - Inputs/outputs involved in the product's value chain\n    - Requisite institutions for producing the product\n- Instead, they can also be measured by looking at how much they are produced together\n    - E.g. countries who produce apples probably produce pears, and it can be concluded that they are similar products\n- Based on this, we have\n\n> <span style=\"background-color: #12ffd7; color: black;\">Model</span>. **Product proximity** between products $i$ and $j$.\n\nFirst define the metric\n\n> <span style=\"background-color: #03cafc; color: black;\">Definition</span> RCA (**revealed comparative advantage**) of a country $c$ in the production of product $i$ is given by \n$$\nRCA_{c,i} = \\frac{\\text{proportion of $i$ in country $c$'s exports}}{\\text{proportion of exports of $i$ in total world exports}}\n$$\n> or, mathematically,\n$$\nRCA_{c,i} = \\frac{(\\frac{x(c,i)}{\\sum_{i}x(c,i)})}{(\\frac{\\sum_{c}x(c_i)}{x_{total}})}\n$$\n\nA country will have an RCA above 1 for product $i$ if it exports more of product $i$ than is expected (i.e. than the world average proportion of exports of $i$ vs. all exports). We expect two products to be **closely related** if they are produced at the same time, or if they are not produced by the same time, in a single country; thus, define product proximity $\\phi_{ij}$ between $i$ and $j$ as either\n$$\nP(RCA_{x,i} \\geq 1 | RCA_{x,j} \\geq 1)\n$$\nor\n$$\nP(RCA_{x,j} \\geq 1 | RCA_{x,i} \\geq 1)\n$$\nwhichever value is smaller, i.e. for all countries, what is the probability that $i$ is a widely produced product given that $j$ is widely produced? \n\n## Results\n\n- The product proximity of 775 product classes were studied and formed into a network, referred to as the **product space**\n- **The product space is clustered**. Hierarchical clustering shows that products form several groups, with products within each group being close in proximity and products beetween groups being far away.\n- **The product space has a core-periphery structure**, with industrial productsa nd chemicals being at the core, agriculture and textiles at the left periphery, and electronics and mining at the right\n- Leamer (1984) performs a similar clustering with relative factor intensities in product production, and obtains similar results\n- **Different continents have different specialization patterns**. For instance, the Americas occupy the core (industrialized products); East Asia occupies the peripheries, e.g. garments and textiles; Africa occupies the far peripheries\n\n### Diffusion of products\n\n- **Countries export new products close in proximity to already-exported products**. Studies of Malaysia and Colombia's product spaces between 1980 and 2000 reveal a **diffusion process** in which the countries tend to produce new products that are closer to existing goods.\n- To test product diffusion, define\n\n> <span style=\"background-color: #12ffd7; color: black;\">Model</span>. **Density model of product diffusion**. Suppose that a country $c$ wants to produce a new potential product $j$ which they are not already producing. Define the **density** of the country's current production structure to $j$ as\n$$\n\\omega^c_j = \\frac{\\sum_{i} x_i\\phi_{ij}}{\\sum_{i} \\phi_{ij}}\n$$\n> where $\\phi_{ij}$ is product proximity between $i$ and $j$, and $x_i$ is 1 if $RCA(c,i) > 1$ and 0 otherwise. Density is thus the number of products that are important to $c$ ($RCA(c,i) > 1$), weighted by their proximity to $j$. High density means that country $c$ has many products which have high proximities to $j$.\n\n- To illustrate that a high proximity makes the production of a new good more likely, consider **transition products** from 1990 to 1995: for a country $c$, if product $i$ was **undeveloped** ($RCA(c,i)<0.5$) in 1990 but **developed** ($RCA(c,i)>1$) in 1995, then it is part of the set of transition products.\n\n- Let $T$ be the set of countries for which a product $i$ was a transition product. Define the **discovery factor** for product $i$\n \n$$\nH_i = \\frac{\\text{average density to $i$ in transition countries}}{\\text{average density to $i$ in non-transition countries}}\n$$\n\nor\n$$\nH_i = \\frac{\\frac{\\sum_{j=1}^T \\omega^j_i}{T}}{\\frac{\\sum_{j=T+1}{N}}{N-T}}\n$$\n\n- This ratio is bigger than 1 for 79% of products, showing that average density influences transitioning.\n\n- Alternatively, upon calculating the probability of transitioning to a new product conditioned upon $\\phi$, the probability is 15% if $\\phi = 0.8$ but nearly zero if $\\phi = 0.1$.\n\n### Connectivity of the product space\n\n- **The product space is sufficiently connected**. Links with proximity $\\phi < 0.3$ fully connect the product space.\n\n- A dynamical model where countries diffuse into products with $\\phi > k$ for $k = 0.65$ or $0.6$ or $0.5$ finds that countries like Korea, which is positioned near the core of the product space (industrial products), diffusion is easy; while for countries like Chile, which are not in the core, diffusion is difficult and slow.\n","n":0.033}}},{"i":15,"$":{"0":{"v":"The Multiproduct Google Matrix of World Trade","n":0.378},"1":{"v":"### Ermann and Shepelyansky\n\nThe authors analyze the *Google matrix* of the WNT, based on the PageRank algorithm, and apply it to measure the influence of different countries in the WTN as well as the sensitivity of the network to price changes.\n\n\n","n":0.156}}},{"i":16,"$":{"0":{"v":"Strategies for Selecting Trading Partners","n":0.447},"1":{"v":"\n\n### Ren et al.","n":0.5}}},{"i":17,"$":{"0":{"v":"Product Diversification","n":0.707},"1":{"v":"\n\n### Desmarchelier et al., 2018\n\nThis paper uses an agent-based decision model to simulate nations' movements through the product space and models China's public policy decisions through it.\n\n\n## Literature review\n- Economic development is not binary; countries grow unequally, with convergence clubs (countries that have similar growth rates; Galor 1996, Phillips and Sul 2009), growth miracles and disasters (Nelson and Pack 1999; Diamond 2011)\n- There are multiple equilibrium states for economic development, suggesting a non-convex macroeconomic production function (Romer 1986)\n- External shocks and internal factor endowments both affect these equilibria (Azariadis and Stachurski 2005)\n- Hidalgo and Hausmann propose the Product Space as an alternative explanation for countries getting stuck in sub-optimal equilibria: their position in the periphery of the Product Space make it difficult to traverse through it\n- This integrates network theory methods into economic growth\n    - [[International Trade Network.Economic Growth.Networks in Growth]] show that proximity of country's export basket to other products + wellc-onnectedness (small-world property) of basket both increase a country's chance of experiencing growth acceleration\n    - Poncet and Waldemar 2013 find that Chinese firms are more productive when well-connected to the productive core\n- As such, growth does not happen at random; it happens as a result of diversification into more advanced products, which can be affected by public policy decisions\n- This paper uses a dataset from East Asia (11 countries, 4716 products, firm-level, 1995 to 2014)\n    - Countries modeled as group of firms making individually optimal decisions\n    - East Asia known for export-led growth, e.g. Nelson and Pack 1995 highlight role of export incentives in success of South Korea and Taiwan\n    - Rodrik 2006 attributes China's growth to its capacity of exporting goods which are more advanced than China's GDP would suggest\n- Model also simulates range of public policies, using China as a case study:\n    - Export subsidies over fixed set of targeted products\n    - Export subsidies over variable set of products\n    - Innovation-enhancing policies\n\n## Methods\n\n### East Asia's product space\n- Endogenous growth theory (Romer 1987): diversity of products -> faster GDP growth because increased specialization leads to positive externalities\n    - Hidalgo et al. 2007 ([[International Trade Network.Multiproduct Trade Networks.The Product Space Conditions the Development of Nations]]) develops the notion of proximity to explain this, $\\phi_{ij}$ (see link)\n\n- Building the Product Space\n    - Visual analysis shows that the Product Space has changed from 1995 to 2014:\n        - Clusters are textiles, manufactured products, chemicals and crude materials\n        - Crude materials are moving into the periphery\n        - Manufactured products form distinct and tight cluster\n    - China exhibits unusual position because it produces both textiles (low complexity) and chemical products (sophisticated)\n    - China occupies 46% of product space in 2014 vs. 33% in 1995\n    - Product connectivity decreasing, statistically significant according to Kolmogorov-Smirnov test; this means that countries are specializing more and more\n    - Difference in number of exported products from 11 East Asian countries: large gap in 1995, reduced over time (e.g. Vietnam catches up quickly) but ranking in 1995 is maintained in 2014\n    - **Path dependency**: taking a different direction in the product space means different rooutes of development\n- Metrics in the product space\n    - **Competition** between two countries is measured by overlap in their export basket; lower in 2014 than in 1995 except for Japan, which increases overlap with all other countries -> competition in East Asia decreases over time\n\n### Model of product diversification\n\n- Holland and Miller (1991): economies are complex adaptive systems - \n    - Network of interacting agents\n    - Dynamic aggregate behaviors that emerge from individual actions\n    - Aggregate behaviors can be described without detail on individual agents\n    - Agents self-optimize their payoff/profit/utility/market share\n- The export landscape\n    - 4716 total products; model runs for 20 timesteps to see the evolution of each product's exports\n    - Exports normalized by\n    $$\n    \\Omega_{i, t} = \\frac{X_{i, t}}{X_{max}} \\times 100\n    $$\n    where $X_{max}$ is the maximum value of exports for any product during the entire timeframe, deflated via US GDP CPI\n    - Descriptive statistics of the export landscape:\n        - Mean value increased 2.64 times from 1995 to 2014 - annual growth of 4.9 percent\n- Local export landscapes\n    - Firms cannot see the entire export landscape, but only the landscape closest to them\n    - E.g. if a firm can only see the 5 closest products to its position, it may reach sub-optimal local positions; this is a \"rugged landscape\" effect\n- Initial conditions\n    - Each country $k$ is initialized with a number of firms $N_{k,i}$ producing product $i$, given by\n    $$\n    N_{k,i} = M_{k,i,1995} \\times 100\n    $$\n    where $M$ is the market share of $k$ in product $i$ in the start year 1995. This is further multiplied by \n    $$\n    \\frac{\\Omega_{i,1995}}{\\bar{\\Omega}_{1995}}\n    $$\n    i.e. how much $i$ is exported compared to the average; this penalizes products which are not exported often and rewards products which are exported often\n- Countries can experience economic growth in two ways:\n    - More firms\n    - Firms producing higher-quality products, moving through the product space\n\n### Firm exploration\n\n- Firms' decisions to move from one product to another are influenced by competitiveness of the market for the new product, the product proximity, and the shape of the export landscape\n- Let:\n    - $j$ be the new product firms move to\n    - $D$ be the maximum walking distance (top number of closest products firms look at), set at random to an integer between 1 and 5\n    - Firms want to maximize their own profits; the desirability of moving to another product $i$ is proportional to its export value $\\Omega_i$ and inversely proportional to the level of competition $N_{i}$ at time $t$.\n    - Thus, a firm decides between\n    $$\n    (\\frac{\\Omega_{i,t}}{N_{i,t-1}})^\\alpha\n    $$\n    where $\\alpha$ is a tunable parameter between 0 and 1 for the current product, and\n    $$\n    (\\frac{\\Omega_{j,t}}{N_{j,t-1}+1})^\\alpha \\phi_{ij}\n    $$\n    for the $D$ closest products to $i$ where the $+1$ originates from there being one more firm after the firm itself joins the market of the new product.\n\n## Results\n\n### Simulation results\n\n- w/ parameter $p$ representing percentage of firms that want to decide based on the above equation, and a value $p = 0.15$ or $p = 0.25$, the model captures the monotonic increase of East Asian export market share from 20% to 34$ from 1995 to 2014\n- Model can predict situations like China's export diversification, Korea's rise, Vietnam's stagnation after 2007\n- The \"quiescence trap\" (Hidalgo and Hausmann) refers to when the distance towards reaching a new product is too high, and firms do not change products at all, remaining at their current position in the product space\n    - Arises for two reasons in this model: scale difference in number of firms across countries, first-mover advantage where first firm to enter a market reaps the rewards and later firms suffer from increased competition\n\n### Public policies\n\n- Subsidies\n    - Fixed subsidies subsidize a list of products in 1999 and remain the same; variable/adaptive subsidies change their list of products every year\n    - Products selected based on two criteria:\n    1. Four-year (1995-1998) average export market share of country (China) in product lower than world average\n    2. Four-year average value/competitiveness ratio ($\\Omega/N$) higher than product average","n":0.029}}},{"i":18,"$":{"0":{"v":"Prediction in Complex Systems","n":0.5},"1":{"v":"\n\n### Vidmer et al., 2015\n\nA diffusion algorithm is used to predict the evolution of the multiproduct WTN, using a new measure of WTN fitness and product similarity.\n\n***\n\n## Literature review\n\n- Complex network properties of the WTN first exhibited in [[International Trade Network.Network Analysis.Topology of the World Trade Web]]\n- Gravity model fitted to WTN in [[International Trade Network.Modeling + Predicting the WTN.Gravity]] and [[International Trade Network.Clustering.Rich-Club Phenomenon]]\n- Product Space in [[International Trade Network.Multiproduct Trade Networks.The Product Space Conditions the Development of Nations]] + Economic Complexity in Hausmann et al. 2006\n- Export predictions done in Hummels and Klenow 2005\n- A **recommender system** can be used to predict future exports and exported products ([[International Trade Network.Multiproduct Trade Networks.The Product Space Conditions the Development of Nations]], Tacchella et al. 2013, \"A new measure for countries' fitness and product complexity\")\n    - Originally used in online systems/social media networks (Lv and Zhou 2011, \"Link prediction in complex networks: a survey\")\n    - Use heat diffusion/mass diffusion model + economic complexity\n\n## Methods\n\n- NBER-UN dataset w/ 65 countries and 770 products\n- Matrix construction: if $RCA > 1$ for country $i$ and product $\\alpha$, link exists\n- $i,j$ denote countries, $\\alpha,\\beta$ products\n- Links added from year $t$ to $t+1$ is $C^t \\backslash C^{t+1}$\n\n### Product space metrics\n\n- **Proximity** between two products $\\phi_{\\alpha\\beta}$ defined as\n$$\n\\min (P(\\alpha \\in C_i | \\beta \\in C_i), P(\\beta \\in C_i | \\alpha \\in C_i))\n$$\n- Proximity of country $i$ to product $\\alpha$ =\n$$\n\\frac{1}{k_i}\\sum_{\\beta \\in C_i}\\phi_{\\beta \\alpha}\n$$\nwhere $k_i$ is out-degree of $i$.\n\n- **Causality** (newly defined) between $\\alpha$ and $\\beta$ defined as\n$$\n\\frac{\\text{number of times $\\alpha$ and $\\beta$ were in the same country's export basket}}{\\text{total number of export baskets}}\n$$\nduring a time period $t$.\n- Fitness and product complexity, defined iteratively.\n\n### Diffusion algorithm\n\n- Let $f$ be the vector containing the RCA information of country $i$ at time $t$: \n$$\nf = \\begin{bmatrix}\na_{i1} \\\\\na_{i2} \\\\\n\\vdots \\\\\na_{iM}\n\\end{bmatrix}\n$$\nwhere there are $M$ products and $a_{i\\alpha}$ is $1$ if $RCA_{i\\alpha} > 1$, $0$ otherwise.\n\n- The diffusion algorithm modifies $f$ based on\n$$\nf_{new} = Wf\n$$\nwhere $W$ is the product-to-product matrix with elements\n$$\nW_{\\alpha \\beta} = \\frac{1}{k_{\\alpha}^\\lambda k_{\\beta}^{1-\\lambda}}\\sum_{j=1}^N \\frac{a_{j \\alpha} a _{j \\beta}}{k_j}\n$$\nwhich can be interpreted as \"all countries who export both $\\alpha$ and $\\beta$ ($a_{j\\alpha} a_{j\\beta}$) give their resources evenly to all other countries\".\n- Further multiply each $f_{i\\alpha}$ by $\\psi_{i\\alpha}$, the causality averaged over the export basket of a country towards $i$.\n\n### Link prediction\n\n- Prediction list built with top 20 products predicted by vector $f$ above to exceed $RCA = 1$\n- Consider: percentage of predictions that are correct (precision), percentage of actual added links correctly predicted (recall), average complexity rank of predicted products over a country, inter-list Hamming metric $1 - \\frac{q_{ij}(L)}{L}$ where $q_{ij}$ is the number of common products in the predicted and actual lists\n\n- Precision $P = 0.3$ for best-performing method (causality + diffusion)\n\n","n":0.047}}},{"i":19,"$":{"0":{"v":"Multinetwork of International Trade","n":0.5},"1":{"v":"\n\n### Barigozzi et al., 2010","n":0.447}}},{"i":20,"$":{"0":{"v":"Country Space","n":0.707},"1":{"v":"### Nomaler and Verspagen 2022\n\nThe authors propose the idea of a Country Space to complement [[International Trade Network.Multiproduct Trade Networks.The Product Space Conditions the Development of Nations]]. \n\n## Literature review\n- Product space introduced by [[International Trade Network.Multiproduct Trade Networks.The Product Space Conditions the Development of Nations]]\n- This paper extends product space in four ways:\n    - The introduction of a \"country space\"\n    - Testing the loss of comparative advantage\n    - New measures of relatedness\n    - Non-parametric test based on bootstrapping\n- Product space relevant because it links development and trade diversification, e.g. Coniglio et al. 2021, Hausmann and Rodrik 2003\n- However, diversification and specialization are different and even contradictory concepts: a country cannot have RCA in all products by definition\n    - If new specializations are added, old ones will vanish\n    - 59 countries have more losses than gains in RCA out of 155 from 2012 to 2018\n    - China gained 367 but loss 224\n- Empirical evidence justifies product space\n    - [[International Trade Network.Multiproduct Trade Networks.The Product Space Conditions the Development of Nations]] introduce the density measure and use a $t$-test to show that new specializations can be indicated by density; also conduct an OLS regress to justify the same point\n    - This is followed by Boschma and Capone (2015, 2016); Bahar et al. (2017); Alsonso and Martin (2019) on Mexico; Guo and He (2015) on industrial employment; and Coniglio et al. 2021 using a non-parametric test showing that some countries fit the Product Space hypothesis while others less so\n\n## Methods\n- Product space measures: \n    - RCA: for country $i$ and product $j$, RCA is defined\n    $$\n    x_{ij} = \\frac{\\text{$i$'s share in exporting of $j$}}{\\text{$j$'s share in world exports}}\n    $$\n    - Matrix $X$ has elements $X_{ij} = x_{ij}$ (RCA of country $i$ in product $j$)\n    - **Product proximity**:\n        - Defined based on conditional probability: the proximity of two products $i$ and $j$ is the probability that a country has RCA in $i$ given that it has RCA in $j$\n        - This can be calculated in matrix form as follows:\n            - $k_{pq}$ is the number of countries with comparative advantage in both $p$ and $q$\n            - $s_p$ is the number of countries with comparative advantage in $p$\n            - Proximity $\\phi_{pq} = \\frac{k_{pq}}{s_{p}}$\n            - Matrix of proximities $\\Phi = S^{-1}XX^T$ where $S$ is the matrix with row sums of $X$ on its diagonal and zeroes everywhere else\n            - $XX^T$ has elements equal to the dot product between the RCAs of $p$ and the RCAs of $q$, i.e. the number of countries that share both RCAs\n    - **Density**: the proximity of a country's current export basket to a product, calculated as \n    $$\n    d_{ij} = \\frac{\\sum_{p\\ \\in \\text{ exports of } i} x_{ip}\\phi_{pj}}{\\sum_{p\\ \\in \\text{ exports of } i}\\phi_{pj}}\n    $$\n    i.e. the average proximity to $j$ of the products that $i$ has proximity in. This can be rewritten in matrix form as \n    $$\n    D = \\frac{\\Phi X}{\\Phi O}\n    $$\n    where $O$ is a matrix of only ones.\n\n- New measures:\n    - Mutually exclusive proximity\n        - Measures which products a country is **not** specialized in\n        - A country loses specializations at the same time it gains specializations\n        - As such, some specializations are mutually exclusive: e.g. manufacturing and agriculture\n        - If two products are mutually exclusive in specialization, then they are **anti-competitive**\n        - Define the mutually exclusive proximity between products $p$ and $q$ as \n        $$\n        b_{pq} = \\frac{z_{pq}}{u_p}\n        $$\n        where $z_{pq}$ is the number of countries which export $q$ but not $p$, and $u_p$ is the number of countries which do not export $p$; this is equivalent to the matrix equation\n        $$\n        B = U^{-1}ZX^T\n        $$\n        i.e. $ZX^T$ is the dot product between a row of $Z$ (which is $O - X$, whose elements are $1$ if a country **does not** have RCA in a product and $0$ otherwise), and a column of $X^T$, which is the RCA matrix, and $U^{-1}$ is as above.\n    \n    - Combining the mutually exclusive proximity and the regular proximity gives the new RCA indicator $e_{ij}$, between country $i$ and product $j$\n        $$\n        e_{ij} = \\frac{1}{m}(\\sum_{p\\ \\in\\ \\text{exports of } i} \\phi_{jp} + \\sum_{q\\ \\in \\text{ non-exports of }i} b_{jq})\n        $$\n        where $m$ is the total number of products. This essentially says \"average of product $j$'s proximity with exports of $i$, and product $j$'s anti-proximity with non-exports of $i$\".\n        - This can naturally be rewritten in matrix form as \n        $$\n        E = \\frac{1}{m}(\\Phi^T X + B^T Z)\n        $$\n        - The columns of $E$ sum to the original product ubiquity.\n    - Define $K = \\Phi - B$ as the **marginal** proximities: the proximity between two products minus their antiproximities.\n    - Thus we can also rewrite\n    $$\n    E = \\frac{1}{m}(B^T O + K^T X)\n    $$\n    i.e. the antiproximities of all products plus the marginal proximities to the exported products. The second term reflects the country's own specialization profile, while the first reflects an **autonomous** proximity true for all countries.\n- **Country space**\n    - Products move through the \"country space\" simultaneously as countries move through the product space\n    - Country space indicators can be obtained by transposing the ubiquity matrix $S$ (ie. creating the diversity matrix)\n    - A **combined space** can be produced and normalized by\n    $$\n    E^{Tot} =\\frac{1}{r(m+n)}(B^T O + K^T X +OB^* + XK^*)\n    $$\n    where $B^*$ and $K^*$ are the corresponding country space indicators for $B$ and $K$, $m+n$ is the number of products plus the number of countries, and $r$ is the sum of the elements of $X$.\n\n### Non-parametric testing\n\n- Applied to data from 2012-2018, COMTRADE, 155 countries (> 1 million inhabitants)\n- 5197 product categories\n- For an indicator (proximity, antiproximity, $E$, country space, etc.) the *bootstrap test* is as follows:\n    - Null hypothesis: the indicator being tested, on average, is the same for products that experienced a change in its RCA for countries from 2012 to 2018.\n    1. Consider the matrix $X - X_0$, where $X$ is the RCA matrix in 2018 and $X_0$ the matrix in 2012. An entry in this matrix is 1 if the corresponding product gained RCA bby a country.\n    2. Call the set of all products in $X_0$, the original RCA, the \"potential gainers\" - a total of $N$ products. Divide into two parts: the products which actually gained RCA, and the products which didn't. Let the number of potential gainers which actually gained RCA be $N_1$, and thus the non-gainers be $N - N_1$.\n    - Split the set of potential gainers into a set of size $N_1$ and a set of size $N - N_1$ 5000 times. Each time, find the average of the indicator for the set of size $N_1$ and compare it to the average of the indicator of the actual gainers set. \n    - Define \n    $$\n    p = \\frac{\\text{no. of times actual average $\\geq$ random average}}{\\text{5000}}\n    $$\n    as the observed confidence value.\n    - This can be run for both observed gains and losses in RCA, and for a specific product, a specific country, or all products and countries. \n    - Big RCA changes are weighted the same as small RCA changes because small RCA changes are infrequent.\n\n\n## Results\n\n- Indicators have $p$-value $< 0.0001$ tested on all countries and products. \n- Indicators are far less effective on products (60% achieve $p \\leq 0.1$)\n- Loss of RCA harder to predict than gain.\n","n":0.029}}},{"i":21,"$":{"0":{"v":"Generative Models and Evolution","n":0.5},"1":{"v":"Papers on modeling the evolution of the WTN based on empirical models such as the Gravity Model.","n":0.243}}},{"i":22,"$":{"0":{"v":"Rise or Fall","n":0.577},"1":{"v":"### Alamsyah et al., 2023","n":0.447}}},{"i":23,"$":{"0":{"v":"Null Models of the WTN","n":0.447},"1":{"v":"### Fagiolo et al.\n\nThe authors investigate **null models** of the WTN: randomly generated graphs that preserve some features of the WTN, like node degree or strength, to be compared against by the actual WTN to determine whether or not its properties are significant. \n\n***\n\n## Literature review\n\n### Introduction to null models\n\n- The properties of the WTN are well-studied, but the mechanisms that produce its properties aren't\n- In order to determine whether these properties (clustering, centrality, degree etc.) are genuinely caused by economic effects or just statistically random, we compare against **null models**: randomly generated models that preserve some property of the original WTN (e.g. node strength) but are otherwise completely randomized\n- Such null models are either generated **computationally** (through an iterative algorithm; demands high computation time) or **analytically** (through direct formulas)\n- One problem with null models in the WTN is that they will always generate nonzero links, which does not match the reality of the WTN; this makes the WTN an impossible outcome of the null model\n- Squartini et al. (2011) states that the binary WTN properties & architecture are reproducible by null models, but not the weighted WTN (specifically, network disassortiativity and clustering are not reproducible)\n- In essence, the **number** of trading partners of a country in the WTN sufficiently explains the position of the country in the network; but its **total imports and exports** do not explain its position in the weighted WTN.\n\n### Properties of the WTN\n\n- Most surveys conducted via binary models:\n    - Serrano and Boguna (2003) - disassortative pattern, hierarchical arrangements\n    - Garlaschelli and Loffredo (2005) - these patterns are stable over time; node-degree distributions skewed\n- Some papers survey the WTN using weighted approaches:\n    - Fagiolo et al. (2008) show that the properties of the weighted WTN differ from its unweighted counterpart; node-strength distribution left-skewed\n    - Fagiolo et al. (2009) show that the WTN architecture has been stable from 1981-2000; node degree correlates with country GDP; well-connected countries trade intensely with other well-connected countries; form few but intensive trade clusters\n- WTN properties are useful in explaining economic phenomena:\n    - Kali and Reyes (2010) show that trade structure properties like node degree and concentration are good predictors for GDP growth\n- However, no models have been introduced that explain why the WTN exhibits those properties\n- This paper tests the **null hypothesis** that the properties of the WTN arise from random generation rather than actual economic causes, focusing on node in/out degree and strength constraints\n    - If yes, then the properties of the WTN cannot be described by **first-order** properties like node strength alone; second-order properties like clustering have to be studied\n\n## Methods\n\n- Computational methods for generating null models have the downside of being time-intensive, e.g. the rewiring algorithm, which is performed in $O(N^2)$ for a graph of $N$ nodes\n    - This is worsened by the need to take an average value between the randomly generated graphs to obtain what the \"expected\" null model would look like\n\n- As such, an analytical **maximum-entropy random graph** mmodel is used:\n\n> <span style=\"background-color: #12ffd7; color: black;\">Model</span>. **Maximum-entropy random graph generation model**.\n\nFor an original real-world graph with $N$ nodes, the ultimate goal of the model is to generate a **probability distribution** over all possible $N$-node graphs $G$, $P(G)$. In particular, we want:\n- The actual real-world graph to be the most probable outcome of this random model, such that the model recaptures the real-world graph.\n- Some constraint to be specified, e.g. the node degree of any graph $G$ corresponds with that of the actual real-world graph.\n\nTo generate such a probability distribution, we refer to the notion of **entropy**:\n\n$$\nS = -\\sum_{G} P(G)\\ln P(G)\n$$\n\nand more specifically, the **maximum-entropy principle**, which states that as higher-entropy systems contain less information, we want to maximize the entropy of the random graphs so that they contain as little information (i.e. order) as possible:\n$$\nP(G) \\text{ maximizes $S$}.\n$$\nThe solution to this is analytically given by\n$$\nP(G) = \\frac{e^{-H(G)}}{\\sum_{G} e^{-H(G)}}\n$$\nwhere the denominator is a normalization term to ensure that the probabilities sum to 1, and $H(G)$ is the *energy term*\n$$\nH(G) = \\sum_{a} \\theta_a C_a(G)\n$$\nwith $C_a$ being the constrained network measures, e.g. degrees of nodes of $G$, and $\\theta_a$ being parameters to be determined. In particular, $\\theta_a$ are determined by \n$$\n\\max_{\\theta} P(G^*)\n$$\nwhere $G^*$ is the real-world graph (the WTN in this case), i.e. the set of parameters $\\theta$ is the set that maximizes the probability of the real-world graph being the outcome of the model. \n\n> Garlaschelli and Loffredo 2008 show that this is mathematically equivalent to ensuring that the constrained measures (e.g. node degree) are equivalent to the real graph.\n\nFinally, the averaged properties over the generated $G$ (e.g. node centrality, clustering, etc., etc.) can be simply found by\n$$\n\\langle X \\rangle = \\sum_{G}P(G)X(G)\n$$\ndenoted the **randomized value** of property $X$.\n\nThis is an analytical model, and is thus much faster than computational graph-generation models.\n\n## Results\n\n- Take Kristian Gleditsch (2002) database on international trade flows from 1950 to 2000\n    - The size of the WTN changes over time due to geopolitical changes\n    - Directed network, but relatively reciprocal\n- Focus on following topological properties:\n    - Total NS and ND\n    - ANND and ANNS\n    - Clustering coefficients\n- Calculate correlations between properties; normalize properties via normalizing trade flows by yearly total trade\n- Fit maximum-entropy random graph model for:\n    - In-degree and out-degree constraints (binary WTN)\n    - In-strength and out-strength constraints (weighted WTN)\n- Standard deviations for each measure is calculated, allowing for 95% confidence interval calculations via $t$- and $\\chi^2$-tests with $N-1$ d.f. \n- If the correlation between two measures $X$ and $Y$ is reproduced on the random graph, then $X$ \"explains\" $Y$\n    - Interested in following correlations:\n        - ANND and ND\n        - CC and ND\n\n### Binary WTN\n- ANND patterns replicated; node-by-node ANNDs between null and actual model correlated\n- Disassortativity replicated by null model, suggesting it is economically insignificant\n- Null model matches negative CC-ND correlation and also predicts average CC\n\n### Weighted WTN\n\n- Weighted WTN differs in many properties with binary WTN: only weakly disassortative, positive CC-ND instead of negative CC-ND correlation\n- Null model predicts decreasing trend of ANNS but fails to predict its average value\n    - Correlation between predicted and expected ANNS fluctuates between 0 and 0.5; bad predictions\n    - Disassortativity can also not be predicted well\n- Null model cannot replicate clustering trends\n    - WCC-NS correlation not observed\n\n### conclusions\n- Binary WTN: degree of each node is already maximally informative (can be used to accurately predict ANND and CC)\n- Weighted WTN: need higher-order measures like CC and ANND","n":0.031}}},{"i":24,"$":{"0":{"v":"Measuring Globalization","n":0.707},"1":{"v":"### Arribas et al., 2009","n":0.447}}},{"i":25,"$":{"0":{"v":"Gravity","n":1}}},{"i":26,"$":{"0":{"v":"Topological Analysis of Trade Distance","n":0.447},"1":{"v":"\n### Wu et al., 2020\n\nA model that seeks to quantify some \"distance of trade\", indicating the resistance between countries in trade, is proposed based on the WTN; it improves upon the gravity model by considering multilateral resistance and other trade barriers.\n\n***\n\n## Literature review\n\n- Trade is strongly correlated with economic growth; economic complexity as proposed by Hausmann leads to the implication that future growth of a country is constrained by past imports and exports\n- Gravity model now controversial; distance cannot fully capture resistance effects in trade ([[International Trade Network.Crisis Propagation.Bootstrap Percolation and Attack]])\n    - This is known as \"the missing globalization puzzle\"; distance no longer matters as much as before\n    - Authors like Lin and Sim 2012, Yotov 2012, Carrere et al. 2013 and Larch et al. 2016 use more factors in the gravity equation, which leads to bloated formulas\n    - Variables are intercorrelated and lead to multicolinearity problems\n- New measure of trade distance w/ multilateral and network effects are needed:\n    - Maciejewski 2019 demonstrates that common humanistic factors (religion, border, language) determine trade in the EU\n    - Intermediate merchandise trade (e.g. trade of technology) leads to improvement in technology\n- Effect of distance may vary as GDP of trading nation varies\n    - The ITN can quantify the hidden factors in the gravity equation because the ITN is inherently formed from politics, language, religion, etc., etc.\n    - Distance can be defined based on network effects (e.g. shortest path), but does not consider trade flows (i.e. value chains)\n        - E.g. a network distance of 1 node away does not have anything to do with the geographical distance between the countries\n\n## Methods\n\n- CEPII database gives geographical distance\n- GDP data from World Bank\n- Trade data from UN Comtrade\n- Define an \"International Trade Flow Network\" (ITFN):\n    - Regular network + two nodes, one labeled \"source\" (label 0), one labeled \"sink\" (label $N+1$)\n    - Source -> all countries = domestic output of that country\n    - All countries -> sink = domestic consumption\n    - Source - sink = imported - exported; Source + exported = imported + sink, or\n    $$\n    \\sum_{j=0}^N f_{ij} = \\sum_{j=1}^N f_{ji}\n    $$\n\n\n### Flow distance\n\n- Flow distance $l_{ij}$ measures relative trade flows between $i$ and $j$\n- Expected value of distance between $i$ and $j$ is \n$$\nt_{ij}=\\sum_{k=1}^\\infty kp_{ij}(k)\n$$\nwhere $p_{ij}(k)$ is the probability that a path from $i$ to $j$ is length $k$\n- Let $M$ be the *Markov matrix* where each element $M_{ij}$ is the probability of $i$ moving to $j$ at the time-step: $M_{ij} = \\frac{f_{ij}}{\\sum_{j=1}^N f_{ij}}$\n- Then the probability that at time-step $k$, $i$ moves to $j$ is $M^k_{ij}$\n- Thus the amount that flows to $j$ at time step $k$ from $i$ is $\\phi_{0i} M^k_{ij}$, where $\\phi_{0k}$ is initial flow from source to $i$\n\n- This leads to \n$$\np_{ij}(k) = \\frac{\\phi_{0i} M^k_{ij}}{\\phi_{0i} (I + M + M^2 + ...)_{ij}}\n$$\nwhere the denominator is total flow over infinite timesteps. Denote the infinite sum $I + M + M^2 ... = U$.\n- Thus\n$$\nt_{ij} = \\sum_{i=1}^\\infty \\frac{kM_{ij}^k}{U_{ij}} = \\frac{(MU^2)_{ij}}{U_{ij}}\n$$\nby algebraic expansion. Finally, we symmetrize flow distance via $c_{ij} = t_{ij} - t_{ji}$ and flow distance\n$$\nl_{ij} = \\frac{2}{\\frac{1}{c_{ij}} + \\frac{1}{c_{ji}}}\n$$\n\n- Flow distance leads to better performance in the gravity model than geographical distance\n- Source-to-country and country-to-sink flow distance can be used to cluster countries into suppliers of the product and demanders of the product\n\n![alt text](image-3.png)","n":0.043}}},{"i":27,"$":{"0":{"v":"Modeling the ITN - A Gravity Approach","n":0.378},"1":{"v":"### Duenas and Fagolio\n\nUsing the gravity model of trade fitted on bilateral trade flows, this paper **predicts** links and weights in the WTN and analyzes the properties of the resulting network.\n\n****\n\n## Literature review\n\n- The topology of the WTN is an important topic for several reasons:\n    - Trade is an important channel of interaction between countries\n    - Trade links are good models for international phenomena such as economic crises\n    - Reyes et al. (2010) suggests that country centrality in the ITN is a better measure of economic liberalization than other traditional metrics\n- Properties of WTN have been well-studied\n    - Complex network -> disassortativity, partners of well-connected countries less interconnected than partners of poorly-connected countries (hierarchical nature)\n    - Garlaschelli and Loffredo (2005): these properties are stable over time; casts doubts on globalization in last 30 years\n    - Node-degree skewed; countries not evenly participating in trade\n- Weighted WTN has also been studied due to some authors believing that a binary approach does not ocmpensate for strength of trade links\n    - Fagolio et al. (2008) finds that weighted WTN exhibits different properties than binary\n        - Right-skewed strength distribution (a few intense trade connetions; a majority are low-intensity)\n    - Size of group controlling half of all world trade has decreased in last 30 years (Bhattacharya et al. 2007)\n    - Fagolio et al. (2009) finds that these properties have been stable and highlight interesting regularities:\n        - Richest countries are most globally central in WTN; they trade with many partners but only form a few intense connections; these intensely connected countries are also very intensely interconnected (**rich club effect; triangular trade**)\n\n## Methods\n\n- Why is the WTN shaped the way it is?\n    - Canonical trade model - gravity model of trade; may be used to predict trade links in the WTN\n    - Can be augmented with country-specific variables (population, landlocking, area) and bilateral variables (language barrier, religion, trade agreements)\n    - Can be fitted to data using least-squares or two-stage Poisson\n    - Achieves high level of success in terms of $R^2$ coefficients\n- Paper uses gravity model to predict weighted representation of WTN and compare to observed one, with **static** and **dynamic** approaches\n    - **Static approach**: do **not** refit gravity model parameters to data for different years. Fit GM (gravity model) once, then use it to predict all subsequent years.\n    - **Dynamic approach**: use time as a variable in GM.\n    - Both approaches obtain weighted link predictions for every given year in the WTN\n- Findings: GM can predict weights well if told whether a trade link exists; GM does not predict both binary architecture (whether trade exists between two countries) and trade volume well\n\n***\n\n## Methods\n\n- **Dataset**: IMF bilateral trade data. Uses years 1970, 1975, ..., 2000. $w_{ij}(t)$ represents exports from $i$ to $j$ at year $t$ and $N(t)$ represents the number of countries reporting positive trade flow in year $t$.\n- Descriptive statistics for dataset:\n    - Rising density\n    - New trade links increase at a greater than quadratic rate\n    - Number of countries controlling half of trade flows remains stable\n    - Number of countries controlling 90% of trade has substantially decreased -> concentration\n- Definition for associated graphs:\n\n> <span style=\"background-color: #03cafc; color: black;\">Definition</span>. **Observed weighted WTN**: graph with adjacency matrix $W = \\{w_{ij}(t)\\}$.\n\n> <span style=\"background-color: #03cafc; color: black;\">Definition</span>. **Observed binary WTN**: graph with $A = \\{a_{ij}(t)\\}$, which is $0$ if trade does not exist between $i$ and $j$ and $1$ otherwise.\n\nStudied in [[International Trade Network.Network Analysis.World Trade Network]].\n\n- Gravity model specifications:\n    - Trade flows between two countries proportional to product of GDPs of two countries and inversely proportional to distance between them\n    - Consistent with product-by-product trade models like Hecksher-Ohlin ([[International Trade Network.Network Analysis.World Trade Network]])\n    - Modern empircal usage includes more variables (see above)\n- This paper employs the model\n\n> <span style=\"background-color: #12ffd7; color: black;\">Model</span> (General gravity model).\n$$\nw_{ij}(t) = \\alpha_0 Y_i(t)^{\\alpha_1} Y_j(t)^{\\alpha_2}d_{ij}^{\\alpha_3} X_{ij}(t) D_{ij}(t)Z_{ij}(t)\\eta_{ij}(t)\n$$\nThis is a model in several parts. $\\alpha_0 Y_i(t)^{\\alpha_1} Y_j(t)^{\\alpha_2}d_{ij}^{\\alpha_3}$ is the standard gravity model, except that the parameters $\\alpha_0, \\alpha_1, \\alpha_2, \\alpha_3$ are to be fitted. $X_{ij}(t)$ are $K$ country size variables $X_{i1}, X_{i2},  ..., X_{iK}$:\n$$\nX_{ij}(t) = \\prod_{k=1}^K X_{ik}(t)^{\\beta_{1k}} X_{jk}(t)^{\\beta_{2k}} \n$$\ni.e. the product of all $K$ country size variables for both countries, with parameters $\\beta$ to be fitted. Typically we use $K=2$ (two size variables, area and population). \n\n$D_{ij}(t)$ are $H$ bilateral relationship variables $D_{ij1}, D_{ij2}, ..., D_{ijh}$ with parameter to be fitted $\\theta_{1}, \\theta_{2}, ..., \\theta_h$ (common language, religion, colonial ties etc.):\n\n$$\nD_{ij}(t) = e^{\\sum_{h=1}^H\\theta_h D_{ijh}(t)}\n$$\n\n$Z_{ij}(t)$ are $L$ country-specific variables $Z_{i1}, Z_{i2}, ..., Z_{il}$ with parameter to be fitted $\\delta$ (landlocking, continents etc.):\n\n$$\nZ_{ij}(t) = e^{\\sum_{l=1}^L(\\delta_{1l} Z_{il}(t) + \\delta_{2l}Z_{jl}(t))}\n$$\n\nAnd finally, $\\eta$ is an error variable.\n\n> <span style=\"background-color: #ffb812; color: black;\">Remarks</span>. \n1. The above formula does not permit for zero trade flows, which in reality are quite frequent. This makes the GM unsuited for estimating whether a trade relationship exists.\n\n### Estimating gravity model\n\n- Straightforward approach: log-linearizing equation and use least-squares to estimate parameters\n    - Problematic due to **bias in zero-valued flows** (relevant to paper)\n    - Log-linearizing implies nonzero flows as log does not take $0$ as a value\n    - Need to tell model the binary structure $A(t)$\n- Can use two-stage Poisson pseudo-maximum likelihood models\n    - Stage one: is the trade flow between two countries zero? -> Use logistic regression\n    - Stage two: if nonzero, predict trade flow volume\n- Approach used: tell model binary structure -> OLS; PPML -> Poisson\n\n## Results\n\n### The predicted WTN\n\n- Statistics studied:\n    - Basic weighted statistics (total node strength, ANNS, clustering)\n    - Directed weighted statistics (in-degree/strength, out strength)\n    - Binary WTN\n\n- Basic weighted statistics:\n    - GM near-perfectly matches node strength, but less successful (yet still effective) for ANNS and clustering; 95% precision\n    - OLS is more successful for ANNS\n        - This is because OLS preserves the existing binary structure, while Poisson predictions don't\n        - GM always has a positive value so Poisson predictions assign a full binary network (density = 1), which overestimates the numberr of nodes connected to any given node\n        - As such, average nearest neighbor node strength is vastly underestimated because the number of neighbors is overestimated\n        - Kolmogorov-Smirnov tests confirm that OLS predictions and original WTN come from the same distribution, but Poisson predictions do not\n        - As a result, OLS correctly predicts disassortativity (negative correlation between degree and ANNS) but Poisson does not\n        - Both predictions can get in- and out-strength distributions correct\n- Binary network statistics:\n    - Logistic/softmax model used; outputs $P(\\text{trade relationship exists}) \\in (0,1)$\n    - **Density-induced** prediction: if $P > \\gamma =$ density of WTN, then trade relationship exists\n    - Bernoulli predictions also used\n\n","n":0.031}}},{"i":28,"$":{"0":{"v":"Fitness","n":1}}},{"i":29,"$":{"0":{"v":"Microscopic Study of Node Fitness","n":0.447},"1":{"v":"### Hoppe and Rodgers, 2015\n\nThis paper investigates the fitness model of the WTN and offers a new definition of node fitness.\n\n***\n\n## Literature review\n- Generally agreed that fitness model best fits WTN: Caldarelli et al. 2002 (scale-free networks), Servedio et al. 2004, [[International Trade Network.Modeling + Predicting the WTN.Fitness]] and [[International Trade Network.Modeling + Predicting the WTN.Fitness.Fitness-Dependent Topological Properties]]\n- Dynamic models via fitness have been investigated in Besedes and Prusa 2011 (extensive and intensive margins) and [[International Trade Network.Modeling + Predicting the WTN.ERGM.Stochastic Trade Networks]]\n- Gravity models fail because trade is shown to be less and less correlated with distance as time goes on (Picciolo et al. 2012, Chiarucci et al. 2014, Lawless 2010)\n- Network effects are worth investigating because they show how trade can affect economic welfare:\n    - Kali and Reyes, \"The architecture of globalization: a network approach to international economic integration\", 1% increase in centrality increases nation GDP by 0.27%\n    - [[International Trade Network.Crisis Propagation.Financial Contagion in the WTN]] and Garas et al., \"Worldwide spreading of economic crisis\", suggest that the WTN can help identify crisis vulnerabilities\n\n## Methods\n\n### Static fitness model\n\n- Fitness model endows every node in the network of $N$ nodes and $M$ edges with a fitness $x$\n- The probability that a link exists between two nodes $x$ and $y$ is $f(x,y)$\n- This may be understood as a static process; if a new node is created, then the probability that it is between $i$ and $j$ is $\\frac{f(i,j)}{\\sum f(k,l)}$ where the denominator is the total probability across all nodes\n    - This leads to repeated links and edges, but not an issue in sparse networks\n- Call the matrix containing the probabilities $C(i,j)$ the *microscopic structure* of the network\n- Fitness can be defined in multiple ways: \n    - $x_i = \\theta(w_i) = \\frac{1}{N}\\sum_{i=1}^N H(w_i - w_j)$ where $H$ is the Heaviside step function, i.e. the number of countries whose GDP is lower than $i$'s normalized by $N$\n        - Empirically, there is a near-exponential relationship between fitness using this definition and node degree\n    - Alternatively, in [[International Trade Network.Modeling + Predicting the WTN.Fitness.Fitness-Dependent Topological Properties]] we have $x_i = \\frac{w_i}{\\sum_{i=1}^N w_i}$ or $x_i = \\frac{w_i}{N\\ \\sum_{i=1}^N w_i}$.\n\n### Role of fitness in creation of edges\n\n- *Activity* is defined, for a country $i$ during some time period $t$, as \n$$\n\\frac{\\text{number of edges gained during $t$}}{\\text{total number of edges gained by all countries}}\n$$\n- However, there is no clear relationship between fitness and activity\n    - Instead of appearing between high fitness, 1990-2000 shows that links form between high-fitness and low-fitness countries\n    - This implies some additive component to the attachment function $f(x,y)$\n    - Probability of node formation is nonzero at the edges (when the fitness of one country is zero)","n":0.047}}},{"i":30,"$":{"0":{"v":"Fitness-Dependent Topological Properties","n":0.577},"1":{"v":"\n### Garlaschelli and Loffredo, 2004\n\n*Also see: **Interplay between topology and dynamics in the World Trade Web**, Garlaschelli et al. 2007; **Structure and evolution of the world\ntrade network**, Garlaschelli and Loffredo 2005*\n\n\nThis paper (alongside the two papers mentioned above) describes the fitness model and uses it to predict the topological properties of the WTN.\n\n****\n\n## Literature review\n\n- How does the WTN evolve?\n    - \"Rich get richer\"/preferential attachment mechanism: well-connected nodes get further connected\n    - \"Good get richer\" hypothesis: some hidden variable intrinsic to each node, named **fitness**, determines the rate at which nodes form connections\n\n## Methods and results\n\n- GDP per capita and total GDP of a nation is a good candidate for fitness:\n$$\nx_i = \\frac{w_i}{\\bar{w}}\n$$\nwhere $\\bar{w}$ is average world GDP, $x_i$ is fitness of country $i$ and $w_i$ is its total GDP.\n\n- Fitness distributed with inverse power law distribution (probability density $\\propto x^{-2}$.)\n\n- Expected topological properties of the WTN can be predicted based on the probability distribution of fitness:\n$$\nf(x_i, x_j) = \\frac{\\delta x_i x_j}{1 + \\delta x_i x_j}\n$$\nwhere $\\delta$ is a free parameter, and $f(x_i,x_j)$ denotes the probability that $i$ and $j$ are connected.\n- If fitness hypothesis is true, WTN formation depends only on degree (and all the higher-order properties are based off of degree).\n\n- Expected properties are:\n    - Number of links, which has expected value $L = \\frac{1}{2}\\sum_{i,j}^N f(x_i, x_j)$ using fitness\n    - Mean degree, which via number of links equals $\\bar{k} = \\frac{2L}{N}$ -> when the free parameter $\\delta = 80N^2$, the mean degree corresponds to the actual mean degree in the WTN\n    - Expected degree of each vertex, $\\sum_{j\\neq i}f(x_i, x_j)$\n    - Average nearest neighbor degree, $K_i = \\frac{\\sum_{j\\neq i}\\sum_{k \\neq j}f(x_i, x_j)f(x_j, x_k)}{N}$\n    - Clustering coefficient\n\n### Interplay between GDP and WTN\n- A more generalized fitness equation is given by\n$$\nf(x_i,x_j) = \\frac{\\alpha x_i x_j}{1 + \\beta x_i x_j}\n$$\nwhere $\\alpha$ and $\\beta$ are free parameters fixed via the expected number of links. As there are now two free parameters, we also expect\n$$\nL_{r} = \\sum_{i, j}f(x_i, x_j)f(x_j, x_i) \n$$\ni.e. the number of reciprocated links, to match the actual network statistics.\n\n- This yields a good agreement between fitness and WTN, which is surprising as fitness is derived from GDP only and WTN from trade statistics only.\n\n- The effects of the WTN on GDP are derived from the equation\n$$\nGDP = I + F\n$$\nwhere $F$ is some measure of *flow* of trade towards a country $i$; in other words, the GDP of a country $i$ depends on an endogenous factor $I$ and an exogenous (world trade) factor $F$.\n- This can be observed via the WTN as a weighted network, which represents trade flows:\n    - Binary WTN decides which entries of the weighted WTN is nonzero\n    - Nonzero weights of weighted WTN determine GDP\n    - GDP determines binary WTN\n- An agent evolution model of trade flows:\n    - Wealth $w_i$ of the $i$th agent changes dynamically from time $t$ to $t+1$ via\n    $$\n    w_i(t+1) = w_i(t) + \\xi_i(t) + \\eta_i(t)w_i(t) + \\sum_{j}(J_{ji}(t)w_j(t) - J_{ij}(t)w_i(t))\n    $$\n    where $\\xi$ is an additive noise term, $\\eta$ is a multiplicative noise term (both are free parameters), and $J_{ji}$ is the fraction of the wealth of agent $j$ being transferred to $i$, making the sum the net transfer of wealth from other agents to $i$.\n    - $\\xi$ and $\\eta$ are usually taken to be Gaussian variables; commonly $\\xi = 0$ and $\\eta$ is Gaussian; $J_{ij}(t)$ is taken to be some variable\n    $$\n    \\begin{cases}\n    q_{ij}(t)\\text{ if link between $i$ and $j$} \\\\\n    0\\text{ otherwise}\n    \\end{cases}\n    $$\n","n":0.042}}},{"i":31,"$":{"0":{"v":"ERGM + Stochastic","n":0.577}}},{"i":32,"$":{"0":{"v":"Stochastic Trade Networks","n":0.577},"1":{"v":"### Riccaboni and Schiavo, 2013","n":0.447}}},{"i":33,"$":{"0":{"v":"Stochastic Generative Model","n":0.577},"1":{"v":"\n\n### Garcia-Algarra et al., 2019","n":0.447}}},{"i":34,"$":{"0":{"v":"Humanistic Factors Along the BRI","n":0.447},"1":{"v":"### Xu et al., 2021","n":0.447}}},{"i":35,"$":{"0":{"v":"ERGM Analysis of the WTN","n":0.447},"1":{"v":"\n\n### Setayesh et al., 2022","n":0.447}}},{"i":36,"$":{"0":{"v":"Analytic Process Framework","n":0.577},"1":{"v":"\n\n### Zhao and Dzever, 2018","n":0.447}}},{"i":37,"$":{"0":{"v":"Miscellaneous + Case Studies","n":0.5},"1":{"v":"Miscellaneous notes on general topics within the WTN.","n":0.354}}},{"i":38,"$":{"0":{"v":"Triadic Analysis of Agricultural Trade Networks","n":0.408},"1":{"v":"### Shutters and Muneepeerakul, 2012","n":0.447}}},{"i":39,"$":{"0":{"v":"Trade and Australia","n":0.577},"1":{"v":"### Kastelle and Liesch, 2013","n":0.447}}},{"i":40,"$":{"0":{"v":"Stability of Oil Network","n":0.5},"1":{"v":"### Sun et al., 2017","n":0.447}}},{"i":41,"$":{"0":{"v":"Spatio-Temporal Analysis of the WTN","n":0.447},"1":{"v":"### Liu et al.\n \nThe authors summarize every study conducted on the WTN from 2003 to 2023 and offer their thoughts on future areas to explore.\n\n***\n\n## Introductory literature review\n\n- Globalization has led to a complex system of trade where bilateral trade relations are affected by the entire network\n- The WTN has consequential effects on other spatiotemporal networks, like geopolitical relations (Mansfield and Pevehouse 2000), transportation (Hummels 2007), and population movements ([[International Trade Network.Misc.Human Migration and Trade]])\n- WTN analysis offers superior insights to bilaterial trade analysis:\n    - Illustrates higher-level dependencies\n    - Variance and evolution across time and space\n    - Allows countries to make trade decisions with fewer risks\n- History of network analysis of world trade:\n    - Hilgerdt 1943: impact of trade on monetary equilibrium\n    - Snyder and Kick 1979: hierarchical structure of world trade\n    - Serrano and Boguna 2003: complex-network structure of world trade\n    - An\n- WTN analysis mainly includes case studies (Reyes et al. 2010; Benedictis 2012, [[International Trade Network.Network Analysis.World Trade Network]])\n- Paper studies 325 different papers studying the WTN from 2003 to 2023\n\n## Research framework\n### Model summaries\n- **Structure prediction**\n    - Spatial econometric models\n        - Node fitness models\n        - Cascading failure models\n        - Configuration models\n- **Correlation analysis**\n    - Mathematical models and correlation coefficients\n- **Topology analysis**\n    - Node distance\n    - Node centrality\n    - Denseness\n    - Heterogeneity\n    - Community and backbone\n    - Stability and implicit flow\n### Data sources\n- UN Comtrade (data since 1962)\n- ResourceTrade and CITIES (trade data from specific areas)\n- Explanatory variables (e.g. inflation, GDP, etc.): NBER, World Integrated Trade Solution (WITS), IMF, UNCTADstat\n    - Trade, tariffs, investments, output value, population, etc.\n- Input-output analysis: Eora, WIOD, EXIOBASE, OECD-ICIO (15909 sectors across 190 countries)\n- Integrated data platforms: World Bank (6500 databases across many fields), CEPII (economic + trade data, cultural data), Kristian Skrede Gleditsch (K-G)\n- Other databases (politics, immigration, etc.)\n- Most cited for WTN studies:\n    - UN Comtrade (100)\n    - CEPII (45)\n    - World Bank (37)\n    - K-G (37)\n    - IMF (32)\n### Classifications of the WTN\n- Directionality and weight\n    - Undirected-unweighted ([[International Trade Network.Network Analysis.Trichotomous Measure of World-System Position in the WTN]])\n    - Undirected-weighted ([[International Trade Network.Clustering (Trade Blocs).Rich-Club Phenomenon]])\n    - Directed-weighted ([[International Trade Network.Misc.Triadic Analysis of Agricultural Trade Networks]])\n    - Most of the literature studies weighted-directed WTNs; however, ([[International Trade Network.Modeling + Predicting the WTN.Fitness.Microscopic Study of Node Fitness]]) believe that weighted WTNs do not have greater explanatory power than unweighted WTNs\n- Node definition\n    - Countries = nodes (most common)\n    - Products = nodes or sectors = nodes ([[International Trade Network.Multiproduct Trade Networks.Who Buys What Where]])\n    - Bipartite WTN ([[International Trade Network.Modeling.Multiproduct Trade Network.Prediction in Complex Systems]])\n    - Groups of countries = nodes ([[International Trade Network.Clustering.Network of Networks Perspective on Global Trade]])\n- Edge definition\n    - Import vs. export data\n    - Different types of flow:\n        - Monetary flow (most common)\n        - Energy, emission, environmental impact, chemical flows \n        - **Topological flow**: \n            - Node similarity ([[International Trade Network.Clustering.Multi-Attribute Community Detection in WTN]])\n            - Weight-adjusted topological flow (De Andrade and Rigo 2018)\n            - Product-space proximity ([[International Trade Network.Multiproduct Trade Networks.The Product Space Conditions the Development of Nations]])\n            - Internode competition (An et al. 2014)\n- Visualization tools\n    - UCINET; Gephi; Cytoskape\n    - ArcGIS; QGIS; Python and MATLAB\n    - Web platforms such as RESOURCETRADE and FlowMapBlue\n- Methodologies\n    - Topology analysis\n        - Temporal (global and local evolution of WTN)\n        - Basic measures (distance, node centrality, denseness, heterogeneity)\n        - Structural measures (backbone, community, stability, implicit flow, robustness)\n    - Structural prediction\n        - Dynamic simulation of WTN evolution over time\n        - Spatial econometric models; cascading failure models\n    - Correlation analysis\n        - Relationship between WTN variables and other variables; relationship between WTN variables and WTN variables\n        - Degree-degree correlation; centrality-degree correlation, etc.\n        - WTN on economic growth\n\n## Topology analysis\n\n### Basic properties\n- Distance\n    - Topological proximity between nodes; distinct from weight\n    - Several measures exist\n        - Flow distance: min. number of steps between two nodes (unweighted), reciprocal of min. weight between two nodes (weighted) (De Andrade and Rego 2018)\n        - Trade distance accounting for multilateral resistance effects ([[International Trade Network.Modeling + Predicting the WTN.Gravity.Topological Analysis of Trade Distance]])\n        - Estrada communication distance ([[International Trade Network.Crisis Propagation.COVID-19 Diffusion]])\n        - Minkowski distance considering various node properties ([[International Trade Network.Clustering.Multi-Attribute Community Detection in WTN]])\n- Centrality\n    - Degree centrality; closeness centrality; betweenness centrality; eigenvector centrality\n    - Closeness and betweenness centrality measure global significance of the node as an in-between node (Zhong and An 2014, [[International Trade Network.Misc.Trade and Australia]])\n    - Eigenvector centrality reflects the number of important nodes a node is connected to, and extends to several other concepts:\n        - Katz centrality (Liu et al. 2019)\n        - PageRank (Lamsal 2018)\n        - HITS ([[International Trade Network.Network Analysis.Weighted HITS]])\n\n- Denseness\n    - Density\n    - Clustering coefficients (Fagiolo 2007)\n- Heterogeneity\n    - Whether measures like centrality or node fitness are the same (homogeneous) or different (heterogeneous) for all nodes\n    - Centrality distribution curves, average nearest neighbor centrality, heterogeneity coefficients\n    - WAAND and ANND\n    - Node heterogeneity index ([[International Trade Network.Misc.Plastic and China Plastic Ban]])\n    - Disparity (Maeng et al., 2012)\n    - Homophily ([[International Trade Network.Modeling + Predicting the WTN.Evolution of Commonwealth WTN]])\n\n### Community properties\n- Backbone\n    - Threshold-based methods\n        - Nodes exceeding certain degree/strength are part of the backbone\n        - Inflexible; instead a top-X algorithm is used (Maeng et al. 2012)\n    - Maximum-spanning tree methods\n        - Subgraph with greatest sum of weights among all min. connected subgraphs\n        - Employed by ([[International Trade Network.Network Analysis.Spanning Trees of the WTN]])\n    - Null model based methods (Piccardi and Tajoli 2012)\n- Community\n    - Detection of strongly interconnected \"trade islands\"; helps understand trade regionalization\n    - Modularity optimization (Piccardi and Tajoli 2012, [[International Trade Network.Clustering.Trade Networks of the BRI]], [[International Trade Network.Clustering.The Rise of China]])\n        - Divisive algorithms (fragments entire WTN into smaller communities)\n        - Agglomerative algorithms (starts from each individual node and builds up communities) ([[International Trade Network.Clustering.Identifying the Community Structure of the WTN]]; [[International Trade Network.Misc.Meat Trade Network]])\n        - Community partition significance uses small perturbations (Hu et al. 2010) to determine whether global optimum solutions exist to community detection\n- Stability\n    - Extent of fluctuations in network topology over time\n    - Set similarity: similarity of WTN between two years\n        - Jaccard index; autocorrelation function; Hamming distance (An et al. 2014; Wang et al. 2022)\n    - Matrix similarity ([[International Trade Network.Misc.Stability of Oil Network]])\n    - Modified Hamming distance ([[International Trade Network.Clustering.Network of Networks Perspective on Global Trade]])\n    - Community structure stability based on Normalized Mutual Information ([[International Trade Network.Modeling + Predicting the WTN.Kaolin International Trade]]; [[International Trade Network.Clustering.Identifying the Community Structure of the WTN]])\n- Robustness\n    - Stability of WTN when faced with disruptions\n    - Penetration threshold ([[International Trade Network.Misc.Robustness of Oil Trade]])\n    - Stability-based measures without disruptions\n        - HHI ([[International Trade Network.Clustering.Identifying the Community Structure of the WTN]]; [[International Trade Network.Misc.Global Energy Flows]]; [[International Trade Network.Misc.Country Risks]])\n        - Laplacian centrality\n        - Fiedler eigenvalue\n        - Spectral radius ([[International Trade Network.Clustering.Multi-Attribute Community Detection in WTN]])\n- Implicit flow\n    - Influence between non-connected nodes in WTN\n    - Random walker model ([[International Trade Network.Network Analysis.Dominant Flows in the WTN]])\n    - Input-output analysis ([[International Trade Network.Misc.Evolution of World Trade]])\n\n## Structure prediction\n### Gravity models\n- Incapable of considering multilateral dependence of trade relationships\n- Two types of improvements:\n    - Introducing WTN parameters into GM\n        - Degree centrality ([[International Trade Network.Network Analysis.World Trade Network]])\n        - Human migration ([[International Trade Network.Misc.Human Migration and Trade]])\n        - Centrality distribution power index ([[International Trade Network.Economic Growth.Heckscher-Ohlin]])\n        - GNN combined with GM (Verstyuk and Douglas 2022)\n    - Changing the mechanisms of the GM\n        - Changing indices of distance ([[International Trade Network.Network Analysis.Spanning Trees of the WTN]])\n        - Effective trade distance rather than geographical distance ([[International Trade Network.Modeling + Predicting the WTN.Gravity.Topological Analysis of Trade Distance]])\n        - Using General Bilinear Mixed Effects model to simulate multilateral dependence (Ward et al. 2013)\n### Spatial regression models\n- Consider spatial autocorrelation between nodes (local nodes influenced by neighboring nodes)\n    - [[International Trade Network.Economic Growth.A Multi-Network Perspective]]\n\n### Node fitness models\n- Derived from intrinsic variable models: nodes possess an intrinsic value that determines connection probability between any two nodes\n- Virtual network generated based on this fitness can reproduce properties of the real network\n- Node fitness defined as normalized GDP ([[International Trade Network.Modeling + Predicting the WTN.Fitness.Fitness-Dependent Topological Properties]])\n- Standard fitness model with simple binary relationship used ([[International Trade Network.Modeling + Predicting the WTN.Fitness.Fitness-Dependent Topological Properties]]); adjusted fitness model ([[International Trade Network.Modeling + Predicting the WTN.Structure and Evolution of the WTN]]; [[International Trade Network.Modeling + Predicting the WTN.Topology and Dynamics]])\n- Fitness model used to forecast trade volumes ([[International Trade Network.Economic Growth.GDP-Driven Structural Prediction]])\n- Fitness difference term proposed ([[International Trade Network.Modeling + Predicting the WTN.Fitness.Microscopic Study of Node Fitness]])\n\n### Configuration models\n- Maximum-entropy null model generation:\n    - Binary generation (Squartini et al. 2011)\n    - Enhanced generation (Mastrandrea et al. 2014)\n    - Directed generation (Ruzzenenti et al. 2012)\n    - Bipartite generation ([[International Trade Network.Crisis Propagation.Warning Signals for Crises]])\n    - Fitness generation (Cimini et al. 2015)\n- Empirical evidence suggests that the binary WTN can be entirely reconstructed from weights\n- Also conducted two-step analysis ([[International Trade Network.Economic Growth.GDP-Driven Structural Prediction]]; Cimini et al. 2015)\n- Comparisons between real WTN and null models reveal geographic dependency (Ruzzenenti et al. 2012), nestedness ([[International Trade Network.Clustering.Nested Structure of the WTN]]), and recession warning signals ([[International Trade Network.Crisis Propagation.Warning Signals for Crises]])\n\n### Cascading failure models\n- Based on supply chain theory\n- Bootstrap percolation ([[International Trade Network.Crisis Propagation.Bootstrap Percolation and Attack]])\n- Two improvements to bootstrap:\n    - Weight distribution ([[International Trade Network.Crisis Propagation.Topology and Crisis Propagation]]); stronger nations suffer less from crises (Grassia et al. 2022)\n    - Absorption of crises ([[International Trade Network.Crisis Propagation.Spillover Effects]]; [[International Trade Network.Crisis Propagation.COVID-19 and Shocks]])\n    - Weak links in crisis propagation cannot be overlooked ([[International Trade Network.Crisis Propagation.Topology and Crisis Propagation]]; Lee and Goh 2016)\n\n### Other models\n- Topological similarity models; preferential attachment (Zhou et al. 2022)\n- Agent decision models (each producer maximizes their own profit/minimizes their own costs) - globalization ([[International Trade Network.Modeling + Predicting the WTN.Locally Optimal Individual Decisions]]), Brexit ([[International Trade Network.Modeling + Predicting the WTN.Brexit]])\n- Predicting link formation/export baskets via bipartite model ([[International Trade Network.Modeling.Multiproduct Trade Network.Prediction in Complex Systems]])\n\n## Correlation analysis\n### Correlation between topological attributes\n\n- Degree-ANND correlation ([[International Trade Network.Network Analysis.Topology of the World Trade Web]]) and strength-ANNS correlation ([[International Trade Network.Network Analysis.Topology of the World Trade Web.Economic Integration in East Asia and Latin America]]) both negative and more pronounced over time ([[International Trade Network.Modeling + Predicting the WTN.Analytic Process Framework]])\n- Out-degree and in-degree correlation ([[International Trade Network.Network Analysis.Topology of the World Trade Web]]) and out-strength and in-strength correlation positive, fit power law\n- Positive degree-strength correlation (Liu et al. 2007; [[International Trade Network.Modeling + Predicting the WTN.Analytic Process Framework]])\n- Clustering coefficient-degree correlation negative but WCC-strength correlation positive ([[International Trade Network.Network Analysis.Topology of the World Trade Web.Fagiolo et al]])\n- Core-periphery topology\n\n### Correlation between network attributes and other indicators\n\n- Economic/political/environmental indicators, e.g. GDP; central nations in the WTN have higher GDPs ([[International Trade Network.Misc.Human Migration and Trade]]; Schiavo et al. 2014)\n- Edge weights correlated with geographical distance ([[International Trade Network.Misc.Investment Networks]])\n\n### Correlation between cross-product attributes\n\n- Similarities between WTNs formed by different products or times\n- Clustering coefficients, in- and out-strengths, etc. similar for products that share HS codes ([[International Trade Network.Multiproduct Trade Networks.Multinetwork of International Trade]])\n- Human migration and WTN correlated ([[International Trade Network.Misc.Human Migration and Trade]]); FDI and WTN correlated ([[International Trade Network.Economic Growth.A Multi-Network Perspective]])\n\n### Overlap between WTN and similar networks\n- Jaccard index used to measure overlap between WTN and migration network ([[International Trade Network.Economic Growth.A Multi-Network Perspective]])\n- Commodity-specific weighted analysis reveals that similar commodities have similar trade patterns ([[International Trade Network.Multiproduct Trade Networks.Multinetwork of International Trade]]; [[International Trade Network.Crisis Propagation.Multiplex Cascading Failure]])\n- Element difference and quadratic assignment procedure (QAP) reveal correlations with the FDI, inflation rate, exchange rate, and high-tech exports ([[International Trade Network.Modeling + Predicting the WTN.Analytic Process Framework]])\n- Positive effect of geographic adjacency and negative effect of institutional disparities on trade ([[International Trade Network.Multiproduct Trade Networks.Recommendations of New Produ]])\n\n### Exponential random graph models\n\n- Temporal ERGMs (Xu, Yang and Razzaq 2021; [[International Trade Network.Modeling + Predicting the WTN.ERGM.Humanistic Factors Along the BRI]])\n- Separable TERGM for WTN evolution dynamics ([[International Trade Network.Modeling + Predicting the WTN.ERGM.ERGM Analysis of the WTN]])\n- Use AIC and BIC\n\n### Econometric models\n- Influence of WTN on economic fluctuations ([[International Trade Network.Economic Growth.Trade and Volatility]])\n- GNNs to predict national income levels (Panford-Quainoo et al. 2020)\n\n## Discussion\n\n- WTN analysis reveals structure and evolution of trade ([[International Trade Network.Network Analysis.World Trade Network]])\n- Bilateral trade not independent of influences of other countries, requiring WTN ([[International Trade Network.Economic Growth.Gravity Rainbow]])\n- WTN links can reveal:\n    - Status of countries in global value chains (Reyes et al. 2010)\n    - Implicit impacts between non-adjacent countries (Abeysinghe and Forbes 2005)\n    - Heterogeneity ([[International Trade Network.Modeling + Predicting the WTN.Evolution of Commonwealth WTN]])\n    - Triadic structures ([[International Trade Network.Clustering.Structure and Formation of Top Networks]])\n    - Economic integration ([[International Trade Network.Modeling + Predicting the WTN.Measuring Globalization]])\n- The WTN can be used to construct scenarios on multiple levels:\n    - Level 1: trade itself\n        - Multiscale ITNs ([[International Trade Network.Multiproduct Trade Networks.Recommendations of New Produ]])\n        - Multiple commodity ITNs (Gephart and Pace 2015)\n        - Temporal ITNs (Luo and Yuan 2021)\n    - Level 2: the structure of trade\n        - Centrality ([[International Trade Network.Network Analysis.World Trade Network]])\n        - Distance measures (Piccardi and Tajoli 2012)\n        - Communities ([[International Trade Network.Misc.Robustness of Oil Trade]]), stability of communities ([[International Trade Network.Misc.Features of Oil Trade]])\n        - Density ([[International Trade Network.Network Analysis.World Trade Network]]), connectivity ([[International Trade Network.Multiproduct Trade Networks.Multinetwork of International Trade]]), trade chains (Reyes et al. 2010)\n    - Level 3: the dynamics and evolution of trade\n        - Random walkers ([[International Trade Network.Network Analysis.Dominant Flows in the WTN]]); input-output analysis ([[International Trade Network.Misc.Evolution of World Trade]])\n        - Reconstruction of trade flows via basic network features ([[International Trade Network.Multiproduct Trade Networks.Who Buys What Where]])\n        - Interaction between trade and other systems\n- The WTN is useful for observing dynamic changes of world trade over time\n    - Evolution of trade status of countries ([[International Trade Network.Network Analysis.Weighted HITS]]); formation of network hierarchies ([[International Trade Network.Modeling + Predicting the WTN.Analytic Process Framework]]); market regulations (An et al. 2014); economic prosperity ([[International Trade Network.Modeling + Predicting the WTN.Kaolin International Trade]]); integration (Tzekina et al. 2008; Barigozzi et al. 2010)\n        - Integration leads to convergent behavior among economies ([[International Trade Network.Network Analysis.Synchronization of the WTN]])\n    - Impact of other trends on trade:\n        - Finance ([[International Trade Network.Clustering.Network of Networks Perspective on Global Trade]]); wars (An et al. 2014); varying impacts of shocks (Liu et al. 2019)\n    - Policy recommendations\n        - Increasing node degree is beneficial for countries (Sun et al. 2022)\n        - Increasing complexity of products is beneficial ([[International Trade Network.Modeling + Predicting the WTN.Kaolin International Trade]]; Liao et al. 2018)\n        - Market innovation matrix ([[International Trade Network.Misc.Trade and Australia]])\n        - QAP Analysis ([[International Trade Network.Misc.Petroleum Along the BRI]]; [[International Trade Network.Modeling + Predicting the WTN.Analytic Process Framework]])\n        - Risk mitigation:\n            - Diversify partners (Li et al. 2021)\n            - Improve productivity (Liang et al. 2020)\n            - Develop alternative products ([[International Trade Network.Misc.Cruel Oil Competition Networks]])\n            - Stimulating domestic consumption ([[International Trade Network.Misc.Country Risks]])\n            - Increasing trade agreements ([[International Trade Network.Modeling + Predicting the WTN.Kaolin International Trade]])\n\n## Future agendas\n- **Broader scenario reconstruction**   \n    - Analyze on a commodity-to-commodity basis ([[International Trade Network.Clustering.Nested Structure of the WTN]])\n    - Cascading failure models ([[International Trade Network.Crisis Propagation.Multiplex Cascading Failure]]; Liu et al. 2016)\n    - Artificial intelligence, including GNNs\n\n## Connected research\n- [[International Trade Network.Modeling + Predicting the WTN.Gravity.Topological Analysis of Trade Distance]], Wu et al., 2020\n- [[International Trade Network.Clustering.Network of Networks Perspective on Global Trade]], \n- [[International Trade Network.Modeling.Multiproduct Trade Network.Prediction in Complex Systems]], Vidmer et al., 2015\n- [[International Trade Network.Multiproduct Trade Networks.Who Buys What Where]], Ikeda et al. 2016\n- [[International Trade Network.Modeling + Predicting the WTN.Fitness.Microscopic Study of Node Fitness]], Hoppe and Rodgers 2015\n- [[International Trade Network.Network Analysis.Trichotomous Measure of World-System Position in the WTN]], Clark and Beckfield 2012\n- [[International Trade Network.Misc.Triadic Analysis of Agricultural Trade Networks]], Shutters and Muneepeerakul 2012\n- [[International Trade Network.Network Analysis.Topology of the World Trade Web.Economic Integration in East Asia and Latin America]], Reyes et al. 2010\n- [[International Trade Network.Modeling + Predicting the WTN.Analytic Process Framework]], Zhao and Dzever 2018\n- [[International Trade Network.Crisis Propagation.Multiplex Cascading Failure]], Zhang et al. 2016\n- [[International Trade Network.Misc.Human Migration and Trade]], Fagiolo and Mastrorillo 2014.\n- **Trade Blocs, Trade Flows, and International Conflict**, Mansfield and Pevehouse 2000. Membership in the same trade bloc decreases chance of military conflict.\n- **Structure and formation of top networks in international trade, 2001-2010**, Zhou et al.","n":0.019}}},{"i":42,"$":{"0":{"v":"Robustness of Oil Trade","n":0.5},"1":{"v":"\n\n### Wei et al., 2022","n":0.447}}},{"i":43,"$":{"0":{"v":"Plastic and China Plastic Ban","n":0.447},"1":{"v":"\n\n### Wang et al., 2020","n":0.447}}},{"i":44,"$":{"0":{"v":"Petroleum Along the BRI","n":0.5},"1":{"v":"### Zhang et al., 2019","n":0.447}}},{"i":45,"$":{"0":{"v":"Meat Trade Network","n":0.577},"1":{"v":"\n\nChung et al., 2020","n":0.5}}},{"i":46,"$":{"0":{"v":"Investment Networks","n":0.707},"1":{"v":"\n\n### Zhang et al., 2016","n":0.447}}},{"i":47,"$":{"0":{"v":"Human Migration and Trade","n":0.5},"1":{"v":"### Fagiolo and Mastrorillo 2014","n":0.447}}},{"i":48,"$":{"0":{"v":"Global Energy Flow","n":0.577},"1":{"v":"\n\n### Chen et al., 2017","n":0.447}}},{"i":49,"$":{"0":{"v":"Features of Oil Trade","n":0.5},"1":{"v":"\n\n### An et al., 2014","n":0.447}}},{"i":50,"$":{"0":{"v":"Evolution of Oil Trade","n":0.5},"1":{"v":"### Du et al., 2017","n":0.447}}},{"i":51,"$":{"0":{"v":"Crude Oil Competition Networks","n":0.5},"1":{"v":"\n\n### Zhou et al., 2022","n":0.447}}},{"i":52,"$":{"0":{"v":"Country Risks","n":0.707},"1":{"v":"\n\n### Sun et al., 2022","n":0.447}}},{"i":53,"$":{"0":{"v":"Complexity of Food Trade Network","n":0.447},"1":{"v":"### Ercsey-Ravasz and Toroczkai, 2012","n":0.447}}},{"i":54,"$":{"0":{"v":"Economic Growth","n":0.707},"1":{"v":"Papers on the relationship between WTN topology and economic growth.","n":0.316}}},{"i":55,"$":{"0":{"v":"Trade and Volatility","n":0.577},"1":{"v":"### Gray and Potter, 2012","n":0.447}}},{"i":56,"$":{"0":{"v":"Trade Structure and Economic Growth","n":0.447},"1":{"v":"### Kali et al.\n\nThe \"structure of trade\" - a country's number of trade partners, the concentration of their trade partners, etc. - can be used to predict its rate of economic growth, and is just as informative of a variable as the actual trade volume.\n\n****\n\n## Literature review\n\n- How does trade affect economic growth?\n    - Econometric analysis has involved export/import volumes, tariffs, measures of \"trade openness\" etc.\n    - However, little attention has been given to **trade strategies**: the selection of trade partners, the trade agreements established (130 reported to WTO in last decade)\n    - The structure of trade has changed in more pronounced ways than the volume of trade:\n        - Proportion of trade to GDP increased from 58.3% to 88.5%, 1970-2003\n        - Avg. number of trading partners **more than doubled** (46.4 to 93.9 in same period)\n        - **Trade concentration **(Herfindahl index) decreased from 2201 to 1580 -> less reliant on any one trade partner, more diversified\n    - Do changes in trade structures affect economic growth?\n        - **Variables used**: number of trading partners of a country, **concetration of trade** -> GDP growth rate\n        - **Dataset**: 1980-2000, 155 countries\n        - **Results**:\n            - No. of trading partners positively correlated with GDP growth\n            - Trade concentration also positively correlated, but mostly for poorer countries\n- Previous studies on trade and GDP growth\n    - Trade openness: Dollar 1992, Sachs and Warner 1995, Wacziarg 1998\n        - **Trade openness** is defined as the ratio of total trade volume to GDP for a country\n    - Increases in trade productivity as a result of trade openness: Coe and Helpman 1995, Keller 1998, Edwards 1998\n\n## Methods\n\n### Theoretical background\n\n- Trade increases productivity via technological diffusion:\n    1. Trade generates knowledge spillovers that expand no. of goods, production processes, or ideas known to the local market -> increased productivity\n    2. Trade generates competition and forces innovation & expands market of potential buyers\n- How does the structure of trade affect such mechanisms?\n    - Hypothesis: more trading partners -> more ideas exposed and more technological diffusion, ceteris paribus; also more potential buyers, greater innovation, more competition -> more productivity (Vickers and Yarrow 1991)\n    - Additional trade partners:\n        - Marginal benefit of additional trade partners may be different for poor rather than for rich countries\n            - On one hand, poor countries have a small stock of knowledge and may not fully utilize new technologies\n            - On the other hand, poor countries may benefit more from each new technology due to their limited existing knowledge\n        - Benefit of having rich trading partners may be different from having poorer partners\n            - Rich partners (technologically superior) may lead to more technological diffusion effects than poor ones\n        - Model explores: rich vs poor partners, marginal effects on rich and poor countries\n    - Concentration of trade:\n        - Hypothesis: higher concentration of trade (less diverse trading partners) has a positive effect on growth\n            - Some technologies from different countries are equally efficient but different in form and incompatible (e.g. American and European electric outlets)\n            - May be cost-efficient to concentrate on a few trade partners; lowers transportation costs\n            - Economies of scale in small economies\n        - Rich countries may benefit less from trade concentration, e.g. because they have better transportation infrastructure\n\n### Econometric specifications\n- Hypothesis: there is a relationship between trade structure and economic growth not accounted for purely in the trade volume variable\n    - An increase in no. of trade partners increases growth, though this effect differs for rich and poor countries\n    - An increase in trade concentration increases growth, with a smaller effect for richer countries\n- Earlier econometric literature on trade and growth:\n    - Levine and Renelt (1992) provides the econometric specification used in this paper:\n        - Growth rate of GDP per capita $\\dot{y}/y$ regressed against vector $\\vec{C}$ \n        - $\\vec{C}$ composed of initial per-capita income $y_0$, rate of population growth $\\dot{L}/L$, secondary-school enrollment ratio, and ratio of investment to GDP\n        - Trade openness is also included and is measured by ratio of total trade (exports + imports) to GDP\n        - Additionally, **trade structure** information is represented by a vector $\\vec{TS}$ of explanatory variables\n        - The model is\n        $$\n        \\frac{\\dot{y}}{y} = \\alpha + \\beta \\vec{C} + \\phi Trade + \\psi \\vec{TS} + \\epsilon\n        $$\n        with constants $\\alpha, \\beta, \\phi, \\psi$ and a country error term $\\epsilon\n    - Use standard ordinary least-squares of average in entire timeframe (1980-2000) or fixed-effect regression over a five-year average\n    - To test robustness, use Feder (1982) alternative specification:\n    $$\n    \\frac{\\dot y}{y} = \\alpha(\\frac{I}{Y}) + \\beta(\\frac{\\dot L}{L}) + \\gamma (\\frac{\\dot X}{X}\\frac{X}{Y}) + \\chi \\vec{TS} + \\epsilon\n    $$\n    where $X$ denotes exports, $Y$ real output, and $I$ investment.\n\n- **Dataset description**. Large sample of countries from 1980-2000. Variables: annual population growth (POP), real income per capita (GDP), annual GDP growth (GDP), secondary school enrollment rates (SED), investment to GDP ratio, total trade to GDP ratio, government expenditure to GDP ratio\n    - Additionally incorporate trade structure variables, i.e. total number of trade partners and concentration of trade volumes among partners (DOT database from IMF)\n    - Monetary value of total imports and exports used to construct Herfindahl index of trade (HHI)\n    $$\n    HHI = \\sum_{j=1}^N (\\frac{T_{ij}}{\\sum_{j=1}^N T_{ij}})^2\n    $$\n    i.e. sum of squares of trade share of every trading partner. No. of trading partners not necessarily correlated with trade concentration. (Multicolinearity bias avoided - $R^2$ correlation between two variables is 0.14)\n    - Compute number of rich partners and poor partners separately to test the hypothesis that rich partners have different effects on trade than poor ones (threshold = median GDP in 1980)\n\n## Results\n\n- Trade openness:\n    - Pos. and significant coefficient for poor countries; positive but statistically insignificant for total sample; negative and insignificant for rich sample\n- No. of trading partners:\n    - Positive for all three samples; considerable magnitude for GDP growth\n    - Increasing no. of trading partners by 10 increases growth by 0.52% - significant for poor countries whose annual rate of growth is 1% or lower\n    - Smaller effect for poor countries than rich countries, **confirming above hypothesis**\n- Trade concentration:\n    - Positive and statistically significant for most of the sample; mixed evidence for rich sample\n    - Poor countries: 1 standard deviation rise in HHI leads to 1.42% increase in GDP growth rate (0.32 st. dev.) for poor countries, while for rich countries it is 0.97% (0.19 st. dev.)\n- Robustness:\n    - Using the specifiation by Feder (1982), similar conclusions are drawn","n":0.031}}},{"i":57,"$":{"0":{"v":"Openness and Growth","n":0.577},"1":{"v":"\n\n### Duernecker et al., 2021","n":0.447}}},{"i":58,"$":{"0":{"v":"Networks in Growth","n":0.577},"1":{"v":"### **Kali et al., 2009**\n\nThis paper applies the product space techniques from [[International Trade Network.Multiproduct Trade Networks.The Product Space Conditions the Development of Nations]]. They use a firm-level agent decision model to simulate moving to new products in the Product Space and conclude that the product space of a nation must exhibit \"small-world\" properties before it can exhibit high levels of growth.\n\n***\n\n## Literature review\n\n- Relationship between trade and economic growth has, until recently, been undisputed (World Bank, IMF, OECD, Krueger 1998, Stiglitz 1998, Fischer 2000, Dollar 1992, Sachs and Warner 1995, Ben-David 1993, Frankel and Romer 1999)\n- However, there has been some controversy in recent studies (Rodriguez and Rodrik 2000, Harrison and Hanson 1999)\n    - Waczairg and Welch 2008 now caution against a one-size-fits-all approach for all countries despite confirming a generally positive relationship between openness and GDP growth\n- Following Hausman and Bailey 2007 and Hidalgo et al. 2007 [[International Trade Network.Multiproduct Trade Networks.The Product Space Conditions the Development of Nations]], this paper uses a network analysis of the Product Space to discover patterns in country production before growth acceleration\n- \"Small world\" property of networks seems to be optimal (Watts and Strogatz 1998) - path length grows logarithmically vs. number of nodes\n    - **Hypothesis/conjecture**: before experiencing high levels of growth/growth acceleration, a country's product space needs to exhibit the small-world property\n    - Why?\n        - Short path lengths due to small-world allow for easier leaps to higher-value products in product space\n    \n## Methods\n\n1. Evolution of topology of product space over time, 1965-2000\n2. Analysis of country-level product space; derivation of spillover effects and distance; formalization of small-world theory\n3. Multivariate regressions to confirm small-world theory\n\n- Past results on Product Space:  \n    - Hidalgo et al. 2007 identify high heterogeneity in product space: some parts are dense while others are sparse\n    - Poor countries have difficulty in traversing product space because their production lies in the periphery (which is sparse)\n    - Growth accelerations, identified in Hausman 2005: not correlated with determinants like economic reform or political change, but fairly frequent (60 out of 110 countries had growth acceleration from 1957 to 1992)\n\n### Product space\n\nSee [[International Trade Network.Multiproduct Trade Networks.The Product Space Conditions the Development of Nations]], with the following additions:\n- The **country-level product specialization** is the subset of the product space produced by a country (i.e. the comparative advantage of the country)\n- Small-world properties arise in many networks in nature, e.g. US power grid, scientific collaborations, earthworm neural network; considered an \"optimal\" topology for successful networks\n- Product space may move to small-world configuration before faster growth\n\n### Small-world model\n\n- At time $t$, a country has RCA in products $R = \\{y_1, ..., y_n\\}$\n    - Each product faces a corresponding world price $p_{y_i}$\n    - Cost of production affected by **positive spillovers**: if country produces other products similar to product $i$, then there is less cost due to economies of scale\n    - Suppose that this is captured by a cost function $c_{y_i} = c(\\sum \\phi_{ij})$ where $\\sum\\phi_{ij}$ is the proximity of all other products the country produces to $i$. \n    - Assume $c' > 0$ and $c'' > 0$, and that $c(0)$ is some average cost $\\bar{c}$.\n- A graph is formed from the pairwise proximities of products produced by the country\n    - Leaping to a new product in the Product Space can be modeled with the following three-period firm-based model:\n1. Period 1: initial period of product. Firm cannot choose to make a leap. Cost of production is $p_{y_i} - c(y_i)$.\n2. Period 2: Suppose that the cost of moving 1 unit on the Product Space is $\\theta$ and that the nearest product on the product space is a distance $d$ away. The firm needs to makes enough profit in Period 1 to traverse the cost $d\\theta$:\n$$\np_{y_i} - c_{y_i} \\geq d\\theta.\n$$\nIf the firm transitions to product $k$, there will be positive spillover effects associated with this transition. However, the positive spillover effects that come from this new product will not be immediately evident, so the cost is simply $p_{y_k} - \\bar{c}$.\n\n3. Period 3: The spillover effects from period 2 appear. New costs are $p_{y_k} - c(y_k)$.\n\nThis leads to three scenarios:\n1. The firm does not move to a new product in period 2. Total profit is $\\Pi(I) = 3(p_{y_i} - c(y_i))$ across three periods. This is \"stagnation\".\n2. The firm moves to a product in period 2 but moves back to old product in period 3. Total profit is $\\Pi(II) = 2(p_{y_i} - c_{y_i}) + p_{y_k} - \\bar{c}$. This is \"slow growth\".\n3. Firm moves to new product in period 2 and stays there in period 3. Total profit is $\\Pi(III) = p_{y_i} - c_{y_i} + 2(p_{y_k}) - \\bar{c} - c_{y_k}$. This is \"growth acceleration\".\n\nThe **leap incentive** is the function\n$$\n\\Pi(III) - \\Pi(I) = 2(p_{y_k} - p(y_i)) + 2c_{y_i} - \\bar{c} - c_{y_i}- c_{y_k}\n$$\ni.e. the additional profit to be gained from growth acceleration; additionally, we have $p_{y_i} - c_{y_i} \\geq \\theta d$, known as \"leap feasibility\".\n\nIf current spillovers increase, meaning that the cost $c_{y_i}$ decreases, the leap incentive decreases but leap feasibility increases. Leap feasibility is a supply-side condition; leap incentive is demand-side. The size of the region satisfying the leap incentive and leap feasibility is the probability that growth acceleration will occur.\n\nThis leads to the following propositions:\n- If the product is in a sparse region of the Product Space, leap feasibility is low.\n- If the product is in a dense region of the product space, leap incentive is high while leap feasibility is also high.\n\n## Results\n\n### Evolution of product space, 1965-2000\n\n- Look at correlation coefficient for proximities of products thorugh time\n    - 1962 to 1970: correlation 0.9\n    - 1970 onwards: 15 years apart - correlation below 0.5\n    - Community structure algorithm (QCUT) and Jaccard index (compares two sets $S_1$ and $S_2$ over time, equals the ratio between intersection of $S_1$ and S_2$ and union of $S_1$ and $S_2$) suggests that:\n        - Manufactured cluster growing\n        - Overlaps with chemicals and machinery increasing\n\n\n### Network measures of spillover and distance\n\n- Product centrality, defined as $\\frac{\\sum_{j}^J \\phi_{ij}}{J}$ for product $i$ - avg of proximity to all other products in Product Space\n- Nation centrality, i.e. product centrality weighted by exports\n\n","n":0.031}}},{"i":59,"$":{"0":{"v":"ITN and Financial Integration","n":0.5},"1":{"v":"\n### Schiavo et al.\n\nThe WTN and WFN (world financial network) are analyzed together and compared in regard to their properties, finding that the WTN is more densely connected than the WFN, that both networks exhibit core-periphery structures, and that the WFN is more hierarchical.\n\n***\n\n## Literature review\n\n- Network formed from flow of **financial assets** not well-studied; can provide interesting insights into globalization\n- Important to understand similarities and differences in real vs. financial integration; can advance our understanding of WTN dynamics\n\n## Methodology\n- Analyze the following network measures:\n    - ND, ANND and CC for unweighted\n    - NS, ANNS, and weighted CC for weighted\n    - Random walk betweenness centrality\n\n- Data:\n    - Financial network formed from CPIS (Coordinated Portfolio Investment Survey) via IMF\n    - Trade taken from UN Comtrade\n    - Sample size only 61-65 countries but accounts for 80% of world trade\n    - Treat network as undirected\n\n## Results\n\n- Reciprocity of networks: 96% for world trade, 75% for financial flows\n- Density of networks:\n    - WTN more integrated; 98% density for WTN, 62% to 69% for different types of financial flows in WFN\n    - Density increased from 2001 to 2004\n    - Real markets more integrated than financial ones\n    - Long-term debt denser than short-term debt and equities (25-30% density only)\n- Degree distribution:\n    - IFN bimodality; \"elite\" of countries with many connections\n    - Node strength paints a different picture; both peak at low strengths with very few strong connections\n    - *Node disparity* low and stable for WTN, larger for WFN (lower = more homogeneous links)\n    - Node disparity lower than a random graph\n    - May imply that the benefits of trading with more countries (e.g. economies of scale, comparative advantage) lead to more diverse trade\n- ANNS-degree correlation\n    - Goyal and Van der Leij (2006): networks characterized by skewed degree distribution (a few nodes which are well-connected) and positive strength-degree distribution (nodes which are well-connected have strong connections) are core-periphery networks\n    - IFN positive ANNS-degree correlation; well-connected countries are connected to well-connected countries; well-connected countries have strong connections\n- Assortativity\n    - Negative ANND-ND and ANNS-NS correlation in both cases\n- Clustering\n    - Binary clustering almost 1; weighted clustering low\n        - Not surprising given high heterogeneity among link strengths; for high weighted CC, all three links have to be strong\n    - High correlation between weighted CC and NS: major financial hubs more clustered\n    - Statistically significant, i.e. higher compared to null model\n    - Rich club coefficient shows that small group of countries command most international flows:\n        - Top 10 countries account for 40% of trade in goods and 60% of flow in financial assets\n- Centrality\n    - RWBC distributed by power law, top 10% of RWBC countries are part of rich core\n    - Same central core for ITN and IFN except Luxembourg (core financially but not in trade)","n":0.047}}},{"i":60,"$":{"0":{"v":"Heckscher-Ohlin","n":1},"1":{"v":"### Baskaran et al., 2011","n":0.447}}},{"i":61,"$":{"0":{"v":"Gravity Rainbow","n":0.707},"1":{"v":"### Ward et al., 2013","n":0.447}}},{"i":62,"$":{"0":{"v":"GDP-Driven Structural Prediction","n":0.577},"1":{"v":"### Almog et al., 2015","n":0.447}}},{"i":63,"$":{"0":{"v":"Consumer Demand and Cost Factors","n":0.447},"1":{"v":"\n\n### Vollrath et al., 2006","n":0.447}}},{"i":64,"$":{"0":{"v":"Decoding Complexity - Glattfelder","n":0.5},"1":{"v":"Notes on James Glattfelder's Paper, *Decoding Complexity*, regarding the application of complex network theory to ownership networks.","n":0.243}}},{"i":65,"$":{"0":{"v":"Thoughts on Economic Complexity","n":0.5},"1":{"v":"## Summarizing complex networks\n\n### <span style=\"background-color: #12ffd7; color: black;\">1.</span> The basic model\n- *Ownership networks*. Networks where each node is a firm that can own shares in other firms of the group. The adjacency network of the group, $W = [W_{ij}]$, denotes the share of ownership between any two firms. This leads to:\n- *Direct ownership* and *indirect ownership*. Direct ownership denotes, e.g. firm $A$ directly being connected to firm $B$, while indirect ownership denotes firm $A$ reaching firm $B$ through a series of connections. \n    - Direct ownership is provided simply by the adjacency matrix  $W$\n    - Indirect ownership (integrated ownership) $\\tilde{W}$ is provided by the recursion $\\tilde{W} = W + W\\tilde{W}$\n- Similarly define:\n- *Direct value* (portfolio value) and *indirect value* (integrated value).\n    - Portfolio value, $p$: value of shares a firm directly owns. We have $p=Wv$ \n    - Integrated value, $\\nu^{int}$: value of shares a firm indirectly owns. We have $\\nu^{int} = \\tilde{W}v$, leading to...\n    - Network value, $v^{net}$: a firm owns itself, so network value is integrated value plus a firm's own value. $v^{net} = \\nu^{int} + v$.\n\n### <span style=\"background-color: #12ffd7; color: black;\">2.</span> Problem 1: Self-loops and improvements\n- Self-loops (A owns B, B owns A) lead to overestimations in integrated (indirect) value due to its recursive definition\n- Examine $\\nu^{int}$ for a firm $i$: $\\nu^{int}_i = \\sum_{j} \\tilde{W}_{ij}v_j$\n    - The solution is to remove the portion which represents the ownership of $i$ in itself, $\\tilde{W}_{ii}$.\n- In matrix form, this was found to be equivalent to multiplying $\\nu^{int}$ by a *correction operator* $D = (\\text{diag}(I-W)^{-1})^{-1}$.\n- Similarly correct $v^{net}$ by setting $Dv^{net}$, and $\\tilde{W}$ by setting $D\\tilde{W}$. Thus we have a series of corrections:\n$$\n\\begin{cases}\n\\hat{v}^{net} = Dv^{net} \\\\\n\\hat{\\nu}^{int} = D\\nu^{int} \\\\\n\\hat{W} = D\\tilde{W}\n\\end{cases}\n$$\n\n### <span style=\"background-color: #12ffd7; color: black;\">3.</span> Problem 2: Root node accumulation and improvements\n- **Interpretation in terms of flow**. Integrated value $\\nu^{int}$ is a representation of flow in networks. This can be mathematically proven, but intuitively, it is because the integrated value represents how much economic value a firm owns because of its ownership of shares in other firms. Thus, it is how much value *flows* to a firm from other firms.\n- The *bow-tie* problem. Ownership networks often assume a bow-tie shape with IN nodes, OUT nodes and a strongly-connected component (SCC). IN nodes own the SCC but are not owned, the SCC's firms own each other, and OUT nodes are owned by firms in the SCC but do not own any firms.\n    - As IN nodes own shares but are not owned in return, value flows to them while no value flows from them. This will lead to an accumulation of value into IN nodes, and an excessive overestimation for $\\nu^{int}$ and $v^{net}$.\n- To solve this, note that **two** corrected values originate from the correction operator $D$: $\\hat{W}=DW$, and due to the non-commutativity of matrix multiplication, $WD$.\n    - From $WD$, we have $\\bar{v}^{net} = WDv^{net} + Dv$ where $v^{net}$ is the uncorrected network value. (This is opposed to $DWv^{net} + Dv$, which is $\\hat{v}^{net}$).\n    - SImilarly, we have $\\bar{\\nu}^{int} = WDv^{net}$.\n- This correction has the issue of **computation speed**: it runs in $O(n^3)$. Thus an algorithmic correction based on breadth-first search (BFS) is also proposed:\n    - General algorithm $(*)$: run BFS on a node to find all nodes reachable from it. This will form a sub-network of the ownership network. Remove all links coming back to $i$ (this is mathematically proven to be equivalent to the self-loop correction). Find the network value of this sub-network.\n    1. Run $(*)$ on OUT.\n    2. Run $(*)$ on all nodes in the SCC connected to OUT. Add the network values of those nodes to their intrinsic values $v$.\n    3. Run $(*)$ on the SCC.\n    4. **Root node correction**. **Do not** run $(*)$ on all nodes of IN directly connected to the SCC, but instead have their network values directly equal the weighted sum $\\sum_{j}W_{ij}v^{net}(j)$. Add the network values of those nodes to their intrinsic values $v$.\n    5. Run $(*)$ on IN.\n\n![alt text](assets/image-3.png)\n\n### <span style=\"background-color: #12ffd7; color: black;\">4.</span> Centrality and control\n- Integrated value and network value can be interpreted as measures of centrality, which is similarly defined recursively as \n$\\tilde{C} = W\\tilde{C} + C_0$. (Centrality of a node depends on centrality of nodes connected to it weighted by strength of connection, plus some intrinsic centrality $C_0$).\n\n- This improves upon the existing literature through $\\hat{v}$ and $\\bar{v}$, which solve self-loops and root node accumulation.\n\n- **Control** refers to a firm's voting rights over another firm in shareholder meetings. Let $C$ denote the control matrix $[C_{ij}]$, where $C_{ij}$ is the control of $i$ over $j$.  Several models of control were proposed:\n    - Direct equivalence: $W = C$ where $W$ is the adjacency matrix of the network. Essentially, ownership = control.\n    - Threshold model: if $W_{ij}$ exceeds a certain threshold (10%, 20%, 50$ etc.), $C_{ij} = 1$; otherwise it is 0.\n    - Degree of control: control should depend on how concentrated a firm's shareholders are. If one big shareholder, then that shareholder has all the control and all other firms have none; if many small shareholders, then even if $W_{ij}$ is small then it is possible to have a large amount of control. Thus define the H-index\n    $$\n    H_{j} = \\sum_{i} W_{ij}^2\n    $$\n    which measures the concentration of shareholders of firm $j$. \n- The paper proposes the new model $C_{ij}=\\frac{W_{ij}^2}{H_j}$, or the proportion of the control of $i$ over $j$ over total control. This has the benefits of:\n    - $C_{ij}$ sums to 1, allowing us to analyze it like an ownership matrix. \n    - Takes into account shareholder concentration.\n    - Easy to calculate.\n    - Can implement corrections $\\bar{C}$ and $\\hat{C}$ according to the above.\n- **Overall**:\n1. Analyze ownership network: adjacency matrix, find corrections -> gives information on flow of value.\n2. Analyze matrix of control.\n3. Analyze concentration of control using Lorenz curve.\n\n## Analogies to economic complexity\n- A striking analogy that can be made between the two models is their column-stochastic nature. The types of networks (and adjacency matrices) that the above models support are column-stochastic (rows sum to 1)\n    - $\\sum_j W_{ij} = 1$: proportions of shares that all firms own in $j$ sum to 1\n    - Perhaps similarities with $\\tilde{M}$ can be drawn?\n- Bipartite to monopartite conversion\n```mermaid\nflowchart TB\n  node_1((\"country\"))\n  node_2((\"country\"))\n  node_3((\"country\"))\n  node_4((\"good\"))\n  node_5((\"good\"))\n  node_6((\"good\"))\n  node_1 --> node_4\n  node_2 --> node_5\n  node_3 --> node_6\n  node_2 --> node_4\n  node_3 --> node_4\n  node_2 --> node_5\n  node_2 --> node_6\n```","n":0.031}}},{"i":66,"$":{"0":{"v":"Economic Complexity in Monopartite Networks","n":0.447}}},{"i":67,"$":{"0":{"v":"Ownership Networks","n":0.707},"1":{"v":"## Ownership networks\n- <span style=\"background-color: #ffb812; color: black;\">(Concept.)</span> Ownership networks:\n    - Graphs which illustrate the ownership of firms over other firms, using percentage of ownership as a metric\n    - <span style=\"background-color: #03cafc; color: black;\">(Definition).</span> Percentage of ownership = fraction of total shares that a shareholder owns of a firm\n        - Shareholders are either entities who cannot be owned (people, governments, legal entities) or corporations who themselves can be owned\n    - The Level 3 (most complete) representation of an ownership network is as follows:\n\n\n![alt text](assets/image.png)\n\n- $W_{ij}$ (arrow from firm $i$ to $j$): percentage ownership that firm $i$ has in $j$\n- $v_j$: a variable of the node $j$ representing the \"economic value\" of firm $j$ (e.g. market cap)\n- The adjacency matrix $W$ holds all such $W_{ij}$; it is column stochastic because $\\sum_{i=1} W_{ij}=1$ by definition (sum of percentage shares of all shareholders in firm $j$)\n\n## Models of ownership networks\n- <span style=\"background-color: #bc42f5; color: black;\">(Question).</span> Given a certain ownership network, what can be said about the distribution of control?\n    - The ownership network will have an associated adjacency matrix\n    - It may have cycles (i.e. $k$ owns parts of $l$ and also vice versa):\n    ![alt text](image-2.png)\n    - If there are no cycles, we can say that $W_{ik}$ (see (a)) is simply the product of the ownership of $i$ in the parent company $j$ and the ownership of $j$ in $k$: $W_{ik}=W_{ij} W_{jk}$.\n    - However, the presence of cycles makes this significantly more difficult\n    - <span style=\"background-color: #03cafc; color: black;\">(Definition).</span> *Direct ownership* is e.g. $i$ owning $j$ (two firms directly connected by an arrow), and *indirect ownership* is two firms not directly connected yet still linked (e.g. $A$ owns $B$ which owns $C$, so $A$ indirectly owns $C$)\n    - <span style=\"background-color: #03cafc; color: black;\">(Definition).</span> The *portfolio value* $p_i$ of a firm $i$ is the sum of the value of all the shares it owns: $p_i=\\sum_{j\\in\\Gamma(i)} W_{ij}v_j$, where $\\Gamma(i)$ is the set of all the neighbors of $i$\n        - Written in matrix form this is $\\mathbf{p=Wv}$.","n":0.055}}},{"i":68,"$":{"0":{"v":"Self-Loop Problem","n":0.707},"1":{"v":"## Self-loop problem and refinements for group ownership\n\n- <span style=\"background-color: #bc42f5; color: black;\">(Problem 1).</span> Self-loops.\n    - If firm $i$ owns shares in firm $j$ and firm $j$ also owns shares in firm $i$, a self-ownership loop is created: $i$ owns $j$ owns $i$ owns $j$ owns $i$...\n    - This creates a magnifying effect on the final group value because group value is defined recursively: $v^G=v+Wv^G$, and if a firm owns a large part of itself indirectly then its own group value will be added onto itself\n    - $v^G$ will often be much larger than $\\sum v_i$, the total inherent (market) value of the firms\n        - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>: self-loops overestimate the group values of strongly connected components (SCCs).\n    - This can be refined by looking at the scalar equation for the integrated ownership matrix:\n    $$\n    \\hat{W_{ij}}=W_{ij}+\\sum_{k}\\hat{W}_{ik}{W}_{kj}\n    $$\n    which leads to self-loops due to the term $\\hat{W}_{ii}W_{ij}$, where $\\hat{W}_{ii}$ indicates a firm's indirect ownership of itself. We simply remove this term from the equation:\n    \n    - <span style=\"background-color: #12ffd7; color: black;\">(Refinement 1.)</span> Simply write \n    $$\n    \\tilde{W_{ij}}=W_{ij}+\\sum_{k}\\hat{W}_{ik}{W}_{kj} -\\hat{W}_{ii}W_{ij}\n    $$\n    removing the self-looped term. \n    - (<span style=\"background-color: #12ffd7; color: black;\">Theorem</span>). In matrix notation, we write \n    $$\\hat{W}=W+\\hat{W}W-\\text{diag}(\\hat{W})W=(I-\\text{diag}(\\hat{W}))W+\\hat{W}W$$\n    where $\\text{diag}(\\hat{W})$ is the diagonal matrix\n    $$\n    \\begin{bmatrix}\n    \\hat{W_{11}} & 0 & ... & 0 \\\\\n    0 & \\hat{W_{22}} & ... & 0 \\\\\n    \\vdots & \\ddots & ... & \\vdots \\\\\n    0 & 0 & ... & \\hat{W_{nn}}\n    \\end{bmatrix}\n    $$\n    - (<span style=\"background-color: #1eff12; color: black;\">Proof</span>). This can be easily verified to be equivalent to the above refinement. \n    - Thus we have:\n    $$\n    (I-W)\\hat{W}=(I-\\text{diag}(\\hat{W}))W\n    $$\n    or, equivalently,\n    $$\n    (I-\\text{diag}(\\hat{W}))^{-1}\\hat{W}=W(I-W)^{-1}\n    $$\n    - (<span style=\"background-color: #12ffd7; color: black;\">Theorem</span>.) By Baldone et al. (1998), $\\hat{W}$ has solution\n    $$\n    \\hat{W} = \\text{diag}(V)^{-1}(V-I)\n    $$\n    where $V = (I-W)^{-1}$.\n\n    Continuing on the above, multiplying by $v$ on both sides to the right yields:\n    $$\n    \\begin{aligned}\n        (I-\\text{diag}(\\hat{W}))^{-1}\\hat{W}v\n        &=W(I-W)^{-1}v \\\\\n        &=Wv^G \\\\\n        &= v^G - v\n\n    \\end{aligned}\n    $$\n    arriving at\n    - (<span style=\"background-color: #12ffd7; color: black;\">Theorem</span>.) The group value $v^G$, under this refinement, can be found as $(I-\\text{diag}(\\hat{W}))^{-1}\\hat{W}v + v$. Equivalently, we can also write\n    $$\n    v^G=(I-\\text{diag}(\\hat{W}))^{-1}(\\hat{W}v+(I-\\text{diag}(\\hat{W}))v)\n    $$\n    which enables the equation for $v_k^G$, the group value of firm $k = 1, 2, ..., n$:\n    $$\n    v^G_k = \\frac{1}{1-\\hat{W_{kk}}}[(\\sum_{i=1}^n \\hat{W}_{ki}v_i) - \\hat{W}_{kk}v_k+v_k]\n    $$\n    $$ = \\frac{1}{1-\\hat{W_{kk}}}[(\\sum_{i=1, i\\neq k}^n \\hat{W}_{ki}v_i)+v_k]\n    $$\n    as the matrix $(I-\\text{diag}(\\hat{W}))$ is purely diagonal and has an inverse equal to the inverse of its entries. \n\n    - If $\\hat{W}_{kk}=0$, i.e. a firm does not own any shares in itself (some economists <span style=\"background-color: #ffb812; color: black;\">interpret</span> this as owning *treasury shares*), $v_k^G$ is simply $v_k$, the value of the firm, plus the value of other firms in the group weighted by their integrated ownership by firm $k$.\n    - If $\\hat{W}_{kk}> 0$, the group value is larger than simply the integrated ownership-weighted sum. \n    - This refinement is due to Baldone et al. (1998)\n- (<span style=\"background-color: #bc42f5; color: black;\">Drawbacks</span>.)\n    - The issue of self-loops are indeed correctly isolated by Baldone et al., but their modifications to the equation are mysterious ($\\text{diag}(\\hat{W})$ in particular).\n    - The above equation does not actually result in smaller group values if self-loops are present, as if $\\hat{W}_{kk}>0$ then $v_k^G$ still gets very large.\n    - The next section will propose a simpler modification to the model that bypasses the self-loop problem.","n":0.043}}},{"i":69,"$":{"0":{"v":"Network Value and Integrated Value","n":0.447},"1":{"v":"## Network value and integrated value\n- (<span style=\"background-color: #03cafc; color: black;\">Definition</span>.) **Integrated value**. Define the *integrated value* analogously to the *portfolio* value of a firm; recall that the portfolio value of firm $i$, $p_i$, is defined $p_i = \\sum_{j=1}^{n}W_{ij}v_j$, the sum of value of each other firm $j$ in the group multiplied by the percentage ownership of firm $i$ in that firm $j$.\n- **Integrated value** is simply the integrated ownership analogue to portfolio value: $\\nu_i$, the integrated value of firm $i$, is defined $\\nu_i = \\sum_{j=1}^{n}\\hat{W}_{ij}v_j$, based on the integrated ownership matrix rather than the direct ownership matrix\n- In matrix form, we have $\\nu_{int}=\\hat{W}v=(I-W)^{-1}Wv$.\n    - The integrated value is a Level 3 network measure: it fully considers both the connections between nodes (firm ownership) and the nodes themselves (the value of the firms)\n    - (<span style=\"background-color: #12ffd7; color: black;\">Theorem</span>.) $\\nu_{int}$ satisfies $\\nu_{int} = W\\nu_{int} + Wv$. \n    - (<span style=\"background-color: #1eff12; color: black;\">Proof</span>.) From the above equation, $(I-W)\\nu_{int}=Wv$ and thus $\\nu_{int}-W\\nu_{int}=Wv$, $\\nu_{int}=W\\nu_{int}+Wv$.\n    - This gives rise to the following scalar equation:\n    $$\n    \\nu^{int}_k=\\sum_{i=1}^n W_{ki}\\nu^{int}_{i} + \\sum_{i=1}^n W_{ki}v_{i}\n    $$\n    - The second term $\\sum_{i=1}^n W_{ki}v_{i}$ is simply the portfolio value of firm $k$.\n    - (<span style=\"background-color: #ffb812; color: black;\">Interpretation 1</span>.) The integrated value of firm $k$ is equal to the sum of the integrated value of other firms multiplied by the ownership of firm $k$ in these firms, plus the portfolio value of firm $k$.\n    - (<span style=\"background-color: #ffb812; color: black;\">Interpretation 2</span>.) The importance of node $k$ in the graph depends on the importance of its surrounding nodes and the strength of the connections between $k$ and these nodes, as well as the value of these nodes themselves.\n\n- (<span style=\"background-color: #03cafc; color: black;\">Definition</span>.) **Network value**. Network value is analogous to group value defined previously: \n$$\nv^{net} = Wv^{net} + v\n$$\nand hence\n$$\nv^{net}=(1-W)^{-1}v\n$$\n- (<span style=\"background-color: #ffb812; color: black;\">Interpretation</span>.) We can treat a firm's network value as the portfolio of its neighbors' network values, plus its own intrinsic value. \n- Network value satisfies $Wv^{net}=\\hat{W}v=\\nu^{int}$ as shown in the previous sections; as such $v^{net}=Wv^{net}+v=\\hat{W}v+v=\\nu^{int}+v$.\n- (<span style=\"background-color: #12ffd7; color: black;\">Theorem</span>.) The network value and integrated values are related to one another by\n$$\nv^{net} = \\nu^{int}+v\n$$\n- (<span style=\"background-color: #ffb812; color: black;\">Interpretation</span>.) The network value of a firm is its underlying value $v$ plus the value gained from its integrated value $\\nu^{int}$, which in turn is equal to the value gained from the underlying value of all firms reachable through indirect ownership.","n":0.05}}},{"i":70,"$":{"0":{"v":"Correction Operator","n":0.707},"1":{"v":"## Correction operator for group ownership model\n\n- (<span style=\"background-color: #03cafc; color: black;\">Definition</span>.) Define the *correction operator* $D$ as \n$$\nD = \\text{diag}((I-W)^{-1})^{-1}\n$$\n- This operator will be used to elaborate upon the correction to the self-loop problem proposed by Baldone et al. (1998)\n- As the inverse of a diagonal matrix is simply the inverse of each of its entries, $D$ itself is a diagonal matrix with\n$$\n\\begin{cases}\nD_{ij} = 0 \\text{ if}\\ i \\neq j \\\\\nD_{ii} = \\frac{1}{(I-W)^{-1}_{ii}}\n\\end{cases}\n$$\n- In \"Group Ownership Refinements\", it was proposed to simply remove the self-loop term: $\\hat{W}_{ij}=W_{ij}+(\\sum_{j=1}^{n}\\hat{W}_{ik}W_{kj})-\\hat{W}_{ii}W_{ij}$. In matrix form, this could be written $\\hat{W}=(I-\\text{diag}(\\hat{W}))W+\\hat{W}W$, or:\n$$\n(I-\\text{diag}(\\hat{W}))^{-1}\\hat{W}=W(I-W)^{-1}\n$$\n- It was proposed by Baldone et al. that $\\hat{W}$ has solution equal to \n$$\n\\hat{W} = \\text{diag}(V)^{-1}(V-I)\n$$\nwhere $V = (I-W)^{-1}$. We can thus also write $D = \\text{diag}(V)^{-1}$ according to the above <span style=\"background-color: #03cafc; color: black;\">definition.</span>\n- (<span style=\"background-color: #12ffd7; color: black;\">Lemma</span>.) $D$ can also be written $I - \\text{diag}(\\hat{W})$.\n- (<span style=\"background-color: #1eff12; color: black;\">Proof</span>.) Take the diagonal of both sides of the above equation, and use the identity $\\text{diag}(A+B)=\\text{diag}(A)+\\text{diag}(B)$:\n$$\n\\begin{aligned}\n\\text{diag}(\\hat{W})&=\\text{diag}(\\text{diag}(V)^{-1}(V-I)) \\\\\n&= \\text{diag}(V)^{-1}\\text{diag}(V-I) \\\\\n&= \\text{diag}(V)^{-1}(\\text{diag}(V)-I) \\\\\n&= I - \\text{diag}(V)^{-1} \\\\\n&= I - D\n\\end{aligned}\n$$\nand thus \n$$\nD = I - \\text{diag}(\\hat{W}).\n$$\n- Without this refinement, we defined $\\hat{W}=W(I-W)^{-1}$. \n- Thus, from\n$$\n(I-\\text{diag}(\\hat{W}))^{-1}\\hat{W}=W(I-W)^{-1}\n$$\n- We have $I - \\text{diag}(\\hat{W}) = D$ and $\\hat{W_{new}} = D\\hat{W_{old}}$. \n- <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. The correction proposed by Baldone et al. is simply equal to multiplying the ownership matrix by the correction operator $D$. \n- (<span style=\"background-color: #12ffd7; color: black;\">Theorem</span>.) As the integrated value $\\nu^{int}$ is defined $\\hat{W}v$, we simply have $\\nu^{int}_{corrected} = D\\nu^{int}$ as the corrected value. We also write the corrected network value as $v^{net}_{corrected}=Dv^{net}$, and furthermore $D(\\nu^{int}+v)=\\nu^{int}_{corrected}+Dv$ due to an above theorem.\n- (<span style=\"background-color: #12ffd7; color: black;\">Theorem</span>.) The corrected network value is $v^{net}_{corrected} = Dv^{net}$.\n- Thus, the correction operator allows us to multiply all of the network value $v^{net}_i$, the integrated portfolio value $\\nu^{int}_i$, and the underlying value $v_i$ by $D$.\n    - As $D$ is a diagonal matrix, these values are multiplied by $D_{ii}=1-\\hat{W}_{ii}$. This makes the self-loop correcting aspect quite intuitive.\n    ","n":0.055}}},{"i":71,"$":{"0":{"v":"Integrated Ownership","n":0.707},"1":{"v":"## Group ownership and integrated ownership model\n- <span style=\"background-color: #12ffd7; color: black;\">(Model).</span> Group ownership.\n- <span style=\"background-color: #03cafc; color: black;\">Definition</span> (Business group). Define entities in a *business group* as a group of firms which have cross-shareholdings with one another, i.e. they own each other: e.g. $A$ owns 10% of $B$, $B$ owns 10% of $C$, $C$ owns 20% of $A$.\n\n    - <span style=\"background-color: #03cafc; color: black;\">Definition.</span> (External shareholder) There will also be an *external shareholder*: a firm which has direct ownership over all the firms in the group, but is not owned by the group.\n    - <span style=\"background-color: #03cafc; color: black;\">Definition</span> (Intrinsic value). Let $\\mathbf{v}$ be the column vector denoting the *intrinsic value* (market cap, revenue, or some other metric) of each firm in the group\n    - Let $\\mathbf{d}$ be the row vector denoting the percentage of shares the external shareholder owns for each firm in the group, with portfolio value $p_{ext}=\\mathbf{dv}$\n    - <span style=\"background-color: #03cafc; color: black;\">Definition</span> (Group value). The *group value* vector is defined recursively as $\\mathbf{v^G} =\\mathbf{W^G v^G +v}$\n        - <span style=\"background-color: #ffb812; color: black;\">Interpretation:</span> the group value of a firm is its intrinsic value ($\\mathbf{v}$) plus the weighted sum of its ownership in other firms ($\\mathbf{W^G v^G}$)\n        - <span style=\"background-color: #12ffd7; color: black;\">(Theorem.)</span> Reorganizing gives the solution $v^G=(I-W^G)^{-1}v$. (1)\n        - We also have the group value of the external shareholder, $v^G_{ext}=v_{ext}+dv^G$ where $v_{ext}$ is the intrinsic value of the shareholder\n        - We write $v^G_{tot}$ to be the vector that comprises the group value of the shareholder and the group's firms: \n        $$v^G_{tot}=\\begin{pmatrix}v^G_{ext} \\\\ v^G\\end{pmatrix}$$\n        - <span style=\"background-color: #03cafc; color: black;\">Definition</span> (Integrated ownership). **Integrated ownership** refers to the sum of the direct and indirect ownership of a shareholder in a firm. \n        - For the external shareholder in this group, let the integrated ownership be $\\hat{d}$. Then we have $\\hat{d}=d+\\hat{d}W^G$, defined similarly as the group value vector\n            - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>: $d$ is the external ownership, and $\\hat{d} W^G$ is the internal ownership (the matrix $W^G$ representing the ownership of firms within the group, weighted by the internal ownership of the shareholder over the firms $\\hat{d}$)\n            - <span style=\"background-color: #12ffd7; color: black;\">(Theorem.)</span> Thus we also have $\\hat{d}=d(I-W^G)^{-1}$. (2)\n        - <span style=\"background-color: #12ffd7; color: black;\">(Theorem.)</span> $\\hat{d}v = dv^G$.\n            - <span style=\"background-color: #1eff12; color: black;\">(Proof).</span> $\\hat{d}v=d(1-W^G)^{-1}v=dv^G$ by (1) and (2).\n            - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>: Direct ownership portfolio of shareholder over group values = integrated ownership portfolio over underlying values\n        - A picture of the network this is describing:\n        ```mermaid\n        flowchart TB\n        node_1((\"Firm A\"))\n        node_3((\"Firm C\"))\n        node_4((\"Firm B\"))\n        node_2[\"Shareholder\"]\n        node_1 --> node_3\n        node_1 --> node_4\n        node_3 --> node_4\n        node_2 -.- node_1\n        node_2 -.- node_3\n        node_2 -.- node_4\n\n        ```\n        \n        - The issue is: this is not widely applicable - the shareholder could also be part of the group, e.g. Firm A might also own shares of the shareholder, etc.\n        - How do we generalize this model?\n","n":0.046}}},{"i":72,"$":{"0":{"v":"Generalized Group Ownership","n":0.577},"1":{"v":"## Generalized group ownership model\n- <span style=\"background-color: #12ffd7; color: black;\">(Model).</span> Generalized group ownership model.\n    - <span style=\"background-color: #bc42f5; color: black;\">(Generalization 1.)</span> formalizing the shareholder into the matrix equation\n        - If we include the shareholder in the adjacency matrix $W$, then $W$ can be expressed as\n        $$\\begin{bmatrix}0 & d_1 & d_2 & \\cdots & d_n\\\\\n        0 & W_{11} & W_{12} & \\cdots & W_{1n} \\\\\n        \\vdots  & W_{21} & \\ddots & \\cdots & W_{2n} \\\\\n        \\vdots & \\vdots & \\vdots & \\ddots & \\vdots \\\\\n        0 & W_{n1} & W_{n2} & \\cdots & W_{nn} \\end{bmatrix}$$\n        - The first column is entirely zero because it represents the ownership of the group of firms over the shareholder, which they do not own at all. The first column is $d_1, d_2, ... = d$, the row vector representing the ownership of the shareholder over the group.\n        - The remaining parts of the matrix remains the same as the original adjacency matrix $W^G$.\n        - Now $v$ also contains the value of the shareholder.\n        - This allows us to write directly: $v^G = (I-W)^{-1}v$ as before, except now the group value vector contains the group value of the shareholder.\n        - Generalizing (2) from above, we also have $\\hat{W}=W+\\hat{W}W$ where $\\hat{W}$ is the integrated ownership matrix of the shareholder plus every other firm.\n            - <span style=\"background-color: #ffb812; color: black;\">Interpretation:</span> in scalar form this can be written $\\hat{W_{ij}}=W_{ij}+\\sum_{k}W_{ik}\\hat{W}_{kj}$ - the integrated ownership of a firm is the direct ownership $W_{ij}$ plus the integrated ownership of every firm towards firm $j$, weighted by the directed ownership of firm $i$ towards those firms. \n            - <span style=\"background-color: #12ffd7; color: black;\">(Theorem.)</span> $\\hat{W}=W(1-W)^{-1}$. Perron-Frobenius theorem ensures this matrix inverse exists \n            - <span style=\"background-color: #12ffd7; color: black;\">(Theorem.)</span> $Wv^G=\\hat{W}v$ and thus $v^G = Wv^G+v=\\hat{W}v+v$.\n                - (<span style=\"background-color: #1eff12; color: black;\">Proof</span>.) $\\hat{W}v=W(1-W)^{-1}v=Wv^G$.\n                - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>: the group value weighted by the direct ownership percentages, $Wv^G$, is equal to the intrinsic value weighted by the integrated ownership percentages, $\\hat{W}v$.\n    - <span style=\"background-color: #bc42f5; color: black;\">(Generalization 2).</span> Integrating the shareholder into the business group.\n        - The shareholder may also be owned by a firm in the group, i.e. the shareholder may also be part of the group.\n        - Formally, this would mean that the first column of the adjacency matrix of the group is nonzero: in the following adjacency matrix of the group\n        $$\\begin{bmatrix}W_{11} & W_{12} & ... & W_{1n} \\\\\n        W_{21} & W_{22} & ... & W_{2n} \\\\\n        \\vdots & \\ddots & ... & \\vdots \\\\\n        W_{n1} & W_{n2} & ... & W_{nn} \\end{bmatrix}$$\n        The term $W_{ij}$ represents the direct ownership of firm $i$ in firm $j$, and if we take firm $1$ to be the shareholder, then all $W_{i1} \\neq 0$.\n    - This model faces a range of problems, as detailed in the following note.","n":0.046}}},{"i":73,"$":{"0":{"v":"Bowtie Problem","n":0.707},"1":{"v":"## Bowtie problem and refinements for group ownership\n- (<span style=\"background-color: #bc42f5; color: black;\">Problem 2</span>). The *bow-tie* problem. \n    - Consider this example of a network exhibiting a bow-tie topology:\n    ![alt text](assets/image-3.png)\n    - A SCC (strongly connected component) lays in the center, with firms closely interconnected with one another; two firms (1) and (6) are not part of the SCC and are only loosely connected to the SCC through a single connection\n    - Applying the group ownership model on this example demonstrates the bow-tie problem\n        - Suppose that the underlying value of each firm is 1: the column vector $v = (1,1,1,1,1,1)$.\n        - Using the ownership matrix given above, the uncorrected integrated value and network values are given to be\n        ![alt text](assets/image-4.png)\n        which are disproportionately high considering that the total underlying value of the network is $1+1+1+1+1+1=6$, but e.g. the network value of the 5th firm reaches 55, an order of magnitude larger.\n        - Introducing the correction operator![alt text](assets/image-5.png)\n        leads to the corrected integrated and network values\n        ![alt text](assets/image-6.png)\n        reduced by approx. one order of magnitude.\n    - The issue lies with firm 1: it is not part of the SCC and only owns a very small share in firm 2, as shown. However, the correction operator does not correct its values at all (because firm 1 is a *root node*, a node where there are no incoming connections) and thus the integrated value and network values of firm 1 are both the largest among the group after corrections\n        - The formula for integrated value means that as firm 1 owns a small share of firm 2 (part of the SCC), the integrated value of the entire SCC is added to firm 1\n    - This is clearly undesireable, as firm 1 is not very involved in the group and should not have this high of a network value","n":0.057}}},{"i":74,"$":{"0":{"v":"Flow in Ownership Networks","n":0.5},"1":{"v":"## Interpreting ownership networks as flow\n\n- (<span style=\"background-color: #bc42f5; color: black;\">Observation</span>.) A physical analogy for ownership networks: the network expresses flow.\n    - Suppose each node carries some volume of liquid $v_j$, and a connection between node $i$ and node $j$ $W_{ij}$ expresses a *flow* of liquid from $j$ to $i$; in particular, we define it as the fraction of liquid $v_j$ that flows to $i$ at any time\n    - <span style=\"background-color: #03cafc; color: black;\">Definition</span>. At every time step $t$, we can define $\\phi_i(t)$, the inflow of liquid to node $i$, as the following:\n    $$\n    \\phi_i(t)=\\sum_{j} W_{ij}(v_j + \\phi_j(t-1))\n    $$\n    or in matrix notation,\n    $$\n    \\phi(t) = W(v+\\phi(t-1))\n    $$\n    - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. The inflow of liquid to $i$ is the amount of liquid present in all the other nodes $j$ weighted by the percentage flow $W_{ij}$, plus the amount of liquid flowing into all other nodes $j$ in the last time-step weighted by $W_{ij}$.\n    - The steady-state solution for this system is $\\phi = W(v+\\phi)$, which has solution\n    $$\n    \\phi = (1-W)^{-1}Wv.\n    $$\n    - <span style=\"background-color: #bc42f5; color: black;\">Observation</span>. $\\phi = \\nu^{int}$, the integrated value of the system.\n    - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. The integrated value $\\nu^{int}=\\hat{W}v$ is an expression of how much a firm's ownership of other firms is worth; as such, it is also an expression of the flow of assets/stocks/value from all other firms to one firm.\n        - This can intuitively explain the bowtie problem present in systems like the following:\n        ![alt text](assets/image-3.png)\n        - Node 1 is a *root node*, meaning that it has only outgoing ownership connections and no incoming connections (it owns other firms, but no firm owns it). Thus, when considering this network from the perspective of flow, assets will flow *towards* Node 1 but not *away* from it. \n        - Eventually, assets will accumulate in Node 1, leading to an extremely large integrated value.\n        - This also explains the problem of *self-loops* and overestimation of integrated value in SCCs: the more self-loops that are present, the longer the assets will flow through the network\n        - This would be physically accurate behavior (i.e. if it was liquid and not cash flowing, accumulation at root nodes and self-loops would be deemed correct), but not economically accurate behavior\n    ","n":0.052}}},{"i":75,"$":{"0":{"v":"Algorithms for Bowtie Problem","n":0.5},"1":{"v":"- <span style=\"background-color: #bc42f5; color: black;\">Problem</span>: so far, we've observed the following two problems in the integrated ownership model -\n    1. SCCs lead to disproportionately high integrated values due to self-loops\n    2. Root nodes lead to accumulation of flow\n- The first problem was solved with the correction operator $D$ \n- Two adjustments can be made to the model to correct the second problem\n\n## Analytical solution to the bowtie problem\n- <span style=\"background-color: #03cafc; color: black;\">Definition</span>. Define the *bowtie-corrected integrated ownership matrix* as $\\bar{W}=W(\\hat{W}+D)$, where $\\hat{W}$ denotes the self-loop-corrected integrated ownership $\\hat{W}=D\\tilde{W}$. \n- <span style=\"background-color: #1eff12; color: black;\">Derivation</span>.  First, observe that because we defined the self-loop-corrected network value as $\\hat{v^{net}}=Dv^{net}$, we have the corrected integrated value\n$$\n\\hat{\\nu^{int}}=\\hat{W}v=D\\tilde{W}v=DWv^{net}\\neq  WDv^{net}\n$$\ndue to the non-commutativity of matrix multiplication. We previously noted that $v^{net}=\\nu^{int}+v$ and thus\n$$\n\\begin{aligned}\n\\hat{v}^{net} &= Dv^{net} \\\\\n&=D\\nu^{int}+Dv \\\\\n&=D\\tilde{W}v+Dv \\\\\n&=\\hat{W}v+Dv\n\\end{aligned}\n$$\nbut as $\\hat{W}v$ now no longer equals $W\\hat{v}^{net}$, we can now define an alternative correction to $v^{net}$, denoted $\\bar{v}^{net}$:\n$$\n\\begin{aligned}\n\\bar{v}^{net} &= WDv^{net} + Dv, \\text{ noting the change in order of $W$ and $D$}\\\\\n&= W\\hat{v}^{net}+Dv \\neq \\hat{v}^{net}\n\\end{aligned}\n$$\nUsing $\\hat{v}^{net}=D\\nu^{int}+Dv = D\\tilde{W}v+Dv$, we have\n$$\n\\begin{aligned}\n\\bar{v}^{net}&=WD\\tilde{W}v+WDv+Dv \\\\\n&=W(D\\tilde{W}v+Dv)+Dv \\\\\n&=W(\\hat{W}+D)v+Dv\n\\end{aligned}\n$$\nwhere $W(\\hat{W}+D)$ is defined as our **bowtie-corrected integrated ownership matrix** $\\bar{W}$, analogous to the presence of $\\hat{W}$ in $\\hat{v}^{net}$. \n\n## Summary of corrections\n\n- (<span style=\"background-color: #12ffd7; color: black;\">Theorem</span>.)\n1. The original network value $v^{net}$, integrated value $\\nu^{int}$, and integrated ownership matrix $\\tilde{W}$: $v^{net}=\\nu^{int}+v=\\tilde{W}v+v$\n2. The self-loop-corrected network value $\\hat{v}^{net}$, integrated value $\\hat{\\nu}^{int}$, and ownership matrix $\\hat{W}$: $\\hat{v}^{net} = \\hat{\\nu}^{int} + Dv = D\\tilde{W}v + Dv = \\hat{W}v + Dv$\n3. The bowtie-corrected network value $\\bar{v}^{net}$, integrated value $\\bar{\\nu}^{int}$, and ownership matrix $\\bar{W}$: $\\bar{v}^{net} = \\bar{\\nu}^{int} + Dv = \\bar{W}v + Dv\\ (=WDv^{net}+Dv)$.\n\n## Algorithmic implementation\n- The main issue with the above corrections is computational speed: matrix inversion has complexity $\\mathcal{O}(n^3)$, which can become infeasible when dealing with very large matrices (e.g. a network of all firms in a country)\n- An <span style=\"background-color: #12ffd7; color: black;\">algorithm</span> involving the following steps can be implemented to calculate network value for any given node $i$, through which integrated value can be easily found:\n1. Breadth-first search (BFS) is implemented on node $i$, returning a set of nodes that are reachable from node $i$ (in however many steps). Call this set $\\mathcal{S_i}$.\n2. $\\mathcal{S}$ represents a subnetwork of the original network; all nodes in this network are connected, directly or indirectly, to $i$. Without loss of generality, relabel the node $i$ to $1$, and the other nodes $2$, $3$, etc. Call the adjacency matrix derived from this subnetwork $B(i)$.\n3. Remove all the incoming links to $i$ such that now, no firm owns any shares in $i$. $B(i)$ now looks like this:\n$$\nB(i)=\\begin{bmatrix}\n0  & \\vec{d} \\\\\n\\vec{0} & B^{sub}\n\\end{bmatrix}\n$$\nwhere $\\vec{d}$ is the row matrix representing the ownership of firm 1 in other firms (its outgoing links), $B^{sub}$ is a matrix representing the adjacency network of the subnetwork aside from node $1$, and $\\vec{0}$ is the zero vector. The first column of this adjacency matrix is zero, because no firm owns shares in node $1$. \n4. Calculate the network value of the node $i$: by definition of network value, $v^{net} = W(I-W)^{-1}v$ where $v$ is the intrinsic value vector and $W$ is the adjacency matrix. Using $W = B(i)$ and $v = v^{sub}$ yields the network value.\n\n> (<span style=\"background-color: #12ffd7; color: black;\">Theorem</span>.) The operation of removing all incoming links to $i$ for the subnetwork represented by $B(i)$ is mathematically equivalent to performing the self-loop correction on $B(i)$: $\\hat{B(i)}=DB(i)$.\n\n> (<span style=\"background-color: #1eff12; color: black;\">Proof</span>.) Recall that the corrected integrated ownership matrix $\\hat{W}$ was defined in scalar form as:\n$$\n\\hat{W}_{ij}=W_{ij}+\\sum_{k\\neq i} \\hat{W}_{ik}W_{kj}\n$$\n> As the subnetwork with ownership matrix $B$ instead of $W$ preserves all the outgoing connections $W_{ik}$ of $i$ but removes all the incoming connections $W_{ki}$, $\\hat{B}_{ij}$ can no longer contain any self-loops; thus, $\\hat{B}_{ij}$ is equal to $\\hat{W}_{ij}$ with $\\hat{W}_{ii}$, the self-loop coomponent, removed. This leads to\n$$\n\\hat{B}=\\hat{W}-\\text{diag}(\\hat{W})\n$$\n> in matrix form, and with\n$$\nD = I - \\text{diag}(\\hat{W})\n$$\n> we have $\\hat{B} = D + \\hat{W} - I$. Thus $\\hat{B}v + v$, the network value of the subnetwork by definition, is equal to \n$$\nDv + \\hat{W}v - v + v = \\hat{W}v + Dv = \\hat{v}^{net}\n$$\n> which is the self-loop corrected network value for the original network.\n\n- **Correcting for bowtie structures**. \n\n- <span style=\"background-color: #03cafc; color: black;\">Definition</span>. **Three subsets of a bowtie-structured network**. A bowtie-structured network can be divided roughly into the following three subsets:\n1. $\\mathcal{O}$, the OUT subset, containing the labels of all nodes that are *leaf nodes* - that is, with only incoming connections and no outgoing connections.\n2. $\\mathcal{I}$, the IN subset, containing all *root nodes* - nodes that have outgoing connections and no incoming connections. As noted, these nodes are where integrated value aggregates erroneously.\n3. $\\mathcal{S}$, the SCC. We have all of $\\mathcal{O}, \\mathcal{I}, \\mathcal{S} \\subset \\mathcal{S_i}$, the subnetwork formed from breadth-first search on node $i$. We also have ${\\mathcal{O} \\cap \\mathcal{I}} = \\emptyset$.\n- We apply the algorithm detailed above to calculate $v^{net}$ in the following order:\n1. On $\\mathcal{O}$, all the nodes in the OUT subset.\n2. On $S_O$, all the nodes in the SCC that are directly connected to $\\mathcal{O}$. Calculate their network values by applying the algorithm above, or simply by $v^{net}(s) = \\sum_{o} W_{so}v^{net}(o)$ for $s\\in S_O$ and $o \\in \\mathcal{O}$ connected to node $s$: the network value of all the OUT nodes connected to $s$, weighted by the weight of the links $W_{so}$. This network value is added to the original intrinsic values of these nodes: $v_s \\to v^{net}(s) + v_s$.\n3. On the SCC itself $\\mathcal{S}$, not including any nodes in $\\mathcal{O}$ or $\\mathcal{I}$. Apply the algorithm above to find their network values $v^{net}$, taking into account that nodes within the SCC connected to $\\mathcal{O}$ had their intrinsic values modified as per above.\n4. On $S_I \\subset \\mathcal{I}$: the subset of the IN set that is directly connected to the SCC $\\mathcal{S}$. This is the subset that will be adjusted to correct for accumulation of flow. We directly set for all $s \\in S_I$: $v^{net}(s) = \\sum_{i} W_{si}v^{net}(i)$, ensuring that the network value of these IN nodes will not be the accumulated value of every node in the SCC, but rather, only the weighted sum of the values of the nodes they are connected to.\n5. On $\\mathcal{I}$, taking note to add the network values calculated in the previous step to the intrinsic value of the nodes.\n\n- For instance, the algorithm breaks down this network through the following steps:\n![alt text](assets/image-3.png)\n- $\\mathcal{I} = \\{1\\}$; $\\mathcal{O} = \\{6\\}$; $\\mathcal{S}=\\{2,3,4,5\\}$\n- Denote the vector of network values due to the algorithm above as $\\dot{v}^{net}$. We will also have $\\dot{\\nu}^{int}=\\dot{v}^{int}-v$.\n\n","n":0.031}}},{"i":76,"$":{"0":{"v":"Control in Networks","n":0.577}}},{"i":77,"$":{"0":{"v":"Models of Indirect Control","n":0.5},"1":{"v":"## Propagation of control in networks\n- Several models have been proposed to address how control propagates along a network, from one firm to another:\n    - <span style=\"background-color: #12ffd7; color: black;\">Model 1.</span> The *weakest link* model: if $A$ controls $x\\%$ of $B$, and $B$ controls $y\\%$ of $C$, then the control of $A$ over $C$ is given as $\\min(x,y)$. The intuition behind this is that if $x$ is the minimum, then another firm $D$ can gain more control of $C$ than $A$ by increasing its control of $B$ to more than $x\\%$; if $y$ is the minimum, then another firm can gain more control of $C$ by directly increasing its control of $C$ to more than $y\\%$.\n        - This model becomes problematic in larger ownership structures: if an ownership chain of 10 firms exists in the network, then simply taking the weakest link would severely overestimate the extent of control\n        - Furthermore, it is difficult to apply to recursive networks\n    - <span style=\"background-color: #12ffd7; color: black;\">Model 2.</span> The *integrated control* model: apply directly the formula for integrated control to ownership, with the integrated control matrix $\\tilde{C}$ being defined recursively as \n    $$\n    \\tilde{C} = C + C\\tilde{C}\n    $$\n    with solution\n    $$\n    \\tilde{C}=(I-C)^{-1}C\n    $$\n    <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. The formula above can be rewritten in scalar form as $\\tilde{C}_{ij}=C_{ij}+\\sum_{k}C_{ik}\\tilde{C}_{kj}$: the sum of direct control and the control of $i$ over firm $k$, multiplied by the indirect control of firm $k$ over $j$. This indicates that control is multiplicative: $i$ indirectly controls $j$ through the control of $i$ over an intermediate firm $k$ and the control of $k$ over $j$, or $C_{ij}=C_{ik}C_{kj}$.\n\n## The relative majority model\n\n- <span style=\"background-color: #12ffd7; color: black;\">Model</span>. The *relative majority* model of control.\n    - General problem plaguing above 2 models: ignores the possibility of *voting blocs*, or shareholders collaborating to form coalitions and gain more control\n    - Four ways to address this:\n        - *Fixed rule*: uses thresholds to analyze control over a firm. Classifies leading shareholder's control into categories.\n        - *H-index*: uses the index $\\sum_{i} W_{ij}^2$ to quantify how concentrated ownership over firm $j$ is.\n        - *Power indices*: game-theoretic indices that take into account optimal outcomes for each shareholdler to calculate whether they will form coalitions. Can be ambiguous, hard to calculate, and inextensible to integrated control.\n        - *Degree of control*: denoted by $\\alpha$. Basic idea is that the control of firm $i$ over $j$ depends not only on $W_{ij}$, but also on how dispersed the other $W_{kj}$ are (the H-index). Difficult to calculate for large shareholdings and also has a minimum value of $0.5$, which is incompatible with integrated ownership.\n    - Any new model of control should fulfill the following properties:\n        - Define a function $F(W_{ij})$ that maps ownership $W_{ij} \\in (0,1]$ to control $C_{ij} =F(W_{ij}) \\in (0,1]$. Both should be continuous variables.\n        - Extensible to integrated control and also fulfill $\\sum_{i} C_{ij} = \\sum_{i}F(W_{ij})=1$.\n        - Take into account coalitions/voting blocs and intuitively describe the notion of power.\n        - Be computable for large networks.\n    - <span style=\"background-color: #03cafc; color: black;\">Definition</span>. In-Degree and Out-Degree.\n        - **In-Degree**. A measure of the importance of incoming links to a node in a network. Traditionally, we define in-degree as simply the number of incoming links to a node, $k^{in}_j$; in weighted networks, however, we define\n        $$\n        s_j = \\frac{(\\sum_{i=1}^{k^{in}_j}W_{ij})^2}{\\sum_{i=1}^{k_{j}^{in}}W_{ij}^2}\n        $$\n        where the denominator corresponds to the H-index defined above. Thus, the *weighted in-degree* as defined above takes into account not only the number of connections, but how concentrated they are.\n        \n        - <span style=\"background-color: #bc42f5; color: black;\">Observation</span>. In an ownership network, the sum of the weights of the incoming connections $\\sum_{i=1}^{k_j^{in}} W_{ij}$ is equal to $1$ by definition. Thus the in-degree is simply the reciprocal of the H-index: $s_j=\\frac{1}{H_j}$. It measures how concentrated the control of firm $j$ is among shareholders.\n        - **Out-Degree**. For a given node $i$ and a destination node $j$, define the measure $H_{ij}$ as\n        $$\n        H_{ij} = \\frac{W_{ij}^2}{\\sum_{l=1}^{k_{j}^{in}}W_{;j}^2}\n        $$\n        where the denominator again corresponds to the H-index. Intuitively, $H_{ij}$ expresses the relative importance of the link $W_{ij}$ among all of the incoming links to $j$. If $H_{ij}$ is large, then $W_{ij}$ is an important (or relatively important) incoming link of $j$.\n        - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. In an ownership network, $H_{ij}$ represents the *fraction of control* firm $i$ has over firm $j$.\n        - <span style=\"background-color: #03cafc; color: black;\">Definition</span>. Define the **control index** of firm $i$ as \n        $$\n        h_i = \\sum_{j=1}^{h^{out}_i} H_{ij}\n        $$\n        the sum of the fractions of control of all firms $i$ owns shares in.\n\n## Re-interpreting as a new model of control\n\n- <span style=\"background-color: #12ffd7; color: black;\">Model</span>. The *relative majority* model of control simply equates control to the fraction of control above:\n$$\nC_{ij}=H_{ij}\n$$\n- Upon examination, this model satisfies several of the above outlined qualities:\n    - $\\sum_{i} H_{ij} = 1$, allowing us to use an integrated model. \n        - Corollary: If a shareholder gains control over a firm, other shareholders will lose control.\n        - $\\tilde{H}$ can be calculated without problems.\n    - Like $\\alpha$, the degree of control model, $H_{ij}$ takes into account the concentration of shareholder ownership by including the H-index in the denominator.\n        - The smaller the H-index is, the more dispersed the ownership of $j$; and the more dispersed the ownership of $j$, the more the probability that any one shareholder can attain control\n    - Power has a very intuitive definition under $H_{ij}$: the importance of a shareholder relative to all other shareholders.\n        - $s_j$ (the in-degree, defined above) is the extent to which a firm is controlled by other firms, while $h_j$ is the extent to which a firm controls other firms.\n    - Note that this is a Level 2 measure in graph-theoretic terms: it considers the connections between nodes but not the intrinsic value of nodes themselves\n\n> This could potentially be relevant in the context of row-stochastic matrices in economic complexity!\n\n- <span style=\"background-color: #03cafc; color: black;\">Definition</span>. Define *integrated control*, $\\xi^{int}$, in the context of this model analogously to integrated value: \n$$\n\\tilde{\\xi}^{int} = \\tilde{C}v\n$$\nrepresenting the vector that holds the economic value controlled by each firm. Define $\\bar{\\xi}^{int}$, $\\tilde{\\xi^{int}}$ and $\\dot{\\xi^{int}}$ analogously to $\\bar{\\nu}^{int}$, $\\tilde{\\nu}^{int}$ and $\\dot{\\nu}^{int}$: in other words, as the control matrix proposed by the above model $C = H$ is row-stochastic, it can be subjected to every corrective models proposed in the Ownership Networks section.\n\n- Note that integrated control is a Level 3 measure; it combines relative majority control, a Level 2 measure determined by the weights of the links, with intrinsic value, a Level 3 measure determined by the weights of the nodes\n\n- <span style=\"background-color: #03cafc; color: black;\">Definition</span>. Define analogously the notion of *network control*, $c^{net} = \\xi^{int} + v$:  the total economic value a firm controls in the network, resulting from a combination of its own value ($v$) and its integrated control ($\\xi^{int}$). $\\bar{c}^{net}$, $\\dot{c}^{net}$ and $\\tilde{c}^{net}$ can be substituted accordingly.\n\n    - We want to answer two questions: (1) which firms are the most important actors in the network in terms of control, and (2) how is control distributed in the network?\n\n\n\n","n":0.029}}},{"i":78,"$":{"0":{"v":"Models of Control","n":0.577},"1":{"v":"## Control in ownership networks\n- How do we interpret control in ownership networks?\n- <span style=\"background-color: #03cafc; color: black;\">Definition</span>. While *ownership* is an objective quantity referring to the percentage of shares in another firm a firm owns, *control* is a subjective measure of the influence a firm has over another firm.\n    - This is typically understood in terms of *voting rights*: a firm owning shares to another firm represents ownership of *cash-flow rights*, which translates into the right to vote at shareholder meetings\n    - The relationship between cash-flow rights and voting rights is key to understanding control in ownership networks\n- <span style=\"background-color: #12ffd7; color: black;\">Model</span>. The *flow of control* model.\n    - Existing literature refers primarily to *direct control*: control derived from a firm directly owning shares in another firm\n    - This model will provide an analogy to integrated ownership and introduce the notions of *integrated control*, which not only take indirect ownership into account but also represent the *flow of control* (see \"Flow in Ownership Networks\")\n    - All the following proposed models seek to transform the ownership matrix $W$ via some equation into the control matrix $C$:\n    $$\n    W \\to C\n    $$\n- <span style=\"background-color: #12ffd7; color: black;\">Model 1</span>. \"One-Share-One-Vote\" Rule. According to this model, share ownership is directly proportional to voting rights; we simply have\n$$\nW_{ij} = C_{ij}\n$$\n- <span style=\"background-color: #12ffd7; color: black;\">Model 2</span>. Threshold model. \n    - If a firm is the majority shareholder of another firm, one would expect it to hold a monopoly on voting decisions; it holds all the control, while other shareholders hold none\n    - Define a *threshold* $\\theta$ such that if $W_{ij} > \\theta$, $i$ is deemed to hold all the control over $j$: $C_{ij} = 1$.\n    - This threshold has been varyingly set to 50% (more conservatively), or 10%, or 20% (more loosely)\n    - However, if no firm exceeds this threshold, then no shareholder holds absolute control\n    - Thus we have:\n    $$\n    \\begin{cases}\n    C_{ij} = 1,\\ W_{ij} > \\theta \\\\\n    C_{ij} = 0,\\ W_{ij} < \\theta \\text{ and } W_{kj} > \\theta \\text{ for some other firm $k$} \\\\\n    C_{ij} = W_{ij} \\text{ otherwise}\n    \\end{cases}\n    $$\n    - Essentially:\n        - If a firm's ownership exceeds a threshold, it has complete control (1)\n        - If it does not exceed the threshold and another firm exceeds the threshold, it has no control at all (0)\n        - Otherwise, if no firms exceed the threshold, all firms have some control proportional to their ownership (as in Model 1).\n- <span style=\"background-color: #03cafc; color: black;\">Definition</span>. Define the *control value* of a firm $i$ in the ownership value, $c_{i}$, as\n$$\nc_i = \\sum_{j} c_{ij}v_j\n$$\nthe weighted sum of the value of the firms $i$ owns shares in, weighted by the control of $i$ over them. This provides a measure of the amount of economic value controlled by $i$.\n\n","n":0.046}}},{"i":79,"$":{"0":{"v":"Distribution of Control","n":0.577},"1":{"v":"## Concentration of control in networks\n- <span style=\"background-color: #12ffd7; color: black;\">Model</span>. Generalized concentration model.\n    - Suppose a population has $N$ members, each with a wealth $X_i$ ($i=1,2,...,N$)\n    - Each $X_i$ is randomly distributed with an arbitrary distribution (e.g. $X_i\\sim N(\\mu,\\sigma^2)$)\n    - Denote the total wealth as $X_{tot}=\\sum_{i}^{N}X_i$\n    - Without loss of generality, sort the population data so that $X_1 > X_2 > ... > X_N$\n    - Thus define a **cumulative concentration curve** of the population $(\\eta(n), \\theta(n))$ such that:\n    $$\n    \\begin{cases}\n    \\eta(n) = \\frac{n}{N} \\\\\n    \\theta(n) = \\frac{\\sum_{i=1}^{n} X_i}{X_{tot}}\n    \\end{cases}\n    $$\n    - <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. $\\eta(n)$ is the proportion of the population that the first $n$ people occupy, while $\\theta(n)$ is the proportion of the total wealth that the first $n$ people hold.\n        - The above defines a Lorenz curve in economics, a measure of wealth inequality\n    - This can be generalized to any distribution for $X$, and any variable (e.g. ownership or control)\n\n> Fin!","n":0.08}}},{"i":80,"$":{"0":{"v":"Centrality in Networks","n":0.577},"1":{"v":"## Interpreting group ownership model as centrality\n- <span style=\"background-color: #03cafc; color: black;\">Definition</span>. *Centrality* is a notion in network analysis that refers to the importance of a node, which can be defined in several ways:\n1. *Recursive centrality*. We expect the centrality (importance) of a node to depend on the importance of the nodes it is connected to; as such, we have\n$$\nc_i = \\sum_{j}A_{ij}c_j\n$$\nwhere $A$ is some adjacency matrix for the network. Alternatively, we can write this in matrix form as \n$$\nc = Ac\n$$\n<span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. $c$ is an eigenvector of $A$ with corresponding eigenvalue $\\lambda = 1$: $\\lambda c = Ac$.\n\n2. *Bonacich eigenvector centrality*. Using the eigenvector equation $\\lambda c = Ac$, we have\n$$\nc_i = \\frac{1}{\\lambda}\\sum_{j}A_{ij} c_j\n$$\nwith solution\n$$\nc=(\\lambda  I - A)^{-1}e\n$$\nwhere $e$ is a column vector of ones.\n\n3. *Hubbell index*. In addition to the above definition $c = Ac$, we also assume that each node has an intrinsic importance denoted by the vector $c^0$, yielding\n$$\nc^H = Ac^H + c^0\n$$\nwhere $c^H$ is the Hubbell index. We can also generalize the above two indices to yield the *$c(\\alpha, \\beta)$*-centrality measure:\n$$\nc(\\alpha, \\beta)=\\sum_{j} (\\alpha + \\beta c_{ij})A_{ij}\n$$\n<span style=\"background-color: #bc42f5; color: black;\">Observation</span>. The definition of the Hubbell index is identical to the definition of network value $v^{net}$ in a group ownership network:\n$$\nv^{net} = Wv^{net} + v\n$$\nreplacing $c^H$ with $v^{net}$ and the intrinsic importance $c^0$ with the intrinsic value of firms $v$. \n\n- <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. The indices $\\nu^{int}$ and $v^{net}$ - integrated value and network value, respectively - are measures of centrality for a group ownership network; $\\nu^{int}$ takes into consideration the importance of a firm's connected firms, while $v^{net} = \\nu^{int} + v$ takes into account the intrinsic value in addition.\n- <span style=\"background-color: #12ffd7; color: black;\">Model</span>. For a group ownership network, we have $\\bar{v}^{net}$ and $\\bar{\\nu}^{int}$ as metrics of centrality that correct for the excessive importance bestowed upon firms due to self-loops and the accumulation of importance towards root nodes.\n\n\n","n":0.056}}},{"i":81,"$":{"0":{"v":"Crisis Propagation","n":0.707},"1":{"v":"Papers related to crisis propagation in the WTN.","n":0.354}}},{"i":82,"$":{"0":{"v":"Warning Signals for Crises","n":0.5},"1":{"v":"\n\n### Saracco et al., 2016","n":0.447}}},{"i":83,"$":{"0":{"v":"Topology and Crisis Propagation","n":0.5},"1":{"v":"### Lee et al., 2011","n":0.447}}},{"i":84,"$":{"0":{"v":"Structure and Response in the WTN","n":0.408},"1":{"v":"### He and Deem\n\nThe WTN exhibits a modular/hierarchical structure that has become less clustered over time as a result of globalization, measured through the **cophenetic correlation coefficient** (CCC). In the past 40 years, the authors demonstrate the following results: (1) the WTN's decreasing hierarchy leads to more sensitivity to recessionary shocks, and (2) the hierarchy of the WTN increases as a response to these shocks.\n\n****\n\n## Literature review\n\n- Evolving systems like the WTN tend to settle into **modular structures** (i.e. modules which are highly clustered) - Sun and Deem 2007\n    - The speed of such a state being reached depends on three factors:\n        1. The network being a \"glassy landscape\" (i.e. slow to respond to change due to network complexity)\n        2. The network experiencing outside change\n        3. The network's agents (countries) exchanging information\n    - The WTN satisfies all of the above\n- **Hypothesis.** More modular structure increases resistance to recessions; weaker modular structure (due to globalization) reduces resistance to recessions\n\n## Methods\n\n\n- Comtrade UN trade data from 1962 to 2007\n- Nodes = countries, links = trade value (not scaled by GDP)\n-  A **distance matrix** for the WTN is calculated by $d_{ij} = \\max(M_{ij}) - M_{ij}$ i.e. minimum distance for closest trade link. \n\n> <span style=\"background-color: #12ffd7; color: black;\">Model</span>.  **Average linkage hierarchical clustering algorithm**. For a distance matrix $D$, the clustering algorithm depends on the metric\n\n$$\nL(r,s)= \\frac{1}{n_r n_s} \\sum_{i \\in r}\\sum_{i \\in s} D_{ij}\n$$\n> i.e. the pairwise distance between points in the clusters $r$ and $s$, averaged across the number of pairs. The algorithm is as follows:\n\n1. Take all the nodes in the WTN. Find the pair with the smallest pairwise distance.\n2. The above pair of nodes are merged, and beccomes a new \"node\" (cluster).\n3. Repeat step 1 and 2 until all pairs are found.\n\nRepeat until all pairs are found. This creates a \"hierarchy\" of nodes (lowest layer = size-2 clusters, highest layer = size-$N$ clusters with $N$ being the number of nodes). \n\nUsing this hierarchy, a **cophenetic matrix** $C$ is found where $c_{ij}$ is the height/layer of the hierarchy diagram (treelike dendrogram) where $i$ and $j$ are merged together. For instance, if China and the US are merged on the first step, then their cophenetic distance is 1. This matrix will be lower triangular.\n\nFinally, a **cophenetic correlation coefficient** (CCC) is calculated representing how closely the cophenetic distance matrix and the actual distance matrix match:\n\n$$\nCCC = \\frac{\\sum_{i < j} (d_{ij}-\\bar{d})(c_{ij}-\\bar{c})}{\\sqrt{\\sum_{i<j} (d_{ij}-\\bar{d})^2 \\sum_{i<j} (c_{ij}-\\bar{c})^2}}\n$$\nwhere $\\bar{c}, \\bar{d}$ are the average cophenetic distance and actual distances. Hierarchical datasets have a high CCC while non-hierarchical datasets have lower CCC.\n\n## Results\n\n- World trade divided into continental modules\n\n![alt text](image-2.png)\n\n- Globalization has decreased the hierarchical nature of the WTN\n\n![alt text](image-1.png)\n\n- Years of recession increase the CCC (e.g. 2000); marked with red bars\n    - Recessions promote trade protectionism and regional integration\n    - Free trade promotes globalization and decreases hierarchy\n- CCC increased in all 7 recessions from 1980 to 2007; trade to GDP ratio not as affected, showing that recessions cause a reduction in CCC and not the trade to GDP ratio (trade openness)\n- Decreases in hierarchy due to globalization weakens the WTN to shocks\n    - Ratio of world GDP decrease to US GDP decrease in financial crisis negatively correlated with CCC: world less hierarchical -> world more impacted by financial recessions in the US\n- Dynamical model of recession spread confirms increased sensitivity due to globalization\n    - Recession assumed to start in the US\n    - For each country $i$, its GDP at time $t$ is denoted $Y_i (t)$; the exports of country $i$ to country $j$ as $X_{ij}(t)$; the total exports of $i$ as $X_{i}(t)$\n    - $Y_i(t+1)$ is updated by $Y_i(t+1) = Y_i(t) + P_i(\\frac{X_{i}(t)-X_{i}(t-1)}{X_i(t-1)})$, where $P_i$ is the export to GDP ratio of country $i$; i.e. new GDP = old GDP + export-to-GDP ratio times rate of change of exports\n    - $X_{ij}(t+1)$ is updated by $X_{ij}(t+1) = X_{ij}(t) (\\frac{Y_i(t+1)}{Y_i(t)})$, i.e. old exports times rate of change of GDP\n    - The model converges to a steady state\n    - Impact of recession in 2006 found to be 6 times greater than impact in 1968\n    - Recovery from recession slower when hierarchy is lower\n","n":0.038}}},{"i":85,"$":{"0":{"v":"Spillover Effect","n":0.707},"1":{"v":"\n\n### Cao et al., 2020","n":0.447}}},{"i":86,"$":{"0":{"v":"Robustness","n":1},"1":{"v":"### Zhou et al., 2018","n":0.447}}},{"i":87,"$":{"0":{"v":"Multiplex Cascading Failure","n":0.577},"1":{"v":"### Lee and Goh","n":0.5}}},{"i":88,"$":{"0":{"v":"Global Value-Added Trade and Risk Transmis","n":0.408},"1":{"v":"### Ge and Yang","n":0.5}}},{"i":89,"$":{"0":{"v":"Financial Contagion in the WTN","n":0.447},"1":{"v":"### Kali and Reyes\n\nThe authors find that a country's position and degree of integration in the WTN can explain the magnitude to which financial crises beginning in that country affect other countries; in short, a network approach based on the WTN offers a good explanation for financial contagion.\n\n## Literature review\n\n- Does integration into the WTN make a country more vulnerable to economic crises?\n    - Having more trading partners increases both the channels through which a crisis can reach the country, and the chance for the country to find alternative trade partners to minimize the crisis\n- Globalization has led to country-specific events having international consequences; even in small countries, crises can have global impacts that leave some other countries extremely affected and others not affected at all\n- Focus needs to turn from bilateral trade to the entire network of trade, enabled by complex network advances by Albert and Barabasi (2002) and Newman (2003); take the WTN as the backbone for representing not only flow of goods, but financial flows as well, e.g. credit, bank loans, speculation\n- Trade linkages vs. financial flows?\n    - Kaminsky and Reinhart, 2000, 2003; Bae, Karolyi and Stulz, 2003 emphasize financial flows in crisis propagation\n    - Forbes, 2001; Forbes and Rigobon, 2001; Claessens and Forbes, 2001; Abeysinghe and Forbes, 2002 stress trade linkages\n    - Empirical evidence: little direct trade between Russia and Brazil, yet Brazil impacted by Russian crisis in 1998; Argentina affected by Brazil devaluation in 1999 due to Argentina being a major trade partner\n    - Difficult to separate the two; however, trade can be itself separated into different channels that affect crisis propagation differently - \n        - *Competitive effect* - changes in relative prices due to a crisis affects domestic firms' competitiveness abroad\n        - *Income effect* - crisis affects incomes which affect purchasing power\n        - *Cheap-import effect* - crisis reduces import prices for partners importing from country where crisis started, leading to a positive supply shock\n    - Forbes and Chinn 2003 find that trade is the strongest determinant for cross-country linkages in stock and bond markets\n    - Forbes and Abeysinghe 2002 find that even small trade links can have profound effects on crisis propagation due to multiplier eeffects\n- Not yet considered is the presence of intermediary partners, i.e. indirect trade flows: if $A$, $B$ and $C$ form a trade triangle, then any crisis in $A$ will loop through the entire triangle through interdependent \"second-order\" effects\n    - $A$ defaults -> $A$ can no longer supply needed goods to $B$ and $C$ -> $B$ defaults -> $B$ and $C$ are trading partners so $C$ is also affected -> $A$ is trading partners with $C$ so $A$ is affected more\n- However, these second-order effects can also dampen shocks: if $A$ is connected to both $B$ and $C$, then the effect of the crisis is spread between $B$ and $C$\n\n    \n## Methods\n\n- Consider a binary network (threshold-based): $A_{ij} = 1$ if exports from $i$ to $j$ is above a certain share of $i$'s total exports; use different thresholds to test for robustness\n    - An alternative link construction is considered: exports of $i$ to $j$ divided by GDP of $i$\n- Consider country-level \"integration\" into the WTN:\n    - Degree centrality\n        - Top countries (South Korea, Russia, Brazil etc.) are also epicenters of recent crises\n    - Node importance (eigenvector centrality)\n        - Exactly the same as network value presented in [[International Trade Network.Decoding Complexity - Glattfelder]]!\n        $$\n        v^{net} = Dv^{net} + v\n        $$\n        where $D$ is a matrix of dependencies (can be weights or alternatively defined; adjusted for robustness) and $v$ is intrinsic value of the country\n        - Again, top-ranked countries are epicenters of major crises\n    - Maximum flow (number of paths, direct and indirect, from a country to another country)\n        - Successfully indicates countries most affected by Thai currency crisis (Brazil, Indonesia, Korea, Russia)\n        - Drawback: not distance-weighted (a direct path is as important as a path of length $n$)\n\n### Stock market analysis\n- Data: NBER-UN world trade database, 1992-2000.\n- Thresholds used for binary matrix are 0, 1, and 2%; 92% of trade links in 2000 are between 0 and 2%\n- Non-overlapping windows considered (i.e. the next crisis is not affected by the first), as in Rigobon 2003 and Glick and Rose 1998: Mexican crisis 1994-95, Asian crisis 1997-98, Russian crisis 1998-99\n- Empirical evidence for windows based on tranquility before window -> volatility after window\n    - Use \"exchange-market pressure index\" (Forbes, 2003) based on variations of exchange rate, interest rates, and international currency reserves\n    - A timeframe is identified as a crisis if the index is five, three, or 1.5 times the st. dev. away from the mean\n- Rigobon (2003) traces each crisis window to an epicenter country: first $\\mu + 5\\sigma$ country after a tranquil window\n- Econometric model used is\n    $$\n    SMR_{i,w} = \\beta_1 NIC_{i,w} + \\beta_2 NIEC_w + \\sum_{k=1}^K \\gamma_k Z_{k,i,w} + \\epsilon_{i,w}\n    $$\n    where $SMR$ is the stock market performance indicator for country $i$ during crisis window $w$, $\\beta_1, \\beta_2, \\gamma$ are parameters to be found by OLS, $NIC_{i,w}$ is a **network indicator** for country $i$ (e.g. centrality) in this window, $NIEC_{w}$ is the **network indicator** for the **epicenter country** during window $w$, and $Z_{k,i,w}$ are $k$ control variables (standard macroeconomic variables of currency, banking, and financial crises).\n    - Control variables: bank reserves to assets ratio, inflation rate in CPI, GDP growth rate, current account balance, govt. expenditures, govt. budget balance, private capital flows, trade as percentage of GDP\n\n- $\\epsilon$ is a control variable for trade between country $i$ and epicenter country -> isolates network effects from direct effect of trade with epicenter\n\n- $SMR$ (stock market indicator) calculated by considering deviation of weekly stock market return during crisis window $w$ from non-crisis average returns from Jan 1992 to Dec 1994 (last month before Mexican crisis)\n    - This timeframe is characterized by stable macroeconomic conditions around the world\n    - Robustness test involves different window of returns\n- Dependency matrix defined either as exports from $i$ to $j$ as a share of total exports of $i$ (cash-flow dependency) or exports from $i$ to $j$ as a share of the GDP of $i$ (how much the total output of $i$ depends on $j$).\n\n## Results\n\n- Node importance (vector centrality) -> intrinsic value taken as world trade share of country $i$ (case 1) and degree centrality of country $i$ (case 2)\n- Epicenter network indicators statistically significant; all negative (epicenter strongly integrated -> crisis has more significant effect)\n    - 1 st.dev. increase in epicenter importance leads to 0.19 increase in abnormal stock returns\n- Country network indicators positively affect crisis mitigation; well-integrated countries can avert crises better\n- Crisis windows exceed 10 weeks on average; the cumulative effects of these indicators are substantial\n- Maximum flow metrics lead to the following model:\n$$\n SMR_{i,w} = \\beta_1 Maxflow(\\text{epicenter to $i$}) + \\sum_{k=1}^K \\gamma_k Z_{k,i,w} + \\epsilon_{i,w}\n$$\nwhere a one st. dev. increase in maximum flow leads to a 0.075% reduction in stock market returns (signs coincide with other network indicators, but with lower magnitude).\n\n","n":0.029}}},{"i":90,"$":{"0":{"v":"COVID-19 and Shocks","n":0.577},"1":{"v":"\n\n### Vidya et al., 2022","n":0.447}}},{"i":91,"$":{"0":{"v":"COVID-19 Diffusion","n":0.707},"1":{"v":"\n\n### Antonietti et al., 2022","n":0.447}}},{"i":92,"$":{"0":{"v":"Bootstrap Percolation and Attack","n":0.5},"1":{"v":"### Fan et al.\n\nSix different centrality measures are used to describe the relative importance of countries in the WTN. Countries are grouped into three different communities. The EU is considered as a standalone vertex and found to be the most important trading partner in the world. A method of **bootstrap percolations** is used to measure the impact of a country suffering a trade crisis on the rest of the WTN.\n\n****\n\n### Literature review\n\n- The first studies of the WTN used a simple binary adjacency matrix (1 if trade exists, 0 otherwise). See *Topology of the World Trade Network*. \n- Later studies found that the WTN is approximately symmetrical and uses a symmetrized export-volume weighted adjacency matrix \n- Weighted WTN less disassortative than unweighted, node strength distribution right-skewed (few big hubs), power-law correlation between trade strength and GDP\n- Formation of *trade islands* studied through community structures; mixed evidence for globalization\n- **Robustness** of the WTN has been investigated, i.e. how sensitive the stability of the system is to shocks to one country; this has been investigated through **extinction analysis**\n    - Crisis amplified if the country experiencing a shock is more integrated into the WTN; not dependent on GDP/size, but on position in network\n\n### Adjacency matrix used\n\n$$\nw_{ij} = \\tilde{w}_{ij} + \\tilde{w}_{ji}\n$$\n\nwhere $\\tilde{w}_{ij}$ is the proportion of country $i$'s exports to country $j$ to **total international trade volume**. $w$ is thus a symmetrical adjacency matrix.\n\n### Network properties\n\n- 183 vertices, 20051 links (2010 WTN)\n- Small-world property, 0.05 higher clustering coefficient than previous studies\n- Disassortativity; unweighted network more disassortative than weighted network\n- WTN has **core-periphery** (bowtie) structure\n\n### Community structures (clustering)\n\n> <span style=\"background-color: #03cafc; color: black;\">Definition</span>. **Modularity** is the metric most clustering algorithms seek to optimize, and is defined as\n$$\nQ = \\frac{1}{2w}\\sum_{i,j} (w_{ij}-\\frac{w_i w_j}{2w})\\delta_{c_i, c_j}\n$$\n> where $w$ is half the total link weight of the network, $w_i$ and $w_j$ are the **node strengths** of $i$ and $j$ (sum of weights attached to $i$ and $j$), $w_{ij}$ is the link weight from $i$ to $j$, and $c_i$, $c_j$ are the **communities** assigned to $i$ and $j$.\n\n> <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. $Q$ is the difference between the actual weight $w_{ij}$ minus its expected value, averaged across all the weights; this difference is taken account if $i$ and $j$ are from the same community, and not taken account if from different communities (per the delta function).\n\n> <span style=\"background-color: #bc42f5; color: black;\">Method</span>. This paper contributes the **weighted extremal optimization** (WEO) algorithm for optimizing modularity. Define the **modularity contribution** of a node $i$ as\n$$\nq_i = w_{r(i)} - w_i a_{r(i)}\n$$\n> where $w_{r(i)}$ is the sum of the weights of all links to nodes connected to $i$, and in the same community as $i$; and $a_{r(i)}$ is the expected value of a link in that community. We thus write $Q = \\frac{1}{2w}\\sum_{i}q_i$. Define **node fitness** of $i$, $\\lambda_i$, as $\\frac{q_i}{w_i}$; this is a normalization step such that the fitness value is between $-1$ and $1$. The WEO proceeds as follows:\n\n1. Randomly divide graph into two equally sized communities.\n2. Identify the node with the lowest fitness and move it to the other community. \n3. Re-calculate fitness for all nodes.\n4. Repeat steps 2 and 3 until a maximum for $Q$ is reached.\n5. Repeat the above to divide into more communities, until an absolute maximum for $Q$ is found.\n\n> To escape from local maxima, the WEO algorithm does not select the absolute lowest-fitness node at every time-step, but instead selects nodes with probability\n$$\nP(q) \\propto q^{-\\tau}\n$$\n> where $q$ is the rank of the node (lowest fitness = rank 1) and $\\tau$ is a constant on the order $1 + \\frac{1}{\\ln N}$ where $N$ is the total number of nodes. This is such that lowest-fitness nodes are more probably chosen, but not with certainty.\n\n\n> <span style=\"background-color: #12ffd7; color: black;\">Results</span>.\n\n1. The WTN can be split into three parts: left, middle, right.\n    - The left community is led by the US, and contains almost all countries in North and South America, and several other developing countries such as Nigeria, Congo, Israel and Afghanistan.\n    - The right community is led by Japan and China, and contains Asia and East Africa.\n    - The middle community is led by the UK and Germany, and contains Europe.\n- The middle community is more clustered and has more nodes (72), vs. 42 nodes in the left and 69 in the right.\n- Trade flows between communities make up 35.7% of all trade.\n- All communities also exhibit their own core-periphery structures.\n\n****\n\n### Node centrality methods\n\n> <span style=\"background-color: #bc42f5; color: black;\">Method</span>. This paper presents six methods of observing node centralities for a node $i$:\n\n1. **Degree centrality** $k_i$. $k_i = \\sum_{j} \\frac{A_{ij}}{N-1}$, where $A_{ij}$ is 1 if $i$ is connected to $j$ and 0 if not and $N$ is the total number of nodes.\n\n    > <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. Degree centrality is simply the out-degree of the node normalized by the maximum possible out-degree $N-1$.\n\n2. **Strength centrality** $S_i$. $S_i = \\sum_{j}w_{ij}$ where $w_{ij}$ is now the weight of the outgoing links. \n    > <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. As $w_{ij}$ is now defined as the share of the export link $ij$ in the entire world market, strength centrality measures the share of $i$ in total exports.\n\n3. **Closeness centrality** $C_i = \\frac{N-1}{\\sum_{j=1}^N d_{ij}}$ where $d_{ij}$ is the distance between nodes $i$ and $j$. The lower the distance, the higher the closeness centrality.\n\n4.  **Eigenvector centrality** $E = AE$ for adjacency matrix $A$ and vector $E$. Defined in \"Ownership Networks\".\n\n5. **Betweenness centrality**. $B_i = \\frac{2}{n(n-1)} \\sum_{j,k} \\frac{\\sigma(j,k|i)}{\\sigma(j,k)}$  where $\\sigma(j,k|i)$ is the weighted number of paths which pass from $j$ to $k$ through $i$ and $\\sigma(j,k)$ is the weighted numbeer of paths that pass from $j$ to $k$.\n\n    > <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. The betweenness centrality of node $i$ is the proportion of shortest paths from one node to another which pass through $i$, weighted by the total possible number of paths ($\\frac{2}{n(n-1)}$).\n\n6. **Community importance**. Classifies nodes into \"bridge\" and \"core\". Bridge nodes bridge two communities; core nodes serve as trade hubs for their communities.\n\n> <span style=\"background-color: #12ffd7; color: black;\">Results</span>.\n\n- US ranks first in strength, eigenvector and community centralities. China ranks second; large gap between China and other countries.\n- Large degree centralities for most countries.\n- Large portion of strength centrality concentrated in small number of countries.\n- Closeness centrality shows that most countries are fairly well-connected and close.\n- Strong correlation (0.968) between strength and eigenvector centralities; i.e. countries which take up large share of world trade have important trading partners.\n- Low betweenness values for most countries. \n- High correlation between core nodes in communities and high strength centralities.\n\n\n****\n\n- **Role of the EU**. If taken as an aggregated vertex, the EU ranks ahead on all metrics. The UK has little trading incentive to leave the EU.\n\n### Cascading failure and bootstrap percolation\n\n> <span style=\"background-color: #bc42f5; color: black;\">Method</span>. The **bootstrap percolation** method is applied to measure the cascading effects of a trading crisis for one country on the rest of the WTN. \n\n- Nodes are defined to be either **normal** or **abnormal**: normal represents stable exports/imports from that country, abnormal represents a trading crisis\n1. All countries are initially normal.\n2. Suppose that the trading link between $i$ and $j$ fails, making $i$ and $j$ both abnormal.  For each normal country, the proportion\n$$\n\\frac{(\\text{abnormal imports})}{(\\text{normal imports})}\n$$\nis found, i.e. the proportion of its imports from abnormal countries to its imports from normal countries. If this proportion exceeds the **defense threshold** value, that country becomes abnormal.\n3. Repeat until there is no change to the WTN.\n\n> <span style=\"background-color: #12ffd7; color: black;\">Results</span>.\n\n- Failure propagation is measured by **scope of impact**, i.e. the proportion of countries that become abnormal.\n- Scope of impact is sensitive to defense threshold: if defense threshold is 0.1, a random disconnection yields a scope of impact of 0.1 (18 countries), while if defense threshold is 0.3, only 2 countries are affected on average.\n- Exports from the EU to Japan are found to be particularly important.\n\n","n":0.028}}},{"i":93,"$":{"0":{"v":"Clustering","n":1},"1":{"v":"Papers on the formation of trade blocs or communities based on lustering, or on clustering/community detection techniques in general in weighted graphs.","n":0.213}}},{"i":94,"$":{"0":{"v":"Trading Blocs and the Americas","n":0.447},"1":{"v":"### Frankel et al., 1994","n":0.447}}},{"i":95,"$":{"0":{"v":"Trade Networks of the BRI","n":0.447},"1":{"v":"### Song et al., 2018","n":0.447}}},{"i":96,"$":{"0":{"v":"Trade Blocs in an Era of Globalization","n":0.378},"1":{"v":"### Kohl and Brouwer, 2014\n","n":0.447}}},{"i":97,"$":{"0":{"v":"The Rise of China","n":0.5},"1":{"v":"\n\n### Zhu et al., 2014","n":0.447}}},{"i":98,"$":{"0":{"v":"Structure and Formation of Top Networks","n":0.408},"1":{"v":"### Zhou et al., 2016","n":0.447}}},{"i":99,"$":{"0":{"v":"Rich-Club Phenomenon","n":0.707},"1":{"v":"### Bhattacharya et al.\n\nAnalysis of the weighted WTN reveals a log-normal distribution of scaled link weights; power-law growth of trade strenght with GDP holding true for all countries; **\"rich-club coefficient\"** analysis reveals that the size of the rich club (countries controlling top 50% of all trade) is shrinking. Simple dynamical model based on gravity model reproduces properties of WTN.\n\n****\n\n## Methods and Results\n\n- Dataset is bilateral trade over 53 years\n    - Number of links and nodes grew systematically\n    - Link density roughly constant\n- Adjacency matrix used is $\\frac{e_{ij}+e_{ji}+i_{ij}+i_{ji}}{2}$ where $e$ is exports and $i$ is imports, to smooth ouut inconsistencies between $e_{ji}$ and $i_{ij}$; this graph is symmetrical\n    - Distribution of weights broad; smallest less than $1M\\$$, largest more than $100000M$$\n    - Majority of links are small, with a few large links\n    - Average weight per link grows from 15.54 million dollars to 308.8 million dollars in 2000\n- **Probability density distribution** of link weights\n    - Log-log plots of link weight vs frequency have linear regions which are interpreted as a power law relationship for the PDF\n    - However, more accurate fits are given by a log-normal distribution\n        - Corroborated by Fagiolo et al. 2007 and Serrano 2007\n- Strength distribution of nodes\n    - Define $\\gamma = \\frac{\\partial \\log s}{\\partial \\log G}$ with $G$ being GDP and $s$ being the strength of a country in the WTN. This results in the log-log relationship between $s$ and $G$, which is found to be positive and constant (i.e. a power law) for a single country over time\n    - Distribution of $\\gamma$ for different countries:\n         - 12 countries larger than 2 - these countries are countries born after the dissolution of the USSR (makes sense because new trade relationships, i.e. strength in the graph, was created faster than GDP was gained)\n        - Avg is 1.26 (1.06 if 12 countries not taken into account)\n        - Irwin (2002) observes that GDP-world trade volume power law coefficient $\\approx 1.16$, close to country-average value\n- **Rich club coefficient**\n\n> <span style=\"background-color: #03cafc; color: black;\">Definition</span>. **Rich-club and rich-club coefficient**.\n\n- A \"rich club\" is a subset of $n_k$ nodes whose degree values are at least $k$\n- The \"rich-club coefficient\" of these nodes is defined as \n$$\n\\phi(k) = \\frac{2E_k}{n_k(n_k-1)}\n$$\ni.e. the density of the club.\n- Empirically, this definition has been shown to be insufficient: a randomly generated graph can occasionally display a rich-club effect\n\n- It is suggested that a **maximally random network** (MRN) with degrees equal to the WTN needs to be created, leading to a set of rich-club values $\\phi_{random}(k)$\n    - Then, the ratio $\\rho(k)=\\frac{\\phi(k)}{\\phi_{random}(k)}$ is observed to check how significant the rich-club effect of the WTN is vs. a randomly generated control\n- The binary WTN does not display significant rich-club effects ($\\phi \\approx 1$, no difference from a random network)\n- The weighted WTN can have a similar rich-club coefficient defined as \n$$\n\\phi(s) = \\frac{2\\sum_{i,j}w_{ij}}{n_s(n_s-1)}\n$$\nfor the $n_s$ nodes above node strength $s$.\n\n> <span style=\"background-color: #ffb812; color: black;\">Interpretation</span>. The rich-club coefficient is a measure of the weighted density of the rich club.\n\n- Correspondingly, a MRN is generated with both $k$ (degree) and $s$ (strength) preserved and with a symmetric weight matrix.\n- A self-iterative method is used:\n\n1. Arbitrary numbers to weights $w_{ij}$ are assigned, maintaining that $w_{ji} = w_{ij}$.\n2.  For every node $i$, the difference $\\delta_{i} = s_i - \\sum_{j} w_{ij}$ is calculated (i.e. how far away the current node strength is from the desired node strength)\n3. Weights for $i$ are updated as $w_{ij} \\to w_{ij} + \\delta_{i}\\frac{w_{ij}}{\\sum_{j} w_{ij}}$ such that $i$ has strength $s_i$.\n4. Repeat the above until weights converge.\n\n- A MRN generated with this method again yields $\\rho(k) \\approx 1$, i.e. rich club coefficients of the WTN are insignificant; this does not mean that rich clubs do not exist, and can be explained by the fact that the MRN and the ITN share 85% of elements (nodes have same degree and strengths)\n\n- A rich club effect can be demonstrated by simply considering the proprotion (% of trade volume owned by rich club countries).\n    - Top 19% of countries owned top 50% of trade in 1948; now 8% in 2000\n- **Dynamical model based on gravity model.**\n    - Basic model is the gravity model of trade $F_{ij} = \\frac{G m_i m_j}{l^2_{ij}}$; generalized to a parametric form\n\n    $$\n    F_{ij} = m^{\\alpha}_i (\\frac{m_j^{\\beta}}{l_{ij}^{\\theta}} / \\sum_{k\\neq i}\\frac{m_k^{\\beta}}{l_{ik}^{\\beta}})\n    $$\n    i.e. the base gravity model, w/ free parameters $\\alpha, \\beta, \\theta$, and considering the GDP/distances of every other country in the network aside from just $i$ and $j$.\n    - Want to recreate WTN from randomized graph through different timesteps:\n    1. Randomly assign distance and GDP data to nodes: a unit square represents the world, $N$ points are chosen in the square, and GDPs $m_1, m_2, ..., m_N$ are randomly assigned to them which sum to $1: \\sum_{i=1}^N m_i = 1$.\n    2. Randomly choose a country pair $(i, j)$.\n    3. Calculate magnitude of transaction by gravity model.\n    4. Adjust GDPs based on transaction:\n        - Define $\\tilde{F}_{ij}$ as $F_{ij}+F_{ji}$.\n        - Country $i$ loses GDP equal to its exports to $j$: $m_i = m_i - F_{ij}$.\n        - Country $j$ loses GDP equal to its exports to $i$; $m_j = m_j - F_{ji}$.\n        - Country $i$ gains a share $\\epsilon$ of $\\tilde{F_{ij}}$; country $j$ gains a share $1-\\epsilon$.\n        - Finally we thus have\n        $$\n        \\begin{cases}\n        m_i = m_i - F_{ij} + \\epsilon \\tilde{F}_{ij} + \\Delta_i \\\\\n        m_j = m_j - F_{ji} + (1-\\epsilon) \\tilde{F}_{ij} + \\Delta_j \\\\\n        \\end{cases}\n        $$\n        in which $\\Delta_i$ and $\\Delta_j$ are correction terms added to ensure that the GDPs do not become negative (countries cannot hold debts).\n        - $\\epsilon$ is randomly chosen for each interaction.\n    5. GDPs are rescaled so that they sum to 1.\n\n- This dynamical model eventually converges to a stationary state with the average square GDP fluctuating around a mean.\n- A graph is constructed after the model completes, with link weights equal to the total value of transactions $\\tilde{F}_{ij}$ between two countries over the iterations. The model is stopped when a desired density is reached.\n- The constructed graph has similar properties to the real WTN:\n    - GDP distribution consistent to Pareto law (Pareto 1987)\n    - Strength-strength correlation (strength of two connected nodes $s_i$ and $s_j$) is $w_{ij}^{\\nu}$ with $\\nu = 0.98$ in the large weight limit; this is similar to the real WTN with $w_{ij}^\\nu = 0.65 \\to 0.9$ for lower and higher weights respectively.\n\n    ","n":0.031}}},{"i":100,"$":{"0":{"v":"Rich Cores in Networks","n":0.5},"1":{"v":"### Ma and Mondragon, 2015","n":0.447}}},{"i":101,"$":{"0":{"v":"Network of Networks Perspective on Global Trade","n":0.378},"1":{"v":"### Maluck and Donner, 2015","n":0.447}}},{"i":102,"$":{"0":{"v":"Multi-Attribute Community Detection in WTN","n":0.447},"1":{"v":"\n\n### Grassi et al., 2021","n":0.447}}},{"i":103,"$":{"0":{"v":"Modularity and Community Structure in Networks","n":0.408},"1":{"v":"### Newman, 2006","n":0.577}}},{"i":104,"$":{"0":{"v":"Identifying the Community Structure of the WTN","n":0.378},"1":{"v":"### Barigozzi et al., 2011","n":0.447}}},{"i":105,"$":{"0":{"v":"Graph Clustering With GNNs","n":0.5},"1":{"v":"### Tsitsulin et al., 2023","n":0.447}}},{"i":106,"$":{"0":{"v":"Evolution of Community Structure","n":0.5},"1":{"v":"### Tzekina et al., 2008\n","n":0.447}}},{"i":107,"$":{"0":{"v":"Analyzing Global Geopolitical Stability","n":0.5},"1":{"v":"\n### Papadopoulos et al., 2023","n":0.447}}}]}
